[
  {
    "id": 1,
    "name": "Glimmeroot",
    "number": "001",
    "types": [
      "Grass"
    ],
    "image": "/images/Glimmeroot.png",
    "entry": "Sua composição é, em sua maioria, composta por gases e poeira estelar que foi absorvida pelo seu corpo, fazendo-o mais leve que o esperado.",
    "height_m": 0.7,
    "weight_kg": 4.5,
    "description": "O Glimmeroot é um Pokémon de tipo Planta, geralmente encontrado em clareiras, onde há luz solar plena, e em florestas adjacentes a montanhas ou campos. Sua coloração é majoritariamente verde, mas a característica mais notável é a presença de gases e poeiras cósmicas em tons de roxo, azul e ciano que compõem sua crina e a ponta de seu rabo, dando-lhe uma aparência de mini-nebulosa. \n Seus chifres são em formato de folha, com uma rigidez cartilaginosa, e funcionam como pequenos painéis solares biológicos. O Glimmeroot passa a maior parte do dia descansando ao sol, absorvendo passivamente a energia luminosa para crescer. \n O Glimmeroot é conhecido por sua personalidade calma e curiosa, sendo um Pokémon dócil e muito sociável. Diferentemente de suas evoluções, ele ainda não consegue absorver grandes quantidades de energia, o que o mantém em um estado de tranquilidade constante. \n A ligação com o Treinador se fortalece no silêncio; eles apreciam muito a companhia humana, e o simples ato de descansar junto ao Glimmeroot em uma clareira ensolarada é a forma mais eficaz de criar um vínculo profundo e duradouro. A lealdade de um Glimmeroot é considerada uma das mais puras da região.",
    "abilities": [{ "name": "Foco Solar (Solar Focus)", "desc": "Se o clima for Ensolarado, o Pokémon recupera 1/8 de seu HP máximo a cada turno." }],
    "hidden_ability": { "name": "Poder de Carga (Power Charge)", "desc": "O Ataque e o Ataque Especial do Pokémon aumentam em 1 estágio quando atingido por um movimento do tipo Elétrico (e o dano é negado, como uma imunidade)." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 2,
      "name": "Cellaraffe",
      "number": "002",
      "method": "Evolui no nível 16",
      "image": "/images/Cellaraffe.png"
    }
  ],
    "base_stats": {
      "hp": 45,
      "atk": 45,
      "def": 50,
      "spa": 65,
      "spd": 55,
      "spe": 50
    },
    "moves": [
      {
        "level": 1,
        "name": "Tackle",
        "type": "Normal",
        "category": "physical",
        "power": 40,
        "accuracy": 100
      },
      {
        "level": 1,
        "name": "Absorb",
        "type": "Grass",
        "category": "special",
        "power": 20,
        "accuracy": 100,
        "desc": "O usuário recupera metade dos pontos de vida infligidos ao oponente."
      },
      {
        "level": 3,
        "name": "Growl",
        "type":"Normal",
        "accuracy": 100,
        "desc": "Reduz o ataque do oponente."
      },
      {
        "level": 6,
        "name": "Leech Seed",
        "type": "Grass",
        "accuracy": 100,
        "desc": "Drena os PV do oponente a cada turno."
      },
      {
        "level": 10,
        "name": "Razor Leaf",
        "type": "Grass",
        "category": "physical",
        "power": 55,
        "accuracy": 95,
        "desc": "Alta taxa de acerto crítico."
      },
      {
        "level": 15,
        "name": "Synthesis",
        "type": "Grass",
        "desc": "O usuário recupera HP. A quantidade varia de acordo com o clima."
      }
    ]
  },
  {
    "id": 2,
    "name": "Cellaraffe",
    "number": "002",
    "types": [
      "Grass",
      "Electric"
    ],
    "image": "/images/Cellaraffe.png",
    "entry": "Conforme cresce, o pescoço de Cellaraffe se endurece, tornando mais difícil dobrá-lo, fazendo tarefas como beber água mais difíceis. Tendo que depender de fontes altas de comida e água ou da chuva.",
    "height_m": 1.7,
    "weight_kg": 78,
    "description": "O Cellaraffe é o estágio intermediário do pokémon, adquirindo a tipagem Elétrica. Seus chifres de painel solar se multiplicam, cobrindo sua cabeça com múltiplas estruturas rígidas, semelhantes a pequenas folhas carregadoras. A nebulosa cósmica em sua crina e cauda se expande e brilha com mais intensidade, variando a cor conforme sua carga interna. \n A energia é armazenada por todo o seu corpo, refletida pelas manchas e linhas que se acendem em seu pescoço, como um indicador de bateria visível. \n O Cellaraffe ainda mantém sua natureza calma de descansar e absorver energia. No entanto, sua principal característica é a dificuldade em controlar a carga absorvida. Quando ele coleta energia demais (especialmente em dias muito ensolarados), a sobrecarga o torna extremamente agitado e brincalhão. \n Na natureza, o Cellaraffe é tipicamente um Pokémon de fuga, preferindo se afastar quando ameaçado. Contudo, nesses estados de hiperatividade, ele pode descarregar a energia de duas formas: através de uma explosão elétrica descontrolada ou por contato físico, o que pode surpreender até mesmo o Treinador ao tentar tocá-lo.",
    "abilities": [{ "name": "Foco Solar (Solar Focus)", "desc": "Se o clima for Ensolarado, o Pokémon recupera 1/8 de seu HP máximo a cada turno." }],
    "hidden_ability": { "name": "Poder de Carga (Power Charge)", "desc": "O Ataque e o Ataque Especial do Pokémon aumentam em 1 estágio quando atingido por um movimento do tipo Elétrico (e o dano é negado, como uma imunidade)."},
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 3,
      "name": "Girarborarge",
      "number": "003",
      "method": "Evolui no nível 36",
      "image": "/images/Girarborarge.png"
    }
  ],
    "base_stats": {
      "hp": 60,
      "atk": 60,
      "def": 65,
      "spa": 85,
      "spd": 75,
      "spe": 65
    },
    "moves": [
      {
        "level": 16,
        "name": "Thunder Shock",
        "type": "Electric",
        "category": "special",
        "power": 40,
        "accuracy": 100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 18,
        "name": "Stomp",
        "type":"Normal",
        "category":"physical",
        "power":65,
        "accuracy":100,
        "desc": "65 de poder. Pode estremecer o oponente."
      },
      {
        "level": 23,
        "name": "Thunder Wave",
        "type": "Electric",
        "accuracy":90,
        "desc": "Paralisa o oponente."
      },
      {
        "level": 27,
        "name": "Magical Leaf",
        "type":"Grass",
        "category":"special",
        "power":60,
        "accuracy": "∞",
        "desc": "Ignora precisão e evasiva."
      },
      {
        "level": 32,
        "name": "Spark",
        "type":"Electric",
        "category":"physical",
        "power":65,
        "accuracy":100,
        "desc":"Pode paralisar o oponente."
      },
      {
        "level": 35,
        "name": "Energy Ball",
        "type":"Grass",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      }
    ]
  },
  {
    "id": 3,
    "name": "Girarborarge",
    "number": "003",
    "types": [
      "Grass",
      "Electric"
    ],
    "image": "/images/Girarborarge.png",
    "entry": "Girarborarge é um pokémon tanto diurno quanto noturno. Alguns indivíduos preferem dormir durante o dia enquanto absorvem luz do sol para se tornarem mais ativos à noite enquanto outros preferem manter-se acordados durante o dia enquanto se carregam de luz solar enquanto deixam a noite para dormir.",
    "height_m": 3.8,
    "weight_kg": 260,
    "description": "O Girarborarge é o ápice da linha, combinando a robustez de um tronco com a anatomia elegante da girafa. Seu pescoço e patas dianteiras se converteram em madeira sólida, formando um tronco imponente. Para trás dos ombros, ele retém sua pelagem verde e o padrão de manchas que agora funcionam como painéis solares orgânicos. Sua crina evoluiu para uma coroa de gases e poeiras estelares densas. \n Agora alto o suficiente para competir com as árvores adultas, o Girarborarge reside em florestas densas, embora não recuse a luz extra das clareiras. Ele domina o controle da energia, canalizando-a para suas manchas de painel e utilizando-a para suas habilidades únicas. \n O Girarborarge adota uma postura calma, majestosa e largamente indiferente ao mundo. Os laços formados em estágios anteriores com seu Treinador permanecem inquebráveis, mas criar novos vínculos se torna um desafio. Sua principal função na natureza é a supervisão e produção de recursos.",
    "abilities": [{ "name": "Foco Solar (Solar Focus)", "desc": "Se o clima for Ensolarado, o Pokémon recupera 1/8 de seu HP máximo a cada turno." }],
    "hidden_ability": { "name": "Poder de Carga (Power Charge)", "desc": "O Ataque e o Ataque Especial do Pokémon aumentam em 1 estágio quando atingido por um movimento do tipo Elétrico (e o dano é negado, como uma imunidade)." },
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 80,
      "atk": 70,
      "def": 100,
      "spa": 125,
      "spd": 95,
      "spe": 60
    },
    "moves": [
      {
        "level": 36,
        "name": "Stellar Nursery",
        "type": "Grass",
        "desc": "Causa o clima Ensolarado e, ao mesmo tempo, gera um item consumível Fruta Estelar para o usuário."
      },
      {
        "level": 42,
        "name": "Discharge",
        "type":"Electric",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 46,
        "name": "Giga Drain",
        "type":"Grass",
        "category":"special",
        "power":75,
        "accuracy":100,
        "desc": "O usuário recupera metade dos pontos de vida infligidos ao oponente."
      },
      {
        "level": 55,
        "name": "Calm Mind",
        "type": "Psychic",
        "desc": "Aumenta o Ataque Especial e Defesa Especial do usuário."
      },
      {
        "level": 60,
        "name": "Thunder Bolt",
        "type":"Electric",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 70,
        "name": "Leaf Storm",
        "type": "Grass",
        "category":"special",
        "power":130,
        "accuracy":90,
        "desc": "Reduz drasticamente o Ataque Especial do usuário."
      }
    ]
  },
  {
    "id": 4,
    "name": "Dynite",
    "number": "004",
    "types": [
      "Fire"
    ],
    "image": "/images/Dynite.png",
    "entry": "A maioria dos Dynite segue seu próprio rumo, se afastando dos irmãos e pais pouco tempo depois de nascer. Cerca de alguns meses é o que precisam para começar a explorar as regiões próximas de onde nasceram.",
    "height_m": 0.6,
    "weight_kg": 12,
    "description": "O Dynite é um Pokémon bípede que se assemelha a um Tyrunt, preferindo viver em áreas abertas e quentes, como campos secos, desertos e arredores de vulcões. Sua característica mais notável é sua língua, que funciona como um pavio, e a pequena estrutura semelhante a uma clava na ponta da cauda. Suas escamas são majoritariamente vermelhas e laranjas, mas as pontas das patas, cauda e cabeça já exibem escamas mais escuras, prenunciando a tipagem Pedra de sua evolução. \n O Dynite gera fogo através do atrito: ele bate os dentes para produzir uma faísca que instantaneamente acende sua língua-pavio. \n Conhecido por seu temperamento de 'Pavio Curto', o Dynite se estressa e se irrita com facilidade. Quando o estresse atinge o pico, o movimento de gerar a faísca e acender o pavio se torna automático, resultando em pequenas explosões de raiva. Ele usa o ato de mostrar a língua acesa como um aviso primário antes de explodir. \n Apesar da dificuldade em lidar com sua impulsividade, o Dynite é um Pokémon que desenvolve grande afinidade com seu Treinador. Ele se apega profundamente, mas expressa seu carinho através de travessuras e irritações constantes. O Treinador deve ter paciência para lidar com o filhote explosivo e evitar que ele se machuque durante suas crises.",
    "abilities": [{ "name": "Cabeça de Pedra (Rock Head)", "desc": "Previne qualquer dano de recuo causado pelos próprios movimentos do Pokémon." }],
    "hidden_ability": { "name": "Propulsor Cinético (Knetic Thruster)", "desc": "Aumenta a Velocidade do Pokémon em 1 estágio após ele usar um movimento que faz contato físico." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 5,
      "name": "Misseorite",
      "number": "005",
      "method": "Evolui no nível 16",
      "image": "/images/Misseorite.png"
    }
  ],
    "base_stats": {
      "hp": 50,
      "atk": 65,
      "def": 45,
      "spa": 40,
      "spd": 45,
      "spe": 65
    },
    "moves": [
      {
        "level": 1,
        "name": "Tackle",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Raging Flare",
        "type":"Fire",
        "category":"physical",
        "power":100,
        "accuracy":100,
        "desc": "O usuário recebe 1/4 do dano causado de recuo."
      },
      {
        "level": 3,
        "name": "Howl",
        "type":"Normal",
        "desc": "Aumenta o Ataque de aliados."
      },
      {
        "level": 6,
        "name": "Rage",
        "type":"Normal",
        "category":"physical",
        "power":20,
        "accuracy":100,
        "desc": "Aumenta o Ataque do usuário ao acertar."
      },
      {
        "level": 10,
        "name": "Fire Fang",
        "type":"Fire",
        "category":"physical",
        "power":65,
        "accuracy":95,
        "desc": "Pode estremecer e/ou causar queimadura no oponente."
      },
      {
        "level": 15,
        "name": "Defense Curl",
        "type":"Normal",
        "desc": "Aumenta a Defesa do usuário."
      }
    ]
  },
  {
    "id": 5,
    "name": "Misseorite",
    "number": "005",
    "types": [
      "Fire",
      "Rock"
    ],
    "image": "/images/Misseorite.png",
    "entry": "Por mais que sejam muito agressivos e um tanto imprevisíveis, os Misseorite quase nunca entram em combate entre si, baseando suas disputas quase que sempre em qual deles causa uma explosão maior.",
    "height_m": 1.7,
    "weight_kg": 115,
    "description": "O Misseorite é o estágio onde a linha adquire a tipagem Pedra. Suas escamas ao redor da cabeça e pescoço crescem e endurecem dramaticamente, transformando-se em uma casca espessa e aerodinâmica de rocha e meteorito. Devido ao peso da blindagem, ele adota uma postura quase quadrupede em campo, embora ainda possa se levantar. Sua cauda se alonga e ganha espinhos rochosos, servindo como contrapeso essencial para manobras de alta velocidade. \n Ele prefere terrenos acidentados como cânions e rochedos, onde pode usar a propulsão. O pavio em sua língua desaparece, e a ignição do fogo torna-se totalmente controlada, canalizada através de seus pés e boca. \n A impulsividade do Dynite se transforma em foco no Misseorite. Ele agora canaliza suas explosões internas para uma propulsão controlada, lançando-se de cabeça contra seus alvos com o revestimento de rocha. \n Na natureza, Misseorite se torna extremamente agressivo e territorial. Esse comportamento se manifesta em uma proteção intensa para com seu Treinador: ele passa a encarar o Treinador como parte de seu território a ser defendido a todo custo. Seu apego evolui para um guardião feroz e super protetor, usando sua nova blindagem para se lançar na linha de frente em qualquer ameaça.",
    "abilities": [{ "name": "Cabeça de Pedra (Rock Head)", "desc": "Previne qualquer dano de recuo causado pelos próprios movimentos do Pokémon." }],
    "hidden_ability": { "name": "Propulsor Cinético (Knetic Thruster)", "desc": "Aumenta a Velocidade do Pokémon em 1 estágio após ele usar um movimento que faz contato físico." },
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 6,
      "name": "Morteorex",
      "number": "006",
      "method": "Evolui no nível 36",
      "image": "/images/pyroak.svg"
    }
  ],
    "base_stats": {
      "hp": 65,
      "atk": 85,
      "def": 70,
      "spa": 55,
      "spd": 65,
      "spe": 70
    },
    "moves": [
      {
        "level": 16,
        "name": "Head Smash",
        "type":"Rock",
        "category":"physical",
        "power":150,
        "accuracy":50,
        "desc": "Usuário recebe dano de recuo."
      },
      {
        "level": 18,
        "name": "Rollout",
        "type":"Rock",
        "category":"physical",
        "power":30,
        "accuracy":90,
        "desc": "Dobra o poder a cada turno por 5 turnos."
      },
      {
        "level": 23,
        "name": "Flame Charge",
        "type":"Fire",
        "category":"physical",
        "power":50,
        "accuracy":100,
        "desc": "Aumenta a Velocidade do Usuário."
      },
      {
        "level": 27,
        "name": "Smack Down",
        "type":"Rock",
        "category":"physical",
        "power":50,
        "accuracy":100,
        "desc": "Torna pokémon do tipo voador vuneráveis a movimentos do tipo Terrestre."
      },
      {
        "level": 32,
        "name": "Rock Slide",
        "type":"Rock",
        "category":"physical",
        "power":75,
        "accuracy":90,
        "desc": "Pode estremecer o oponente."
      }
      ,
      {
        "level": 35,
        "name": "Iron Defense",
        "type":"Steel",
        "desc": "Aumenta drasticamente a Defesa do Usuário."
      }
    ]
  },
  {
    "id": 6,
    "name": "Morteorex",
    "number": "006",
    "types": [
      "Fire",
      "Rock"
    ],
    "image": "/images/pyroak.svg",
    "entry": "A explosão é algo que os Morteorex aprenderam a controlar com maestria, expressando isso normalmente numa personalidade calma, tranquila e impertubável. O tornando ótima companhia para treinadores e sendo características muito importantes para se lidar com os jovens Dynites e Misseorites.",
    "height_m": 2.5,
    "weight_kg": 420,
    "description": "O Morteorex é o ápice da linha de Fogo/Pedra. Seu corpo inteiro é revestido por placas de escama de rocha ígnea, que parecem se empilhar, com pequenos espaços quase invisíveis entre elas. O Morteorex é bípede e imponente. Nesses espaços, há um brilho constante de fogo interno, indicando que a base de suas escamas está perpetuamente aquecida a uma cor alaranjada, embora a cor externa permaneça escura. \n Ele prefere elevações e picos rochosos para manter vigilância sobre seu vasto território. Sua cauda, agora massiva e coberta por espetos de rocha ígnea, funciona como um tripé de suporte na hora do disparo e como uma clava devastadora em combate corpo a corpo. \n O Morteorex é calmo, estoico e imperturbável, tendo dominado completamente a impulsividade de seus estágios anteriores. Quando dormindo, ele se confunde perfeitamente com uma pilha de rochas, mas acordado, ele se assemelha a um vulcão ambulante. \n Sua habilidade primária é a Artilharia: o Morteorex canaliza sua explosão interna (controlada com maestria) para lançar suas próprias escamas de rocha ígnea — um ato completamente voluntário e indolor. Esse é o poder por trás de seu Movimento Assinatura, Bombardeio Meteórico, um ataque poderoso onde ele lança escamas flamejantes que explodem no impacto, espalhando magma e chamas na zona alvo. \n Apesar de sua baixa mobilidade (sacrificada pela blindagem), ele retém a capacidade de propulsão do Misseorite. Embora raramente use, a ideia de um Morteorex se lançando em alta velocidade contra um alvo é um lembrete do potencial destrutivo que o mundo deveria agradecer por sua natureza mais calma.",
    "abilities": [{ "name": "Cabeça de Pedra (Rock Head)", "desc": "Previne qualquer dano de recuo causado pelos próprios movimentos do Pokémon." }],
    "hidden_ability": { "name": "Propulsor Cinético (Knetic Thruster)", "desc": "Aumenta a Velocidade do Pokémon em 1 estágio após ele usar um movimento que faz contato físico." },
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 95,
      "atk": 135,
      "def": 110,
      "spa": 60,
      "spd": 70,
      "spe": 60
    },
    "moves": [
      {
        "level": 36,
        "name": "Meteor Barrage",
        "type":"Rock",
        "category":"physical",
        "power":120,
        "accuracy":90,
        "desc": "O campo do alvo fica coberto por detritos explosivos. O Pokémon que entrar em campo recebe dano e tem 10% de chance de sofrer o status Queimadura (Burn)."
      },
      {
        "level": 42,
        "name": "Flare Blitz",
        "type":"Fire",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "O Usuário recebe dano de recuo. Pode causar Queimadura."
      },
      {
        "level": 48,
        "name": "Swords Dance",
        "type":"Normal",
        "desc": "Aumenta drasticamente o Ataque do Usuário."
      },
      {
        "level": 55,
        "name": "Earthquake",
        "type":"Ground",
        "category":"physical",
        "power":100,
        "accuracy":100,
        "desc": "O poder é dobrado se o oponente estiver enterrado por causa de Dig."
      },
      {
        "level": 60,
        "name": "Outrage",
        "type":"Dragon",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário ataca 2-3 turnos mas então fica confuso."
      },
      {
        "level": 70,
        "name": "Double-Edge",
        "type":"Normal",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário recebe dano de recuo."
      }
    ]
  },
  {
    "id": 7,
    "name": "Shynarine",
    "number": "007",
    "types": [
      "Water"
    ],
    "image": "/images/Shynarine (placeholder).png",
    "entry": "A cauda de um Shynarine é muito forte para seu tamanho, servindo de meio de locomoção dentro e fora d'água ao girar como uma hélice em alta velocidade.",
    "height_m": 0.4,
    "weight_kg": 4,
    "description": "O Shynarine é um Pokémon de tipo Água, assemelhando-se a um cavalo-marinho compacto. Sua pele é completamente lisa e branca, e suas escamas refletem a luz com tanta facilidade que ele parece brilhar intensamente, mesmo sob iluminação fraca. A cauda, em vez de se curvar, é rígida e gira como uma hélice de alta propulsão, permitindo-lhe alcançar velocidades surpreendentes em águas rasas. \n Ele vive em águas costeiras rasas, preferindo áreas com muitos corais e areia clara, onde sua coloração o ajuda a se camuflar por contraste. Por ser um Pokémon fóbico, ele evita as profundezas onde a luz não alcança, temendo a escuridão. \n A personalidade do Shynarine é marcada por uma timidez e ansiedade intensas. Na natureza, essa fobia o mantém em um estado constante de nervosismo, e ele usa sua cauda-hélice para fugir rapidamente de qualquer estímulo desconhecido. \n Para um Treinador, o Shynarine é um Pokémon extremamente apegado, mas difícil de treinar devido ao seu temperamento medroso. Ele exige reafirmação e conforto constantes, buscando frequentemente se esconder nas pernas ou na mochila do Treinador. O vínculo de confiança se constrói através da paciência, garantindo a ele que o Treinador é um porto seguro contra tudo que ele teme.",
    "abilities": [{ "name": "Propulsão Acelerada (Accelerated Thrust)", "desc": "Aumenta a Evasão do Pokémon em 1 estágio após ele usar um movimento de Cura ou Status." }],
    "hidden_ability": { "name": "Penumbra (Umbral Veil)", "desc": "O Pokémon é imune a movimentos do tipo Não-Contato quando o clima está definido como Noite/Sombrio." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 8,
      "name": "Penumbrike",
      "number": "008",
      "method": "Evolui no nível 16",
      "image": "/images/pyroak.svg"
    }
  ],
    "base_stats": {
      "hp": 45,
      "atk": 45,
      "def": 50,
      "spa": 60,
      "spd": 50,
      "spe": 60
    },
    "moves": [
      {
        "level": 1,
        "name": "Tackle",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Water Gun",
        "type":"Water",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 3,
        "name": "Tail Whip",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a defesa do oponente."
      },
      {
        "level": 6,
        "name": "Smokescreen",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Precisão do oponente."
      },
      {
        "level": 10,
        "name": "Quick Attack",
        "type": "Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 15,
        "name": "Baton Pass",
        "type":"Normal",
        "desc":"O usuário troca de Pokémon e transfere as alterações de atributos para o Pokémon que entra."
      }
    ]
  },
  {
    "id": 8,
    "name": "Penumbrike",
    "number": "008",
    "types": [
      "Water",
      "Dark"
    ],
    "image": "/images/Penumbrike (placeholder).png",
    "entry": "Acredita-se que seu grande visor escuro seja do mesmo material que suas escamas pretas que compõem a parte frontal do seu corpo. O que se faz questionar se o brilho de seu corpo é por alguma característica translúcida da composição dessas escamas.",
    "height_m": 1,
    "weight_kg": 55,
    "description": "O Penumbrike é o estágio onde a linha adquire a tipagem Sombrio. Seu corpo se alonga e assume uma postura horizontal e rígida, que o faz parecer uma moto anfíbia que pode ser montada. \n Sua blindagem de escamas passa por uma mudança de cor dramática que reflete seu novo tipo: a cabeça e a metade frontal do corpo tornam-se completamente escuras, enquanto a metade traseira permanece clara, com uma linha turva de transição. Sua cabeça é adornada com pequenas pontas que formam uma coroa e um visor/óculos escuros que encobre seus olhos, simbolizando que ele agora abraça a escuridão que antes temia. \n A cauda-hélice é agora mais longa e forte, funcionando como um propulsor extremamente versátil e poderoso. Quando parado, ela se enrola sob o corpo, agindo como uma 'roda traseira' articulada. Seu peito, coberto por escamas especiais, é a única parte que toca o chão, permitindo-lhe deslizar e ser propulsionado em terra úmida ou pisos lisos. \n A ansiedade do Shynarine não desaparece, mas se transforma em extrema cautela e insegurança mascarada. O Penumbrike torna-se reservado, cauteloso e até um pouco orgulhoso, tratando outros Pokémon e Treinadores com certo desdém. Essa atitude rude é um mecanismo de defesa, um reflexo do seu medo anterior que agora se manifesta como arrogância e superioridade. \n Em batalha, sua cautela se traduz em táticas de evasão e desorientação. Ele utiliza seu repertório de movimentos para se tornar difícil de acertar e para causar efeitos debilitantes, atacando de forma furtiva e com precisão cirúrgica.",
    "abilities": [{ "name": "Propulsão Acelerada (Accelerated Thrust)", "desc": "Aumenta a Evasão do Pokémon em 1 estágio após ele usar um movimento de Cura ou Status." }],
    "hidden_ability": { "name": "Penumbra (Umbral Veil)", "desc": "O Pokémon é imune a movimentos do tipo Não-Contato quando o clima está definido como Noite/Sombrio." },
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 9,
      "name": "Sklypsea",
      "number": "009",
      "method": "Evolui no nível 40",
      "image": "/images/Sklypsea (placeholder).png"
    }
  ],
    "base_stats": {
      "hp": 60,
      "atk": 60,
      "def": 70,
      "spa": 90,
      "spd": 60,
      "spe": 70
    },
    "moves": [
      {
        "level": 16,
        "name": "Thief",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Rouba o item que o oponente estiver segurando."
      },
      {
        "level": 18,
        "name": "Aqua Jet",
        "type":"Water",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 23,
        "name": "Nasty Plot",
        "type":"Dark",
        "desc": "Aumenta drasticamente o Ataque Especial do Usuário."
      },
      {
        "level": 27,
        "name": "Icy Wind",
        "type":"Ice",
        "category":"special",
        "power":55,
        "accuracy":95,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 33,
        "name": "Hydro Pump",
        "type":"Water",
        "category":"special",
        "power":120,
        "accuracy":80
      },
      {
        "level": 38,
        "name": "Dark Pulse",
        "type":"Dark",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      }
    ]
  },
  {
    "id": 9,
    "name": "Sklypsea",
    "number": "009",
    "types": [
      "Water",
      "Dark"
    ],
    "image": "/images/Sklypsea (placeholder).png",
    "entry": "O Sklypsea é um dos pokémon mais raros de se encontrar visto seu comportamento isolacionista e capacidades de locomoção sem iguais.",
    "height_m": 1.8,
    "weight_kg": 135,
    "description": "O Sklypsea é o estágio final da linha, uma máquina de alta velocidade que representa o domínio do Eclipse Total e da furtividade. Seu corpo é longo, hidrodinâmico e aerodinâmico, fluindo suavemente de um peitoral robusto para uma cauda longa e fina, que ainda funciona como uma hélice de propulsão extremamente poderosa e eficiente. Suas nadadeiras evoluíram para asas longas e rígidas, permitindo-lhe voar com graça e silêncio. \n Sua blindagem de escamas é completamente preta na base, mas translúcida no topo. Quando contra a luz, as escamas geram um contorno brilhante ao redor do corpo, simulando a Aura Corona visível durante um eclipse. Sua coroa mantém as pontas brancas e luminosas do Shynarine. Ele é um mestre da locomoção em todos os ambientes, sendo encontrado nos pontos mais fundos do oceano e acima das nuvens. \n O Slypsea é um Pokémon solitário, silencioso e ágil. A insegurança de seus estágios anteriores se transformou em uma preferência por isolamento. Embora não seja rude, ele é reservado e exige que seu espaço seja respeitado. É extremamente difícil de ser avistado devido à sua natureza reclusa e sua impressionante capacidade de se mover sem som. \n Seu Movimento Assinatura, Manobra Sombria, é uma tática que explora seu design e tipagem: o Sklypsea voa em direção a uma fonte de luz, usando seu corpo para formar uma sombra instantânea e, quando a luz retorna, ele desapareceu, pegando o oponente de surpresa. Graças à sua coloração e furtividade, essa manobra funciona mesmo na ausência de fontes de luz fortes.",
    "abilities": [{ "name": "Propulsão Acelerada (Accelerated Thrust)", "desc": "Aumenta a Evasão do Pokémon em 1 estágio após ele usar um movimento de Cura ou Status." }],
    "hidden_ability": { "name": "Penumbra (Umbral Veil)", "desc": "O Pokémon é imune a movimentos do tipo Não-Contato quando o clima está definido como Noite/Sombrio." },
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 85,
      "atk": 90,
      "def": 90,
      "spa": 105,
      "spd": 80,
      "spe": 100
    },
    "moves": [
      {
        "level": 40,
        "name": "Shadow Maneuver",
        "type":"Dark",
        "desc": "Aumenta drasticamente a Evasão. Diminui drasticamente o Ataque e Ataque especial do oponente que errar um ataque."
      },
      {
        "level": 44,
        "name": "Ice Beam",
        "type":"Ice",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode congelar o oponente."
      },
      {
        "level": 50,
        "name": "Scald",
        "type":"Water",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode causar queimadura no oponente."
      },
      {
        "level": 56,
        "name": "Air Slash",
        "type":"Flying",
        "category":"special",
        "power":75,
        "accuracy":95,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 63,
        "name": "U-Turn",
        "type":"Bug",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "O usuário troca de lugar imediatamente após atacar."
      },
      {
        "level": 70,
        "name": "Focus Blast",
        "type":"Fighting",
        "category":"special",
        "power":120,
        "accuracy":70,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      }
    ]
  },
  {
    "id": 10,
    "name": "Serpina",
    "number": "010",
    "types": [
      "Normal"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Por mais que seja difícil de se encontrar e ganhar sua confiança, esse pokémon é um ótimo companheiro e pode ser levado para basicamente para qualquer lugar sem problemas.",
    "height_m": 0.4,
    "weight_kg": 4,
    "description": "O Serpina é um Pokémon serpente pequeno e muito comum. Sua coloração é uma mistura de marrom, laranja e tons amarelados, imitando perfeitamente a folhagem seca, galhos e cascalho de campos e florestas da Rota 1. \n Na ponta de sua cauda, o Serpina desenvolveu uma estrutura que se assemelha a uma pinha ou bolota. Ele a usa principalmente para comunicação sutil com outros de sua espécie e, em raras ocasiões de extrema ameaça, como uma clava fraca para desferir um golpe de curta distância. \n O Serpina tem uma natureza arisca típica de Pokémon-presa. Seu primeiro instinto é fugir e se esconder, dependendo de sua camuflagem para evitar predadores. \n Entretanto, se for encurralado e sentir que não há rota de fuga, ele não hesita em atacar para se defender. Seus ataques são simples e diretos, geralmente visando confundir o oponente momentaneamente para ganhar tempo. Sua tipagem puramente Normal reflete seu papel como uma criatura básica de Rota 1, com o potencial da tipagem Solo latente em sua conexão com o ambiente.",
    "abilities": [{ "name": "Fuga (Run Away)", "desc": "Permite uma fuga garantida de Pokémon selvagens." },{"name":"Intimidar (Intimidate)", "desc":"Reduz o atributo de Ataque do inimigo."}],
    "hidden_ability": { "name": "Pele Descamada", "desc": "O Pokémon pode curar seus próprios problemas de status." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 11,
      "name": "Viborosk",
      "number": "011",
      "method": "Evolui no nível 20",
      "image": "/images/pyroak.svg"
    }
  ],
    "base_stats": {
      "hp": 35,
      "atk": 40,
      "def": 45,
      "spa": 35,
      "spd": 40,
      "spe": 55
    },
    "moves": [
      {
        "level": 1,
        "name": "Wrap",
        "type":"Normal",
        "category":"physical",
        "power":15,
        "accuracy":90,
        "desc": "Prende o oponente, causando-o dano por 4-5 turnos."
      },
      {
        "level": 1,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 4,
        "name": "Sand Attack",
        "type":"Ground",
        "accuracy":100,
        "desc": "Diminui a Precisão do oponente."
      },
      {
        "level": 7,
        "name": "Slam",
        "type":"Normal",
        "category":"physical",
        "power":80,
        "accuracy":75
      },
      {
        "level": 10,
        "name": "Glare",
        "type":"Normal",
        "accuracy":100,
        "desc": "Paralisa o oponente."
      },
      {
        "level": 13,
        "name": "Coil",
        "type":"Poison",
        "desc": "Aumenta o Ataque, Defesa e Precisão do usuário."
      },
      {
        "level": 19,
        "name": "Rock Tomb",
        "type":"Rock",
        "category":"physical",
        "power": 60,
        "accuracy": 95,
        "desc": "Diminui a Velocidade do oponente."
      }
    ]
  },
  {
    "id": 11,
    "name": "Viborosk",
    "number": "011",
    "types": [
      "Normal",
      "Ground"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Viborosk é um pokémon que cresce muito, podendo sair de 2 metros de comprimeto até mais de 7 metros. Ainda assim, geralmente não é agressivo de nenhuma forma.",
    "height_m": 5.5,
    "weight_kg": 160,
    "description": "O Viborosk é a forma evoluída do Serpina, crescendo para um tamanho colossal. Sua aparência e textura de escamas se transformam drasticamente: seu corpo é agora uma massa longa e robusta que se assemelha a uma raiz retorcida ou um tronco de árvore caído (especialmente quando prestes a trocar de pele). \n O pequeno ornamento de pinha do Serpina evolui para uma estrutura ramificada e complexa, adornada com múltiplas pinhas menores. O Viborosk tipicamente mantém essa estrutura enterrada, retirando-a apenas para fins de socialização com outros de sua espécie ou para confundir oponentes. Ele vive em campos abertos e florestas, onde seu tamanho e camuflagem o tornam indistinguível do terreno. \n O Viborosk possui uma confiança absoluta em sua camuflagem. Ele evoluiu a partir da natureza arisca do Serpina para uma postura de defesa imóvel. Seu princípio é simples: se ele não se mover, ele não existe. É extremamente raro que um Viborosk reaja mesmo quando pisado ou usado como assento. Ele só se revela quando o disfarce é completamente desmascarado. \n Quando confrontado por predadores como o Washimpeckt, o Viborosk usa seu tamanho gigante não para atacar, mas para defender e intimidar, ganhando tempo para fugir ou se enterrar. A cauda ramificada é frequentemente usada para distrair o predador durante o processo de fuga.",
    "abilities": [{ "name": "Fuga (Run Away)", "desc": "Permite uma fuga garantida de Pokémon selvagens." },{"name":"Intimidar (Intimidate)", "desc":"Reduz o atributo de Ataque do inimigo."}],
    "hidden_ability": { "name": "Pele Descamada", "desc": "O Pokémon pode curar seus próprios problemas de status." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 110,
      "atk": 95,
      "def": 105,
      "spa": 40,
      "spd": 70,
      "spe": 40
    },
    "moves": [
      {
        "level": 20,
        "name": "Magnitude",
        "type":"Ground",
        "category":"physical",
        "accuracy":100,
        "desc": "Acerta com um poder aleatório."
      },
      {
        "level": 23,
        "name": "Body Slam",
        "type":"Normal",
        "category":"physical",
        "power":85,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 28,
        "name": "Stockpile",
        "type":"Normal",
        "desc": "Armazena ernegia para usar com Split Up e Swallow."
      },
      {
        "level": 33,
        "name": "Earthquake",
        "type":"Ground",
        "category":"physical",
        "power":100,
        "accuracy":100,
        "desc": "O poder é dobrado se o oponente estiver enterrado por causa de Dig."
      },
      {
        "level": 38,
        "name": "Ingrain",
        "type":"Grass",
        "desc": "Usuário recupera HP a cada turno. Não pode fugir ou trocar."
      },
      {
        "level": 45,
        "name": "Last Resort",
        "type":"Normal",
        "category":"physical",
        "power":140,
        "accuracy":100,
        "desc": "Pode apenas ser usado depois que todos os outros movimentos tenham sido usados."
      }
    ]
  },
  {
    "id": 12,
    "name": "Passimpata",
    "number": "012",
    "types": [
      "Flying"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Esse pokémon é um tanto problemático quando se trata de convivência, podendo atacar até mesmo companheiros puramente porque sentiu que gostaria.",
    "height_m": 0.3,
    "weight_kg": 2,
    "description": "O Passimpata é uma ave comum de Rota 1. Seu corpo é coberto por penas marrom e cinza de camuflagem. No entanto, ele possui um bico notavelmente pontudo e resistente, e suas patas são robustas, permitindo-lhe agarrar e escalar com eficiência. Um toque de penas vermelhas na cabeça ou no peito prenuncia a ferocidade de sua evolução. \n Ele vive em campos abertos e florestas com árvores, onde usa o bico forte para bicar madeira e cascas em busca de insetos e larvas. \n O Passimpata não é agressivo por natureza contra outras espécies; ele demonstra sua ferocidade principalmente em disputas internas por território e comida com outros Passimpatas. \n O conflito principal com a linha Serpina é puramente acidental: o Passimpata, em sua busca por alimento, bica repetidamente galhos e pinhas que se parecem com o Serpina. Essa bicada constante força o Serpina a evoluir defensivamente. A reação violenta do Serpina após ser bicado é o que ensina ao Passimpata a usar seu bico e patas de forma ofensiva, preparando-o para o tipo Lutador em sua evolução.",
    "abilities": [{ "name": "Olhar Atento (Keen Eye)", "desc": "Impede que outros Pokémon diminuam a precisão." }],
    "hidden_ability": { "name": "Estômago (Guts)", "desc": "Aumenta o Ataque se houver algum problema de status." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 13,
      "name": "Washimpeckt",
      "number": "013",
      "method": "Evolui no nível 18",
      "image": "/images/Washimpeckt (placeholder).png"
    }
  ],
    "base_stats": {
      "hp": 40,
      "atk": 60,
      "def": 35,
      "spa": 30,
      "spd": 30,
      "spe": 65
    },
    "moves": [
      {
        "level": 1,
        "name": "Peck",
        "type":"Flying",
        "category":"physical",
        "power":35,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Growl",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui o Ataque do oponente."
      },
      {
        "level": 4,
        "name": "Quick Attack",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "O usuário ataca primeiro."
      },
      {
        "level": 7,
        "name": "Fury Attack",
        "type":"Normal",
        "category":"physical",
        "power":15,
        "accuracy":85,
        "desc": "Acerta 2-5 vezes em um turno."
      },
      {
        "level": 11,
        "name": "Wing Attack",
        "type":"Flying",
        "category":"physical",
        "power":60,
        "accuracy":100
      },
      {
        "level": 15,
        "name": "Agility",
        "type":"Psychic",
        "desc":"Aumenta drasticamente a Velocidade do usuário."
      },
      {
        "level": 17,
        "name": "Brave Bird",
        "type":"Flying",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário recebe dano de recuo."
      }
    ]
  },
  {
    "id": 13,
    "name": "Washimpeckt",
    "number": "013",
    "types": [
      "Flying",
      "Fighting"
    ],
    "image": "/images/Washimpeckt (placeholder).png",
    "entry": "Poucos pokémon são capazes de causar tanto medo nos outros quanto o Washimpeckt causa nos outros moradores da Rota 1, apenas com um olhar de relance. Dizem que até mesmo o destemido Saberatus o evita.",
    "height_m": 1.8,
    "weight_kg": 35,
    "description": "O Washimpeckt é a forma final da linha de pássaros da Rota 1, evoluindo de um pequeno Passimpata para uma ave de rapina terrestre e aérea. Sua tipagem Lutador manifesta-se em suas pernas longas e incrivelmente potentes, que são sua principal arma. \n Sua plumagem é uma mistura de branco e cinza, com detalhes vermelhos vivos que adornam suas penas, intensificando a ferocidade de sua evolução. Sua cabeça mantém um bico forte, mas é a força concentrada em suas pernas que o torna um predador de sucesso. Ele é um caçador de campo aberto, onde pode usar sua velocidade de corrida e suas patadas fulminantes. \n O Wahimpeckt é um caçador eficiente e metódico que possui uma taxa de sucesso muito alta. Seu modo de caça é de espera e disparo: ele vaga pela área até que algo — um movimento, um som ou uma vibração incomum — chame sua atenção. Ele então congela (postura de caça), avalia a situação e, se confirmar que é uma presa, dispara em alta velocidade com suas pernas longas, finalizando o alvo com uma série de chutes rápidos. \n Ele não possui habilidades de detecção especializadas que superem a camuflagem perfeita do Viborosk, mas a sua estratégia de chutes repetitivos e de alto impacto permite que ele derrote presas que usam camuflagem ou defesa pesada (como o Viborosk, ao bicá-lo até ele se mexer). Sua ferocidade juvenil se transforma em disciplina e foco predatório.",
    "abilities": [{ "name": "Olhar Atento (Keen Eye)", "desc": "Impede que outros Pokémon diminuam a precisão." }],
    "hidden_ability": { "name": "Estômago (Guts)", "desc": "Aumenta o Ataque se houver algum problema de status." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 65,
      "atk": 110,
      "def": 65,
      "spa": 60,
      "spd": 65,
      "spe": 85
    },
    "moves": [
      {
        "level": 18,
        "name": "Slam Kick",
        "type":"Fighting",
        "category":"physical",
        "power":100,
        "accuracy":100,
        "desc": "Causa dano extra em alvos menores e/ou mais pesados."
      },
      {
        "level": 20,
        "name": "Double Kick",
        "type":"Fighting",
        "category":"physical",
        "power":30,
        "accuracy":100,
        "desc": "Acerta duas vezes em um turno."
      },
      {
        "level": 23,
        "name": "Acrobatics",
        "type":"Flying",
        "category":"physical",
        "power":55,
        "accuracy":100,
        "desc": "Mais forte quando o usuário não está segurando um item."
      },
      {
        "level": 28,
        "name": "Bulk Up",
        "type":"Fighting",
        "desc": "Aumenta O Ataque e Defesa do usuário."
      },
      {
        "level": 33,
        "name": "Close Combat",
        "type": "Fighting",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Diminui a Defesa e Defesa Especial do usuário."
      },
      {
        "level": 38,
        "name": "Drill Peck",
        "type":"Flying",
        "category":"physical",
        "power":80,
        "accuracy":100
      },
      {
        "level": 45,
        "name": "Swords Dance",
        "type":"Normal",
        "desc":"Aumenta drasticamente o Ataque do Usuário."
      },
      {
        "level": 52,
        "name": "High Jump Kick",
        "type":"Fighting",
        "category":"physical",
        "power":130,
        "accuracy":90,
        "desc":"Se errar, o usuário perde metade do HP."
      }
    ]
  },
  {
    "id": 14,
    "name": "Ratusk",
    "number": "014",
    "types": [
      "Normal"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Outros pokémon da Rota 1 temem se encontrar com este pequeno roedor. Mesmo que muitos possam ganhar em uma batalha, ainda assim, sua perseverança é de se assustar.",
    "height_m": 0.3,
    "weight_kg": 3.5,
    "description": "O Ratusk é um pequeno Pokémon roedor, nativo de áreas secas e campestres. Seu corpo é coberto por uma pelagem marrom-bege discreta. A única característica notável em sua anatomia são seus dentes incisivos: são notavelmente brilhantes, polidos e duros, antecipando a tipagem Aço de sua evolução. Ao roer materiais duros ou se preparar para um ataque, ele range os dentes, emitindo um som agudo e metálico. \n O Ratusk é um caçador implacável e perseverante. Sua personalidade é marcada por uma agressividade destemida, especialmente contra presas perigosas. Ele ignora o perigo de veneno graças à sua alta resistência inata, o que o torna um predador que ataca sem hesitar. \n Seu método de caça é direto, mas ele é facilmente enganado pela camuflagem.",
    "abilities": [{ "name": "Correria (Hustle)", "desc": "Aumenta o Ataque, mas diminui a Precisão" }],
    "hidden_ability": { "name": "Garra Forte (Tough Claws)", "desc": "Aumenta o poder de movimentos físicos." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 15,
      "name": "Saberatus",
      "number": "015",
      "method": "Evolui no nível 20",
      "image": "/images/Saberatus (placeholder).png"
    }
  ],
    "base_stats": {
      "hp": 40,
      "atk": 65,
      "def": 40,
      "spa": 30,
      "spd": 40,
      "spe": 55
    },
    "moves": [
      {
        "level": 1,
        "name": "Scratch",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 4,
        "name": "Sand Attack",
        "type":"Ground",
        "accuracy":100,
        "desc": "Diminui a Precisão do oponente."
      },
      {
        "level": 7,
        "name": "Bite",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 10,
        "name": "Quick Attack",
        "type": "Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 13,
        "name": "Headbutt",
        "type":"Normal",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc":"Pode estremecer o oponente."
      },
      {
        "level": 16,
        "name": "Crunch",
        "type":"Dark",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode diminuir a Defesa do oponente."
      },
      {
        "level": 19,
        "name": "Iron Head",
        "type":"Steel",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode estremecer o oponente."
      }
    ]
  },
  {
    "id": 15,
    "name": "Saberatus",
    "number": "015",
    "types": [
      "Normal",
      "Steel"
    ],
    "image": "/images/Saberatus (placeholder).png",
    "entry": "Este pokémon é dificil de se encontrar na natureza, o que é um alívio para pessoas e outros pokémon.",
    "height_m": 0.8,
    "weight_kg": 25,
    "description": "O Saberatus é a evolução feroz do Ratusk e manifesta o poder destemido que sempre possuiu. Uma máscara/capacete de metal cobre parte de sua face. Desta blindagem emergem duas presas caninas gigantes de aço que funcionam como verdadeiros dentes de sabre, adicionando uma silhueta de predador temível. Os dentes incisivos originais do Ratusk também se tornam totalmente metálicos e incrivelmente duros, crescendo constantemente e garantindo uma mordida poderosa. \n O resto do seu corpo, embora mantendo a pelagem marrom-bege, é marcado por cicatrizes e marcas de batalha, dando-lhe a aparência de um sobrevivente implacável. Os espaços para os olhos no capacete ficam completamente escuros, exceto pelo brilho assustador de seus olhos internos, aumentando o terror. \n O Saberatus é um atacante frenético. Ele abandona qualquer cautela e ataca indiscriminadamente tudo o que vê, motivado por uma agressividade extrema. Sua evolução para o tipo Aço confere-lhe imunidade total a venenos, permitindo-lhe ignorar completamente qualquer tática venenosa de seus oponentes e atacar predadores perigosos com uma coragem imprudente que só o tipo Aço permite.",
    "abilities": [{ "name": "Correria (Hustle)", "desc": "Aumenta o Ataque, mas diminui a Precisão" }],
    "hidden_ability": { "name": "Garra Forte (Tough Claws)", "desc": "Aumenta o poder de movimentos físicos." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 65,
      "atk": 125,
      "def": 60,
      "spa": 40,
      "spd": 50,
      "spe": 110
    },
    "moves": [
      {
        "level": 20,
        "name": "Shredding Bite",
        "type":"Normal",
        "category":"physical",
        "power":110,
        "accuracy":100,
        "desc":"Diminui a Defesa do oponente e do usuário."
      },
      {
        "level": 23,
        "name": "Swords Dance",
        "type":"Normal",
        "desc": "Aumenta drasticamente o Ataque do Usuário."
      },
      {
        "level": 28,
        "name": "Assurance",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "O poder dobra se o oponente já recebeu dano no mesmo turno."
      },
      {
        "level": 33,
        "name": "Smart Strike",
        "type":"Steel",
        "category":"physical",
        "power":70,
        "desc": "O usuário perfura o oponente. Esse ataque nunca erra."
      },
      {
        "level": 38,
        "name": "Sucker Punch",
        "type": "Dark",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "Usuário ataca primeiro, mas só funciona se o oponente estiver preparando um ataque."
      },
      {
        "level": 45,
        "name": "High Horsepower",
        "type":"Ground",
        "category":"physical",
        "power":95,
        "accuracy":95,
        "desc":"O usuário ataca o alvo ferozmente usando todo o seu corpo."
      },
      {
        "level": 52,
        "name": "Iron Tail",
        "type":"Steel",
        "category":"physical",
        "power":100,
        "accuracy":75,
        "desc":"Pode diminuir a Defesa do oponente."
      }
    ]
  },
  {
    "id": 16,
    "name": "Tatutox",
    "number": "016",
    "types": [
      "Bug",
      "Poison"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Por mais que tenha um pelo macio e sedoso, recomenda-se não tocar, visto que esconde entre os fios, serdas venenosas.",
    "height_m": 0.3,
    "weight_kg": 2.5,
    "description": "Seu corpo é o de uma larva/lagarta, coberto por pelos densos e sedosos que escondem seus espinhos venenosos. Essa pelagem é marcada por cores de aviso vibrantes (como roxo-escuro e verde-ácido). \n O Tatutox é passivo e sua defesa é a retaliação por contato. Quando ameaçado, ele se enrola firmemente em uma bola, eriçando todos os seus pelos e espinhos venenosos para fora. Qualquer predador que o bique, toque, ou chute terá uma grande chance de ser envenenado. Sua sobrevivência depende da hesitação dos predadores.",
    "abilities": [{ "name": "Proteção contra poeira (Shield Dust)", "desc": "Bloqueia os efeitos adicionais dos ataques recebidos." },{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."}],
    "hidden_ability": { "name": "Esporo de Efeito (Effect Sopore)", "desc": "O contato pode causar intoxicação, paralisia ou sonolência." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 17,
      "name": "Caratox",
      "number": "017",
      "method": "Evolui no nível 10",
      "image": "/images/Caratox (placeholder).png"
    }
  ],
    "base_stats": {
      "hp": 45,
      "atk": 30,
      "def": 40,
      "spa": 35,
      "spd": 35,
      "spe": 35
    },
    "moves": [
      {
        "level": 1,
        "name": "Poison Sting",
        "type":"Poison",
        "category":"physical",
        "power":15,
        "accuracy":100,
        "desc":"Pode envenenar o oponente."
      },
      {
        "level": 1,
        "name": "Deffense Curl",
        "type":"Normal",
        "desc": "Aumenta a Defesa do usuário."
      },
      {
        "level": 4,
        "name": "String Shot",
        "type":"Bug",
        "accuracy":95,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 7,
        "name": "Acid Spay",
        "type":"Poison",
        "category":"special",
        "power":40,
        "accuracy":100,
        "desc": "Diminui drasticamente a Defesa Especial do oponente."
      }
    ]
  },
  {
    "id": 17,
    "name": "Caratox",
    "number": "017",
    "types": [
      "Bug",
      "Poison"
    ],
    "image": "/images/Caratox (placeholder).png",
    "entry": "Coberto por uma carapaça rígida, esse pokémon é constantemente confundido com sedimentos do terreno",
    "height_m": 0.7,
    "weight_kg": 15,
    "description": "O Caratox é o estágio de pupa. Ele se enrola em uma esfera maciça. Sua carapaça não é lisa, mas rugosa e incoerente, formada pelos pelos do Tatutox que se fundiram com secreções tóxicas e seu exoesqueleto, resultando em uma armadura extremamente densa. \n O Caratox é lento e se move voluntariamente dando pequenos impulsos para rolar e se reposicionar. Sua defesa, no entanto, é baseada em gases tóxicos direcionados. Quando mordido, ele libera um Gás Indutor de Sono e ele pode expelir uma Nuvem de Fumaça Espessa que serve como cortina de fumaça, diminuindo drasticamente a Precisão do oponente e obscurecendo sua visão no ar, permitindo que o Caratox role para longe.",
    "abilities": [{ "name": "Pele Descamada (Shed Skin)", "desc": "O Pokémon pode curar seus próprios problemas de status." },{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."}],
    "hidden_ability": { "name": "Esporo de Efeito (Effect Sopore)", "desc": "O contato pode causar intoxicação, paralisia ou sonolência." },
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 18,
      "name": "Slacratox",
      "number": "018",
      "method": "Evolui no nível 17",
      "image": "/images/pyroak.svg"
    }
  ],
    "base_stats": {
      "hp": 60,
      "atk": 25,
      "def": 85,
      "spa": 40,
      "spd": 75,
      "spe": 10
    },
    "moves": [
      {
        "level": 10,
        "name": "Iron Defense",
        "type":"Steel",
        "desc":"Aumenta drasticamente a Defesa do Usuário."
      },
      {
        "level": 12,
        "name": "Poison Gas",
        "type":"Poison",
        "accuracy":90,
        "desc": "Envenena o oponente."
      },
      {
        "level": 13,
        "name": "Sleep Powder",
        "type":"Grass",
        "accuracy":75,
        "desc": "Faz o oponente dormir."
      },
      {
        "level": 15,
        "name": "Smokescreen",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Precisão do oponente."
      }
    ]
  },
  {
    "id": 18,
    "name": "Slacratox",
    "number": "018",
    "types": [
      "Bug",
      "Poison"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Esse pokémon é famoso por seus inúmeros tipos de substâncias com efeitos diversos produzidas dentro de si. Recomenda-se cuidado ao se aproximar.",
    "height_m": 1.4,
    "weight_kg": 50,
    "description": "Seu novo exoesqueleto é liso e homogêneo, refletindo a cura completa após a fase de casulo, e funciona como uma armadura pesada. \n Ele se move lentamente, utilizando seus numerosos pares de pernas de forma cadenciada. Para atacar, ele se contorce com ferocidade, levantando a parte traseira do corpo como um escorpião, permitindo-lhe usar suas garras e presas com maior impacto. Ele possui esporões venenosos ao longo do corpo e libera os gases tóxicos (Sono, Fumaça) pela boca. \n O Slacratox é um mestre da Guerra de Desgaste. Seu objetivo não é a força bruta, mas sim sobreviver e neutralizar o inimigo. \n Quando confrontado com predadores como o Saberatus ou o Washimpeckt, sua estratégia é estritamente defensiva: ele usa a resistência de sua carapaça para absorver ataques até conseguir uma abertura. Ele prioriza causar efeitos negativos para tornar o adversário indefeso ou forçá-lo a recuar.",
    "abilities": [{ "name": "Proteção contra poeira (Shield Dust)", "desc": "Bloqueia os efeitos adicionais dos ataques recebidos." },{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."}],
    "hidden_ability": { "name": "Esporo de Efeito (Effect Sopore)", "desc": "O contato pode causar intoxicação, paralisia ou sonolência." },
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 90,
      "atk": 80,
      "def": 110,
      "spa": 60,
      "spd": 90,
      "spe": 30
    },
    "moves": [
      {
        "level": 17,
        "name": "Coil",
        "type":"Poison",
        "desc":"Aumenta o Ataque, Defesa e Precisão do usuário."
      },
      {
        "level": 19,
        "name": "Bug Bite",
        "type":"Bug",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Recebe o efeito da fruta segurada pelo oponente."
      },
      {
        "level": 23,
        "name": "Venoshock",
        "type":"Poison",
        "category":"special",
        "power":65,
        "accuracy":100,
        "desc": "Causa o dobro de dano se o alvo estiver envenenado."
      },
      {
        "level": 28,
        "name": "Toxic Rush",
        "type":"Poison",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "Pode deixar o oponente gravemente envenenado."
      }
      ,
      {
        "level": 33,
        "name": "Leech Life",
        "type":"Bug",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc": "O usuário recupera metade dos pontos de vida infligidos ao oponente."
      },
      {
        "level": 39,
        "name": "Gastro Acid",
        "type":"Poison",
        "accuracy":100,
        "desc": "Cancela o efeito da habilidade do oponente."
      },
      {
        "level": 44,
        "name": "Cross Poison",
        "type":"Poison",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "Alta chance de acerto crítico. Pode envenenar o oponente."
      },
      {
        "level": 50,
        "name": "Megahorn",
        "type":"Bug",
        "category":"physical",
        "power":120,
        "accuracy":100
      }
    ]
  },
  {
    "id": 19,
    "name": "Lipony",
    "number": "019",
    "types": [
      "Fairy"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Este pokémon é um dos mais variados conhecidos. Sua variação de cores de pelagem, crina e outros, faz com que cada um deles seja único para cada treinador que tenha a sorte de criar amizade com eles.",
    "height_m": 0.8,
    "weight_kg": 25,
    "description": "O Lipony é um Pokémon potro pequeno e amigável, nativo de Campos Floridos e Clareiras Ensolaradas. Sua pelagem é curta, suave e de cor branca ou creme, liberando um odor doce e reconfortante (como baunilha) que acalma outros Pokémon por perto. Lipony é a forma base de uma linha de Pokémon que evolui com base nos laços de afeto. \n Sua característica mais notável é uma pequena mancha disforme e multicor que possui na lateral da coxa, um prenúncio de seu potencial de evolução. Enquanto o Lipony não estabelece um laço forte, a mancha apenas oscila e se altera constantemente. \n O Lipony é extremamente sociável e amigável, sendo encontrado em grandes bandos. Sua magia está diretamente ligada à força de seus laços emocionais. Quando Lipony está feliz e rodeado de amigos, ele irradia um poderoso campo de energia Fada que aumenta a Moral e fortalece seus aliados, refletindo o lema de que 'a amizade é mágica'. \n Dificilmente um bando de Lipony é atacado a não ser que pokémon de tipo Dark. No entanto, se um bando de Lipony for atacado, eles usam sua magia em conjunto para defender o grupo. Apenas quando o Lipony forma um laço de amizade profundo, essa mancha na coxa começa a se inclinar para a forma final de sua evolução, indicando o tipo que ele manifestará.",
    "abilities": [{ "name": "Charme fofo (Cute Charm)", "desc": "O contato com o Pokémon pode causar paixão." }],
    "hidden_ability": { "name":"Guarda Amiga (Friend Guard)", "desc":"Reduz o dano causado a aliados." },
    "evolution_display_type": "BRANCHING",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions":[
      {
        "id": 20,
        "name": "Twilux",
        "number": "020",
        "method": "Evolui com amizade máxima e Elemento da Magia",
        "image": "/images/Twilux (placeholder).png"
      },
      {
        "id": 21,
        "name": "Rainboost",
        "number": "021",
        "method": "Evolui com amizade máxima e Elemento da Lealdade",
        "image": "/images/Rainboost (placeholder).png"
      },
      {
        "id": 22,
        "name": "Agerjack",
        "number": "022",
        "method": "Evolui com amizade máxima e Elemento da Honestidade",
        "image": "/images/Agerjack (placeholder).png"
      },
      {
        "id": 23,
        "name": "Crystarity",
        "number": "023",
        "method": "Evolui com amizade máxima e Elemento da Generosidade",
        "image": "/images/Crystarity (placeholder).png"
      },
      {
        "id": 24,
        "name": "Flowershy",
        "number": "024",
        "method": "Evolui com amizade máxima e Elemento da Bondade",
        "image": "/images/Flowershy (placeholder).png"
      },
      {
        "id": 25,
        "name": "Pinkaos",
        "number": "025",
        "method": "Evolui com amizade máxima e Elemento do Riso",
        "image": "/images/Pinkaos (placeholder).png"
      }
    ],
    "base_stats": {
      "hp": 55,
      "atk": 55,
      "def": 55,
      "spa": 55,
      "spd": 55,
      "spe": 55
    },
    "moves": [
      {
        "level": 1,
        "name": "Disarming Voice",
        "type":"Fairy",
        "category":"special",
        "power":40,
        "accuracy":"∞",
        "desc":"Ignora precisão e evasiva."
      },
      {
        "level": 1,
        "name": "Growl",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui o Ataque do oponente."
      },
      {
        "level": 5,
        "name": "Fairy Wind",
        "type":"Fairy",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 10,
        "name": "Quick Attack",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 15,
        "name": "Charm",
        "type":"Fairy",
        "accuracy":100,
        "desc": "Diminui drasticamente o Ataque do oponente."
      },
      {
        "level": 20,
        "name": "Wish",
        "type":"Normal",
        "desc": "Cura o HP do usuário no próximo turno."
      },
      {
        "level": 25,
        "name": "Draining Kiss",
        "type":"Fairy",
        "category":"special",
        "power":50,
        "accuracy":100,
        "desc": "Usuário recupera a maior parte do dano causado ao oponente."
      }
    ]
  },
  {
    "id": 20,
    "name": "Twilux",
    "number": "020",
    "types": [
      "Fairy",
      "Psychic"
    ],
    "image": "/images/Twilux (placeholder).png",
    "entry": "Este pokémon tem um comportamento único, sendo metédico e organizado, mas com certas manias difíceis de se lidar.",
    "height_m": 1.7,
    "weight_kg": 95,
    "description": "O Twilux é a forma manifestada do Elemento da Magia, evoluindo do Lipony através de um profundo laço de amizade e o uso do próprio elemento. Ele se transforma em um Unicórnio imponente, do tamanho de um Rapidash, com a pelagem de um roxo suave e uma crina esvoaçante. \n Seu chifre único é a chave de seu poder: ele é espiralado e adornado com runas que pulsam com energia Psíquica. O Twilux utiliza esse chifre para canalizar e amplificar seus feitiços. A marca disforme de Lipony se resolve em uma Estrela cintilante em sua coxa. \n O Twilux é reconhecido como um dos Pokémon mais inteligentes da região. Sua sede insaciável por conhecimento o leva a buscar ativamente lugares de aprendizado, como bibliotecas e universidades, embora a maioria seja encontrada ao lado de seus Treinadores, que são seus parceiros no estudo da magia. \n Ele usa a telecinesia para tarefas diárias, movendo objetos com a mente e levitando por curtas distâncias. Sua magia não é instintiva, mas o resultado de estudo e planejamento, o que o torna um estrategista brilhante. A habilidade de teletransporte é frequentemente discutida, mas a maioria dos pesquisadores acredita que seja um mito, devido à sua raridade.",
    "abilities": [{ "name": "Charme fofo (Cute Charm)", "desc": "O contato com o Pokémon pode causar paixão." }, {"name": "Sincronizar (Synchronize)", "desc":"Inflige queimaduras, veneno ou paralisia ao inimigo."}],
    "hidden_ability": { "name":"Guarda Mágica (Magic Guard)", "desc":"Protege o Pokémon de danos indiretos." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 70,
      "atk": 60,
      "def": 70,
      "spa": 125,
      "spd": 90,
      "spe": 110
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Psybeam",
        "type":"Psychic",
        "category":"special",
        "power":65,
        "accuracy":"100",
        "desc":"Pode confundir o oponente."
      },
      {
        "level": 28,
        "name": "Telekinesis",
        "type":"Psychic",
        "desc": "Ignora a Evasão do oponente por três turnos e concede imunidade a dano Terrestre."
      },
      {
        "level": 35,
        "name": "Emphatic Spell",
        "type":"Fairy",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Dobra o poder se tiver um stat boost ativo."
      },
      {
        "level": 42,
        "name": "Nasty Plot",
        "type":"Dark",
        "desc": "Aumenta drasticamente o Ataque Especial do Usuário."
      },
      {
        "level": 50,
        "name": "Psychic",
        "type":"Psychic",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level": 58,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 21,
    "name": "Rainboost",
    "number": "021",
    "types": [
      "Fairy",
      "Electric"
    ],
    "image": "/images/Rainboost (placeholder).png",
    "entry": "Seus cascos conseguem interagir com nuvens como se fossem estruturas sólidas.",
    "height_m": 1.6,
    "weight_kg": 80,
    "description": "O Rainboost é a forma manifestada do Elemento da Lealdade, evoluindo através de uma amizade inabalável e exposição ao próprio elemento da Lealdade. Ele se transforma em um Pégaso esguio e potente. Suas grandes asas são cobertas por penas coloridas, que brilham com as cores vibrantes de um arco-íris. \n O corpo do Rainboost gera eletricidade constantemente, e essa energia é diretamente proporcional à sua velocidade: quanto mais rápido ele voa, mais energia ele gera. A eletricidade envolve suas patas e, ao atingir o pico de sua velocidade, ele deixa um rastro marcante de arco-íris e faíscas elétricas por onde passa. Sua marca na coxa se manifesta como uma nuvem com um raio triplo. \n O Rainboost é a personificação da lealdade. O ato de evoluir para um Rainboost através do laço de amizade garante ao Treinador uma parceria duradoura e inabalável por toda a vida. \n Ele expressa sua alegria e energia interagindo com o clima, vagando pelo céu para brincar com as nuvens, arrastando-as e criando desenhos. Em combate, ele usa sua velocidade e o poder Elétrico para proteger seus amigos, sendo capaz de atrair e neutralizar raios. Sua natureza é amigável e cooperativa com as outras Ponevoluções, mantendo uma relação de amizade e camaradagem com o estudioso Twilux.",
    "abilities": [{ "name": "Para-raios (Lightning Rod)", "desc": "Atrai todos os movimentos do tipo Elétrico para aumentar o Ataque Especial." }, {"name": "Acionamento do Motor (Motor Drive)", "desc":"Aumenta a Velocidade se atingido por um movimento do tipo Elétrico."}],
    "hidden_ability": { "name":"Asas Vendaval (Gale Wings)", "desc":"Dá prioridade a movimentos do tipo voador." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 70,
      "atk": 105,
      "def": 65,
      "spa": 105,
      "spd": 70,
      "spe": 110
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Electro Ball",
        "type":"Electric",
        "category":"special",
        "accuracy":"100",
        "desc":"Quando mais rápido o usuário, mais forte o golpe."
      },
      {
        "level": 30,
        "name": "Quick Attack",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 38,
        "name": "Sonic Rainbow",
        "type":"Electric",
        "category":"special",
        "power":75,
        "accuracy":100,
        "desc": "Dobra o poder se agir primeiro."
      },
      {
        "level": 45,
        "name": "Brave Bird",
        "type":"Flying",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário recebe dano de recuo."
      },
      {
        "level": 53,
        "name": "Wild Charge",
        "type":"Electric",
        "category":"physical",
        "power":90,
        "accuracy":100,
        "desc": "Usuário recebe dano de recuo."
      },
      {
        "level": 60,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 22,
    "name": "Agerjack",
    "number": "022",
    "types": [
      "Fairy",
      "Ground"
    ],
    "image": "/images/Agerjack (placeholder).png",
    "entry": "Sua comida favorita são maçãs.",
    "height_m": 1.8,
    "weight_kg": 95,
    "description": "O Agerjack é a forma manifestada do Elemento da Honestidade, evoluindo do Lipony através de um laço de amizade e o elemento da Honestidade. Ele se transforma em um pokémon imponente e musculoso, com o físico robusto de um Mudsdale. Sua crina e cauda são castanhas e douradas, trançadas com um aspecto que lembra palha. \n Seu corpo é sinônimo de trabalho duro: os pelos longos de suas patas estão frequentemente sujos de terra e lama, e sua principal arma são seus cascos, usados para coices e ataques terrestres devastadores. Sua marca se resolve em um padrão de solo rachado com um broto de maçã no centro. \n O Agerjack é o âncora e a voz da razão entre as Ponevoluções. \n Sua aura Fada/Solo pulsa em desaprovação quando detecta a desonestidade, agindo com visível irritação contra mentiras.",
    "abilities": [{ "name": "Desastrado (Scrappy)", "desc": "Permite que os golpes atinjam pokémon do tipo Fantasma." }],
    "hidden_ability": { "name":"Desafiador (Defiant)", "desc":"Aumenta drasticamente o Ataque do Usuário quando os atributos são reduzidos." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 91,
      "atk": 121,
      "def": 111,
      "spa": 50,
      "spd": 75,
      "spe": 80
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Stomping Tantrum",
        "type":"Ground",
        "category":"physical",
        "power":75,
        "accuracy":100,
        "desc":"Movido pela frustração, o usuário ataca o alvo. Se o movimento anterior do usuário falhou, o poder deste movimento dobra."
      },
      {
        "level": 30,
        "name": "Play Rough",
        "type":"Fairy",
        "category":"physical",
        "power":90,
        "accuracy":90,
        "desc": "Pode diminuir o Ataque do oponente."
      },
      {
        "level": 38,
        "name": "Honest Charge",
        "type":"Ground",
        "category":"physical",
        "power":95,
        "accuracy":100,
        "desc": "O poder dobra se nenhum dos stats do Agerjack tiver sido alterado (aumentado ou diminuído) nas últimas duas rodadas."
      },
      {
        "level": 45,
        "name": "High Horsepower",
        "type":"Ground",
        "category":"physical",
        "power":95,
        "accuracy":95,
        "desc":"O usuário ataca o alvo ferozmente usando todo o seu corpo."
      },
      {
        "level": 53,
        "name": "Iron Defense",
        "type":"Steel",
        "desc": "Aumenta drasticamente a Defesa do Usuário."
      },
      {
        "level": 60,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 23,
    "name": "Crystarity",
    "number": "023",
    "types": [
      "Fairy",
      "Ice"
    ],
    "image": "/images/Crystarity (placeholder).png",
    "entry": "Perfeccionista, o Crystarity evita agir se puder errar. Sua elegância não poderia ser manchada por erros. Isso pode ser visto tanto quanto ponto forte com também ponto fraco",
    "height_m": 1.65,
    "weight_kg": 75,
    "description": "O Crystarity é a manifestação do Elemento da Generosidade. Ele se transforma em um Unicórnio elegante, cuja pelagem, de cor branca ou azul-claro, é fria ao toque e densa, parecendo porcelana lapidada ou gelo. \n Seu chifre é a sua característica mais notável: um diamante puro e cristalino, esculpido e facetado para a perfeição, que amplifica sua magia Fada e Gelo. A crina e a cauda são volumosas e esculturais, com mechas em tons de violeta e azul-claro que parecem fios de seda congelada. \n O Crystarity personifica a busca pela perfeição e a Generosidade. Sua natureza o torna um especialista em beleza e joias: ele possui um instinto mágico para encontrar preciosidades e realçar a 'joia' de seus aliados em batalha. \n Sua generosidade se manifesta no campo ao usar sua magia para proteger, curar e melhorar seus parceiros. Em combate, ele preza pela elegância e pelo controle, preferindo imobilizar o oponente com status para evitar lutas desordenadas.",
    "abilities": [{ "name": "Joalheiro (Gem Finder)", "desc": "Quando em campo, aumenta o maior stat do aliado (ou de si mesmo) em 1 estágio." }],
    "hidden_ability": { "name":"Perfeccionismo (Perfectionism)", "desc":"Aumenta a precisão de todos os movimentos." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 85,
      "atk": 60,
      "def": 106,
      "spa": 92,
      "spd": 137,
      "spe": 70
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Icy Wind",
        "type":"Ice",
        "category":"special",
        "power":55,
        "accuracy":95,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 30,
        "name": "Dazzling Gleam",
        "type":"Fairy",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Acerto todos os oponentes adjacentes."
      },
      {
        "level": 38,
        "name": "Generous Shimmer",
        "type":"Fairy",
        "desc": "Remove efeitos negativos e aumenta a Defesa Especial da equipe."
      },
      {
        "level": 45,
        "name": "Calm Mind",
        "type": "Psychic",
        "desc": "Aumenta o Ataque Especial e Defesa Especial do usuário."
      },
      {
        "level": 53,
        "name": "Ice Beam",
        "type":"Ice",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode congelar o oponente."
      },
      {
        "level": 60,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 24,
    "name": "Flowershy",
    "number": "024",
    "types": [
      "Fairy",
      "Grass"
    ],
    "image": "/images/Flowershy (placeholder).png",
    "entry": "Esse pokémon, por incrível que pareça, é sim capaz de fazer sons. Apenas são estremamente baixos devido a sua timidez.",
    "height_m": 1.55,
    "weight_kg": 70,
    "description": "O Flowershy é a manifestação da Bondade, evoluindo do Lipony através de um laço de amizade e o Elemento da Bondade. Ele se transforma em um Pégaso esguio e delicado, com uma pelagem suave e coloração em tons de amarelo-claro. \n Suas asas são de penas macias, mas sua crina e cauda são adornadas com flores e brotos, frequentemente arranjados como uma coroa de flores, que florescem quando ele usa sua magia. Sua marca são as Três Borboletas, que se manifestam como Borboletas de flores.",
    "abilities": [{ "name": "Curandeiro (Healer)", "desc": "Pode curar as condições negativas de um aliado." }],
    "hidden_ability": { "name":"Triagem (Triage)", "desc":"Dá prioridade a ações restauradoras." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 118,
      "atk": 58,
      "def": 87,
      "spa": 83,
      "spd": 97,
      "spe": 77
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Sleep Powder",
        "type":"Grass",
        "accuracy":75,
        "desc": "Faz o oponente dormir."
      },
      {
        "level": 30,
        "name": "Synthesis",
        "type": "Grass",
        "desc": "O usuário recupera HP. A quantidade varia de acordo com o clima."
      },
      {
        "level": 38,
        "name": "Bonded Bloom",
        "type":"Grass",
        "desc": "Cura 50% do HP faltante do usuário e dos aliados."
      },
      {
        "level": 45,
        "name": "Leech Seed",
        "type": "Grass",
        "accuracy": 100,
        "desc": "Drena os PV do oponente a cada turno."
      },
      {
        "level": 53,
        "name": "The Stare",
        "type":"Fairy",
        "accuracy": 100,
        "desc": "Reduz o Ataque e Ataque Especial do alvo em 2 estágios. Se o Flowershy sofrer dano (exceto por status) no turno anterior, a redução de Ataque e Ataque Especial se torna de 3 estágios (ao invés de 2)."
      },
      {
        "level": 60,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 25,
    "name": "Pinkaos",
    "number": "025",
    "types": [
      "Fairy",
      "Dark"
    ],
    "image": "/images/Pinkaos (placeholder).png",
    "entry": "De todas as manifestações dos Elementos da Amizade, o Pinkaos é aquele que mais se percebe uma interpretação distorcida, podendo às vezes sendo violento apenas para conseguir uma risada.",
    "height_m": 1.45,
    "weight_kg": 65,
    "description": "O Pinkaos é a manifestação do Elemento do Riso. Seu corpo é rosa, coberto de confetes e sprinkles que caem constantemente a cada salto, mas a aura Sombria causa brilhos e cores que piscam de forma caótica e imprevisível. \n Sua crina e cauda têm um volume icônico, mas são preenchidas com espirais de fumaça escura como um algodão doce sombrio, que se movem de forma independente. Sua marca são os Três Balões onde um deles está estourando e liberando fumaça escura, simbolizando a quebra da ordem. \n Vivendo de acordo com as regras ilógicas do seu próprio caos, o que o conecta ao lado Sombrio da imprevisibilidade. Seu riso pode ser tanto alegre quanto destrutivo.",
    "abilities": [{ "name": "Brincalhão (Prankster)", "desc": "Dá prioridade a uma mudança de status." }],
    "hidden_ability": { "name":"Sentido da Pinkie (Pinkie Sense)", "desc":"Pode anular um golpe Super Efetivo além de aumentar a Velocidade do usuário." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 89,
      "atk": 97,
      "def": 73,
      "spa": 91,
      "spd": 95,
      "spe": 88
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Parting Shot",
        "type":"Ice",
        "desc": "Reduz o Ataque e o Ataque Especial do oponente e então troca de Pokémon."
      },
      {
        "level": 30,
        "name": "Play Rough",
        "type":"Fairy",
        "category":"physical",
        "power":90,
        "accuracy":90,
        "desc": "Pode diminuir o Ataque do oponente."
      },
      {
        "level": 38,
        "name": "Dark Pulse",
        "type":"Dark",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 45,
        "name": "Partyblast",
        "type": "Fairy",
        "category":"special",
        "power":120,
        "accuracy":60,
        "desc": "Pode causar um efeito de status aleatório. Se o alvo já tiver um efeito, dobra o poder."
      },
      {
        "level": 53,
        "name": "Metronome",
        "type":"Normal",
        "desc": "Usuário realiza quase qualquer movimento do jogo de forma aleatória."
      },
      {
        "level": 60,
        "name": "Moonblast",
        "type":"Fairy",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc": "Pode diminuir o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 26,
    "name": "Canisco",
    "number": "026",
    "types": [
      "Normal"
    ],
    "image": "/images/Canisco (placeholder).png",
    "entry": "Canisco costuma ser um dos pokémon mais requisitado como companhia.",
    "height_m": 0.5,
    "weight_kg": 10,
    "description": "Canisco é um Pokémon canino coberto por uma pelagem espessa, macia e extremamente agradável ao toque. Apesar de sua aparência de pelúcia, ele é naturalmente orientado para a força, o que se manifesta em seu Ataque ligeiramente superior. Ele é um filhote que busca atenção de forma mais vigorosa, latindo e convidando ao toque, mas ainda podendo ser um pouco medroso. \n Ele compartilha uma faixa (coleira) com Felifú, mas Canisco a usa como um símbolo de sua ligação com o Treinador, com um pequeno pingente em formato de osso.",
    "abilities": [{ "name": "Fuga (Run Away)", "desc": "Permite uma fuga garantida de Pokémon selvagens." }],
    "hidden_ability": { "name": "Estômago (Guts)", "desc": "Aumenta o Ataque se houver algum problema de status." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 28,
      "name": "Pibrulltus",
      "number": "028",
      "method": "Evolui no nível 16",
      "image": "/images/pyroak.svg"
    }
  ],
    "base_stats": {
      "hp": 47,
      "atk": 58,
      "def": 49,
      "spa": 43,
      "spd": 43,
      "spe": 53
    },
    "moves": [
      {
        "level": 1,
        "name": "Tackle",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 6,
        "name": "Sand Attack",
        "type":"Ground",
        "accuracy":100,
        "desc": "Diminuia a Precisão do oponente."
      },
      {
        "level": 10,
        "name": "Quick Attack",
        "type": "Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 14,
        "name": "Headbutt",
        "type":"Normal",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc":"Pode estremecer o oponente."
      }
    ]
  },
  {
    "id": 27,
    "name": "Felifú",
    "number": "027",
    "types": [
      "Normal"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Felifú costuma ser um dos pokémon mais requisitado como companhia.",
    "height_m": 0.4,
    "weight_kg": 8.8,
    "description": "Felifú é um Pokémon felino esguio, cuja característica mais marcante é sua pelagem estranhamente áspera, descrita como 'fiapo de manga'. Felifú prefere demonstrar afeto de forma reservada, esfregando-se sutilmente e observando o ambiente antes de Canisco. \n O laço de rivalidade é forte com o Canisco, mas a tática de Felifú é mais estratégica. \n Ele compartilha uma faixa (coleira) com Canisco, mas Felifú a usa como um símbolo de sua admiração para com o Treinador, com um pequeno pingente em formato do rosto de um gato.",
    "abilities": [{ "name": "Fuga (Run Away)", "desc": "Permite uma fuga garantida de Pokémon selvagens."  }],
    "hidden_ability": { "name": "Infiltrador (Infiltrator)", "desc": "Atravessa a barreira do inimigo e ataca." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 29,
      "name": "Qitoxic",
      "number": "029",
      "method": "Evolui no nível 16",
      "image": "/images/Qitoxic (placeholder).png"
    }
  ],
    "base_stats": {
      "hp": 47,
      "atk": 46,
      "def": 43,
      "spa": 59,
      "spd": 51,
      "spe": 47
    },
    "moves": [
      {
        "level": 1,
        "name": "Scratch",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Growl",
        "type":"Normal",
        "accuracy": 100,
        "desc": "Reduz o ataque do oponente."
      },
      {
        "level": 6,
        "name": "Hone Claws",
        "type":"Dark",
        "desc": "Aumenta o Ataque e Precisão do usuário."
      },
      {
        "level": 10,
        "name": "Feint Attack",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":"∞",
        "desc": "Ignora Evasão e Precisão."
      },
      {
        "level": 14,
        "name": "Bite",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      }
    ]
  },
  {
    "id": 28,
    "name": "Pibrulltus",
    "number": "028",
    "types": [
      "Fighting"
    ],
    "image": "/images/Pibrulltus (placeholder).png",
    "entry": "Por mais que possa parecer intimidador, esse pokémon é extremamente dócil com as pessoas. Principalmente com crianças.",
    "height_m": 1.2,
    "weight_kg": 50,
    "description": "Pibrulltus é a manifestação da força e da lealdade canina em transição. Ele adota uma postura bípede, com o pelo macio de Canisco começando a endurecer, preparando-o para o confronto. Sua pelagem ganhou uma coloração mais escura, tipicamente marrom e branco, remetendo a raças de luta. A faixa (coleira) de seu estágio anterior se transformou em bandagens firmes que protegem suas mãos e punhos, prontas para o combate. O pingente de osso agora aparece estilhaçado, simbolizando a quebra de sua natureza puramente Normal. \n Este Pokémon adota a postura de um boxeador, mantendo uma guarda baixa e provocadora. Ele espera que o oponente ataque primeiro, confiando em sua resistência e na força devastadora de seu Ataque para contra-atacar. Sua lealdade é inabalável, e ele se torna o guardião natural do Treinador.",
    "abilities": [{"name":"Intimidar (Intimidate)", "desc":"Reduz o atributo de Ataque do inimigo."},{"name":"Punho de Ferro (Iron Fist)", "desc":"Aumenta a potência dos golpes de soco."}],
    "hidden_ability": { "name": "Abertura do Rival - Foco", "desc": "Se o oponente errar um ataque, revida instantaneamente e aumenta o Ataque do usuário." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":2,
    "evolutions":[
      {
      "id": 30,
      "name": "Masteriffik",
      "number": "030",
      "method": "Evolui no nível 40",
      "image": "/images/pyroak.svg"
    }
    ],
    "is_final_stage":false,
    "base_stats": {
      "hp": 83,
      "atk": 114,
      "def": 68,
      "spa": 74,
      "spd": 93,
      "spe": 37
    },
    "moves": [
      {
        "level": 16,
        "name": "Drain Punch",
        "type":"Fighting",
        "category":"physical",
        "power":75,
        "accuracy":100,
        "desc":"O usuário recupera metade dos pontos de vida infligidos ao oponente."
      },
      {
        "level": 21,
        "name": "Bulk Up",
        "type":"Fighting",
        "desc": "Aumenta O Ataque e Defesa do usuário."
      },
      {
        "level": 25,
        "name": "Close Combat",
        "type": "Fighting",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Diminui a Defesa e Defesa Especial do usuário."
      },
      {
        "level": 29,
        "name": "Endure",
        "type": "Normal",
        "desc": "Sempre resta pelo menos 1 HP, mas pode falhar se usado consecutivamente."
      },
      {
        "level": 33,
        "name": "Reversal",
        "type":"Fighting",
        "category":"physical",
        "accuracy":100,
        "desc":"Quanto mais baixo o HP do usuário, maior o poder."
      }
    ]
  },
  {
    "id": 29,
    "name": "Qitoxic",
    "number": "029",
    "types": [
      "Poison"
    ],
    "image": "/images/Qitoxic (placeholder).png",
    "entry": "Por mais que não seja exatamente um pokémon ideal para se ter de companhia, fica adimirado com frequência por seu treinador, tentando demonstrar como pode.",
    "height_m": 1.1,
    "weight_kg": 37.7,
    "description": "Qitoxic é a transição para a sutileza e a trapaça. O pelo 'fiapo de manga' de Felifú se tornou mais suave e macio, mas agora exibe uma coloração sutilmente roxeada, indicando sua tipagem Venenosa. Sua faixa se transformou em um cachecol que está constantemente molhado pelo veneno liberado de suas patas, o qual está sempre pingando. O pingente de gatinho evoluiu para uma caveira de gatinho, sinalizando sua natureza sombria e peçonhenta. \n Ele adota uma postura bípede, mas sua movimentação é fluida e voltada para a evasão. Assim como seu rival, Pibrulltus, Qitoxic também adota uma postura provocadora e de tramoia, esperando que o oponente perca a guarda. Ele confia em sua Velocidade e Ataque Especial para aplicar Veneno ou truques, utilizando suas patas para liberar o veneno nos ataques de contato.",
    "abilities": [{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."},{"name":"Técnico (Technician)", "desc":"Aumenta o poder dos golpes mais fracos do Pokémon."}],
    "hidden_ability": { "name": "Abertura do Rival - Peçonha", "desc": "Se o oponente errar um ataque, aplica Veneno instantaneamente e aumenta o Ataque Especial do usuário." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions":[
      {
      "id": 31,
      "name": "Elegato",
      "number": "031",
      "method": "Evolui no nível 40",
      "image": "/images/Elegato (placeholder).png"
    }
    ],
    "base_stats": {
      "hp": 67,
      "atk": 74,
      "def": 93,
      "spa": 114,
      "spd": 68,
      "spe": 53
    },
    "moves": [
      {
        "level": 16,
        "name": "Clear Smog",
        "type":"Poison",
        "category":"special",
        "power":50,
        "desc":"Remove todas as mudanças de stats do alvo."
      },
      {
        "level": 21,
        "name": "Nasty Plot",
        "type":"Dark",
        "desc": "Aumenta drasticamente o Ataque Especial do Usuário."
      },
      {
        "level": 25,
        "name": "Sludge Bomb",
        "type":"Poison",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode envenenar o oponente."
      },
      {
        "level": 29,
        "name": "Substitute",
        "type":"Normal",
        "desc": "Usa HP para criar uma isca que recebe os golpes."
      },
      {
        "level": 33,
        "name": "Venoshock",
        "type":"Poison",
        "category":"special",
        "power":65,
        "accuracy":100,
        "desc": "Causa o dobro de dano se o alvo estiver envenenado."
      }
    ]
  },
  {
    "id": 30,
    "name": "Masteriffik",
    "number": "030",
    "types": [
      "Fighting",
      "Ground"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Grande, paciente e leal, esse pokémon não gosta de ficar na pokébola, preferindo olhar por seu treinador de forma constante e próxima.",
    "height_m": 1.9,
    "weight_kg": 110,
    "description": "Masteriffik é o ápice da disciplina e da lealdade. Seu pelo se tornou áspero e junto, como se estivesse coberto de barro e lama, simbolizando incontáveis horas de treinamento solo. Sua postura agora é a de um Mestre de Artes Marciais: calma, respeitosa, mas sempre pronto para o combate. As bandagens de suas mãos e uma nova faixa na cabeça estão igualmente sujas de terra, com o pingente de osso quebrado sujo firmemente amarrado atrás. \n Seu tipo Solo se manifesta em sua estabilidade inabalável, fazendo com que ele resista a qualquer golpe, mantendo-se firme como o chão. Ele confia na sua Defesa Especial para resistir aos golpes psíquicos do rival e responder com um golpe físico avassalador.",
    "abilities": [{"name":"Intimidar (Intimidate)", "desc":"Reduz o atributo de Ataque do inimigo."},{"name":"Punho de Ferro (Iron Fist)", "desc":"Aumenta a potência dos golpes de soco."}],
    "hidden_ability": { "name": "Abertura do Rival - Foco", "desc": "Se o oponente errar um ataque, revida instantaneamente e aumenta o Ataque do usuário." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 109,
      "atk": 134,
      "def": 97,
      "spa": 79,
      "spd": 119,
      "spe": 62
    },
    "moves": [
      {
        "level": 40,
        "name": "Earthquake",
        "type":"Ground",
        "category":"physical",
        "power":100,
        "accuracy":100,
        "desc": "O poder é dobrado se o oponente estiver enterrado por causa de Dig."
      },
      {
        "level": 41,
        "name": "Swords Dance",
        "type":"Normal",
        "desc": "Aumenta drasticamente o Ataque do Usuário."
      },
      {
        "level": 48,
        "name": "Heavy Slam",
        "type": "Steel",
        "category":"physical",
        "accuracy":100,
        "desc": "Quanto mais pesado o usuário, mas poderoso o ataque."
      },
      {
        "level": 56,
        "name": "Earthly Punishment",
        "type": "Ground",
        "category":"physical",
        "power":90,
        "accuracy":100,
        "desc": "Causa dano dobrado se o alvo estiver com stats defensivos aumentados."
      },
      {
        "level": 64,
        "name": "Poison Jab",
        "type":"Poison",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode envenenar o oponente."
      },
      {
        "level":72,
        "name": "Sucker Punch",
        "type": "Dark",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "Usuário ataca primeiro, mas só funciona se o oponente estiver preparando um ataque."
      }
    ]
  },
  {
    "id": 31,
    "name": "Elegato",
    "number": "031",
    "types": [
      "Poison",
      "Psychic"
    ],
    "image": "/images/Elegato (placeholder).png",
    "entry": "Charmoso, elegante e com um ar de superioridade, requer atenção constante. Se não a tiver, pode acabar hipnotizando as pessoas para isso, menos o treinador, este o Elegato parece ter receio de decepcionar.",
    "height_m": 1.7,
    "weight_kg": 78.3,
    "description": "Elegato é a forma final da sutiliza e manipulação. Sua pelagem é agora sedosa, macia e luxuosa, dando a aparência de que está vestindo uma roupa fina. O pelo hidrofóbico nas patas forma luvas finas sob as quais o veneno é liberado. Sua transformação Psíquica é marcada por uma joia (corrente de cabeça) que sustenta um pingente de relógio balançando na frente de seus olhos, servindo como foco para hipnose e ilusões. \n Ele se tornou o mestre das artimanhas. Sua alta Defesa permite que ele resista aos golpes físicos do Masteriffik, enquanto sua Velocidade e Ataque Especial garantem que ele utilize sua combinação de status Veneno/Psíquico.",
    "abilities": [{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."},{"name":"Técnico (Technician)", "desc":"Aumenta o poder dos golpes mais fracos do Pokémon."}],
    "hidden_ability": { "name": "Abertura do Rival - Peçonha", "desc": "Se o oponente errar um ataque, aplica Veneno instantaneamente e aumenta o Ataque Especial do usuário." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 79,
      "atk": 79,
      "def": 119,
      "spa": 134,
      "spd": 79,
      "spe": 110
    },
    "moves": [
      {
        "level": 40,
        "name": "Psychic",
        "type":"Psychic",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level": 41,
        "name": "Calm Mind",
        "type": "Psychic",
        "desc": "Aumenta o Ataque Especial e Defesa Especial do usuário."
      },
      {
        "level": 48,
        "name": "Psyshock",
        "type":"Psychic",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Inflinge dano baseado na Defesa do oponente, não Defesa Especial."
      },
      {
        "level": 29,
        "name": "Meowparalysis",
        "type":"Poison",
        "accuracy":90,
        "desc": "Escolhe um de três efeitos Status aleatórios: Envenenamento Severo, Sono ou Confusão."
      },
      {
        "level": 64,
        "name": "Focus Blast",
        "type":"Fighting",
        "category":"special",
        "power":120,
        "accuracy":70,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level":72,
        "name":"Toxic",
        "type":"Poison",
        "accuracy":90,
        "desc":"Envenena gravemente o oponente."
      }
    ]
  },
  {
    "id": 32,
    "name": "Anenemo",
    "number": "032",
    "types": [
      "Water",
      "Poison"
    ],
    "image": "/images/Anenemo (placeholder).png",
    "entry": "Um pokémon bem tranquilo a princípio, mas com uma toxina que pode causar paralisia em quem venha a se aventurar próximo demais.",
    "height_m": 0.9,
    "weight_kg": 24,
    "description": "Anenemo é um pokémon que se assemelha a uma anêmona do mar com uma aparência charmosa e enganosa. Sua base corporal é de uma cor pálida, quase branca, mas a beleza reside nas suas pontas: seus 'tentáculos' formam uma espécie de cabelo flutuante e luxuoso de um tom laranja forte e vibrante. \n É um Pokémon passivo e calmo, geralmente encontrado fixo a rochas submersas ou no recife, onde passa a maior parte do tempo 'na boa'. Contudo, Anenemo não recua quando confrontado. Sua defesa é baseada puramente na toxina liberada por contato direto com seus tentáculos, punindo predadores. \n ",
    "abilities": [{"name":"Ponto de Veneno (Poison Point)", "desc":"O contato com o Pokémon pode envenenar o atacante."},{"name":"Vazamento Líquido (Liquid Ooze)", "desc":"Causa dano aos atacantes usando qualquer movimento de drenagem."}],
    "hidden_ability": { "name": "Regenerador (Regenerator)", "desc": "Restaura um pouco de HP ao ser retirado da batalha." },
    "evolution_stage":1,
    "is_final_stage":true,
    "base_stats": {
      "hp": 99,
      "atk": 53,
      "def": 93,
      "spa": 114,
      "spd": 127,
      "spe": 8
    },
    "moves": [
      {
        "level": 1,
        "name": "Water Gun",
        "type":"Water",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Acid",
        "type": "Poison",
        "category":"special",
        "power":40,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level": 5,
        "name": "Withdraw",
        "type":"Water",
        "desc": "Aumenta a Defesa do usuário."
      },
      {
        "level": 10,
        "name": "Clear Smog",
        "type":"Poison",
        "category":"special",
        "power":50,
        "desc":"Remove todas as mudanças de stats do alvo."
      },
      {
        "level": 15,
        "name": "Venoshock",
        "type":"Poison",
        "category":"special",
        "power":65,
        "accuracy":100,
        "desc": "Causa o dobro de dano se o alvo estiver envenenado."
      },
      {
        "level":20,
        "name":"Toxic",
        "type":"Poison",
        "accuracy":90,
        "desc":"Envenena gravemente o oponente."
      },
      {
        "level":25,
        "name":"Sludge Wave",
        "type":"Poison",
        "category":"special",
        "power":95,
        "accuracy":90,
        "desc":"Pode envenenar o oponente."
      },
      {
        "level":30,
        "name": "Scald",
        "type":"Water",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode causar queimadura no oponente."
      },
      {
        "level":35,
        "name": "Recover",
        "type":"Normal",
        "desc": "Usuário recupera metade de seu HP."
      },
      {
        "level":40,
        "name": "Haze",
        "type":"Ice",
        "desc": "Redefine todas as mudanças de stats."
      },
      {
        "level":45,
        "name": "Thunder Wave",
        "type": "Electric",
        "accuracy":90,
        "desc": "Paralisa o oponente."
      },
      {
        "level":50,
        "name": "Hydro Pump",
        "type":"Water",
        "category":"special",
        "power":120,
        "accuracy":80
      },
      {
        "level":55,
        "name": "Volt Switch",
        "type":"Electric",
        "category":"special",
        "power":70,
        "accuracy":80,
        "desc":"O usuário deve trocar com outro pokémon após o ataque."
      }
    ]
  },
  {
    "id": 33,
    "name": "Aerlequish",
    "number": "033",
    "types": [
      "Water"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Carismático e brincalhão, crianças adoram brincar com o Aerlequish quando vão à praia.",
    "height_m": 0.3,
    "weight_kg": 2,
    "description": "Arlequish é um Pokémon aquático com uma aparência cômica, predominando as cores laranja e branco, que o ajudam a se camuflar entre os tentáculos de Anenemo. Sua característica visual mais marcante é o rosto branco com manchas vermelhas que imitam a maquiagem de palhaço, conferindo-lhe uma natureza divertida e carismática. \n Este Pokémon é conhecido por ser extremamente amigável e sociável, muitas vezes sendo o primeiro a iniciar contato com outros Pokémon e humanos, para aplicar truque divertidos. No entanto, Arlequish é muito arisco; se a aproximação for brusca, ele usa sua alta velocidade para fugir, reforçando a natureza evasiva. \n Em seu habitat, Arlequish é um protetor diligente: ele cumpre sua parte da simbiose usando jatos d'água e sua natação constante para limpar e evitar que os tentáculos de Anenemo se enrolem, garantindo a saúde de seu parceiro.",
    "abilities": [{"name":"Véu d'Água (Water Veil)", "desc":"Previne o pokémon de dicar queimado."}],
    "hidden_ability": { "name": "Brincalhão (Prankster)", "desc": "Dá prioridade a uma mudança de status." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions":[{
      "id": 34,
      "name": "Voabrante",
      "number": "034",
      "method": "Evolui no nível 30",
      "image": "/images/Voabrante (placeholder).png"
    }],
    "base_stats": {
      "hp": 43,
      "atk": 67,
      "def": 42,
      "spa": 40,
      "spd": 47,
      "spe": 78
    },
    "moves": [
      {
        "level": 1,
        "name": "Peck",
        "type":"Flying",
        "category":"physical",
        "power":35,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Water Gun",
        "type":"Water",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 4,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 8,
        "name": "Taunt",
        "type":"Dark",
        "desc":"O alvo só pode usar movimentos de ataque."
      },
      {
        "level": 12,
        "name": "Aqua Jet",
        "type":"Water",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level":16,
        "name":"Flail",
        "type":"Normal",
        "category":"physical",
        "accuracy":100,
        "desc":"Quanto menor o HP do usuário, maior o poder."
      },
      {
        "level":20,
        "name":"Encore",
        "type":"Normal",
        "desc":"Força o oponente a repetir seu último movimento por mais 3 turnos."
      }
    ]
  },
  {
    "id": 34,
    "name": "Voabrante",
    "number": "034",
    "types": [
      "Water",
      "Flying"
    ],
    "image": "/images/Voabrante (placeholder).png",
    "entry": "Apesar de sua evolução, Voabrante mantém sua natureza arisca e brincalhona. Ele usa sua velocidade superior tanto na água quanto no ar para pregar peças e distrair predadores.",
    "height_m": 1.1,
    "weight_kg": 18.2,
    "description": "Voabrante é a evolução do Arlequish, ganhando a tipagem Voadora e uma impressionante exibição de cores. Seu corpo mantém as listras básicas de laranja e branco, mas quando ele salta e plana sob a luz do sol, suas nadadeiras e escamas laterais cintilam com cores intensas, como azul, verde e amarelo. Sua cabeça é adornada com uma estrutura óssea ou de pele que se assemelha a uma máscara expressiva, conferindo-lhe uma aparência teatral e astuta. \n Seu método de locomoção é a planagem – ele se impulsiona para fora da água com suas poderosas nadadeiras, deslizando sobre as ondas para patrulhar o recife.",
    "abilities": [{"name":"Véu d'Água (Water Veil)", "desc":"Previne o pokémon de dicar queimado."}],
    "hidden_ability": { "name": "Brincalhão (Prankster)", "desc": "Dá prioridade a uma mudança de status." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 73,
      "atk": 111,
      "def": 77,
      "spa": 67,
      "spd": 77,
      "spe": 123
    },
    "moves": [
      {
        "level": 30,
        "name": "Brave Bird",
        "type":"Flying",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário recebe dano de recuo."
      },
      {
        "level": 34,
        "name": "Aqua Tail",
        "type": "Water",
        "category":"physical",
        "power":90,
        "accuracy":90
      },
      {
        "level": 38,
        "name": "Tailwind",
        "type":"Flying",
        "desc": "Dobra a Velocidade por 4 turnos."
      },
      {
        "level": 42,
        "name": "U-Turn",
        "type":"Bug",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc": "O usuário troca de lugar imediatamente após atacar."
      },
      {
        "level": 46,
        "name": "Quiver Dance",
        "type":"Bug",
        "desc": "Aumenta o Ataque Especial, a Defesa Especial e a Velocidade do usuário."
      },
      {
        "level":50,
        "name": "Acrobatics",
        "type":"Flying",
        "category":"physical",
        "power":55,
        "accuracy":100,
        "desc": "Mais forte quando o usuário não está segurando um item."
      },
      {
        "level":54,
        "name":"Defog",
        "type":"Flying",
        "desc":"Reduz a evasão do oponente e dissipa a névoa."
      }
    ]
  },
  {
    "id": 35,
    "name": "Marionyx",
    "number": "035",
    "types": [
      "Water"
    ],
    "image": "/images/Marionyx (placeholder).png",
    "entry": "Em praias onde o Marionyx é presente, recomenda-se tomar cuidado onde se pisa para não levar uma mordida no pé.",
    "height_m": 0.8,
    "weight_kg": 9,
    "description": "Marionyx é um pokémon com uma estrutura de crocodilo bípede. Sua coloração é perfeitamente adaptada ao seu habitat costeiro: possui um corpo em tons de amarelo-areia com a barriga branca, permitindo que se camufle com maestria nas margens da praia. Ele possui um focinho longo e mandíbulas poderosas, e sua cauda é musculosa, sendo essencial para a propulsão na água. \n É um predador solitário de emboscada. Marionyx costuma deitar-se na areia, esperando o momento oportuno, ou caçar em águas rasas, onde sua coloração o torna quase invisível. Sua dieta consiste em peixes menores, sendo um predador natural de Pokémon como Arlequish. \n Marionyx não é territorial e geralmente evita confrontos diretos, preferindo atacar de bote. No entanto, se for atrapalhado ou tiver sua presa roubada, ele se torna visivelmente estressado e reagirá com agressividade, usando sua mandíbula para dominar a situação.",
    "abilities": [{ "name": "Mandíbula Forte (Strong Jaw)", "desc": "Aumenta o poder dos golpes de mordida." }],
    "hidden_ability": { "name": "Véu de Areia (Sand Veil)", "desc": "Aumenta a evasão do Pokémon em tempestades de areia." },
    "evolution_display_type": "SEQUENTIAL",
    "evolution_stage":1,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 36,
      "name": "Suchochedo",
      "number": "036",
      "method": "Evolui no nível 18",
      "image": "/images/spriglet.svg"
    }
    ],
    "base_stats": {
      "hp": 50,
      "atk": 65,
      "def": 60,
      "spa": 35,
      "spd": 50,
      "spe": 60
    },
    "moves": [
      {
        "level": 1,
        "name": "Bite",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 1,
        "name": "Water Gun",
        "type":"Water",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 6,
        "name": "Sand Attack",
        "type":"Ground",
        "accuracy":100,
        "desc": "Diminuia a Precisão do oponente."
      },
      {
        "level": 10,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 14,
        "name": "Focus Energy",
        "type":"Normal",
        "desc": "Aumenta a chance de crítico."
      },
      {
        "level": 17,
        "name": "Crunch",
        "type":"Dark",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode diminuir a Defesa do oponente."
      }
    ]
  },
  {
    "id": 36,
    "name": "Suchochedo",
    "number": "036",
    "types": [
      "Water",
      "Rock"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Um pokémon grande. Passa a maior parte do tempo dentro d'água parado. Ainda assim, pode dar investidas muito rápidas.",
    "height_m": 1.9,
    "weight_kg": 100,
    "description": "O Pokémon adquire a tipagem Pedra, e sua pele passa do amarelo-areia para um cinza-ardósia sutil, indicando a mineralização em curso. \n A tipagem Pedra se manifesta em seu corpo pela formação de pequenas placas e incrustações rochosas nas costas e laterais, semelhantes a cracas e ostras que se fixam em rochedos costeiros. Devido ao aumento do peso, ele adota uma postura quadrúpede na terra e se torna lento fora d'água, embora mantenha uma propulsão potente e rapidez nas águas rasas. \n O Suchochedo é surpreendentemente sociável e tranquilo, permitindo que outras criaturas marinhas habitem seu entorno. Sua única agressividade está ligada à fome, momento em que abandona sua quietude para realizar botes poderosos. Ele passa longos períodos estático e submerso na areia das águas mornas, um hábito que estimula a mineralização gradual que culminará na formação do recife de corais em sua evolução final.",
    "abilities": [{ "name": "Mandíbula Forte (Strong Jaw)", "desc": "Aumenta o poder dos golpes de mordida."},{"name":"Armadura de Conchas (Shell Armor)", "desc":"O pokémon fica protegido contra ataques críticos."}],
    "hidden_ability": { "name": "Rocha Sólida (Solid Rock)", "desc": "Diminui o dano recebido de ataques super-efetivos." },
    "evolution_stage":2,
    "is_final_stage":false,
    "evolutions": [
    {
      "id": 37,
      "name": "Spinoral",
      "number": "037",
      "method": "Evolui no nível 38",
      "image": "/images/spriglet.svg"
    }
    ],
    "base_stats": {
      "hp": 78,
      "atk": 95,
      "def": 85,
      "spa": 45,
      "spd": 85,
      "spe": 37
    },
    "moves": [
      {
        "level": 18,
        "name": "Rock Tomb",
        "type":"Rock",
        "category":"physical",
        "power": 60,
        "accuracy": 95,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 23,
        "name": "Rock Polish",
        "type":"Rock",
        "desc": "Aumenta drasticamente a Velocidade do usuário."
      },
      {
        "level": 28,
        "name": "Liquidation",
        "type":"Water",
        "category":"physical",
        "power":85,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa do oponente."
      },
      {
        "level": 33,
        "name": "Ice Fang",
        "type":"Ice",
        "category":"physical",
        "power":65,
        "accuracy":95,
        "desc": "Pode estremecer e/ou congelar o oponente."
      },
      {
        "level": 35,
        "name": "Iron Defense",
        "type":"Steel",
        "desc": "Aumenta drasticamente a Defesa do Usuário."
      },
      {
        "level": 37,
        "name": "Stone Edge",
        "type":"Rock",
        "category":"physical",
        "power":100,
        "accuracy":80,
        "desc": "Alta taxa de acerto crítico."
      }
    ]
  },
  {
    "id": 37,
    "name": "Spinoral",
    "number": "037",
    "types": [
      "Water",
      "Rock"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Algumas pessoas acreditam que existe, em algum lugar, uma grande barreira de recife de corais que na verdade seria o maior Spinoral que já existiu.",
    "height_m": 2.7,
    "weight_kg": 310,
    "description": "Spinoral é a forma final e imponente da linha, um colosso de Pedra/Água. O corpo, completamente mineralizado e acinzentado, é um muro natural, cuja aparência (lisa ou coberta de cracas) varia de acordo com o tempo que o Pokémon passa em repouso. \n A característica mais notável é sua vela dorsal, um recife de corais totalmente crescido e vivo, firmemente fundido às suas espinhas. Este recife atrai e abriga um ecossistema de Pokémon menores, fornecendo energia sustentável ao Spinoral e aliviando a necessidade de caça. O Spinoral é profundamente ligado à vela; embora ela possa se regenerar, ele sente dor se o ecossistema for danificado em batalha. \n Em terra, o Spinoral é extremamente lento, com pouco interesse em deixar a água, pois prioriza a saúde do seu recife. Contudo, na água, ele se move com surpreendente agilidade usando sua cauda larga e poderosa para propulsão. \n O Spinoral é passivo, sociável e passa a maior parte do tempo vagueando ou descansando. Sua natureza defensiva é acionada apenas quando seu descanso é perturbado ou quando outros Pokémon maiores ameaçam a integridade do seu ecossistema dorsal, momento em que ele usa seu imenso peso e mandíbula para dominar a situação.",
    "abilities": [{ "name": "Mandíbula Forte (Strong Jaw)", "desc": "Aumenta o poder dos golpes de mordida."},{"name":"Armadura de Conchas (Shell Armor)", "desc":"O pokémon fica protegido contra ataques críticos."}],
    "hidden_ability": { "name": "Rocha Sólida (Solid Rock)", "desc": "Diminui o dano recebido de ataques super-efetivos." },
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 105,
      "atk": 120,
      "def": 125,
      "spa": 60,
      "spd": 105,
      "spe": 25
    },
    "moves": [
      {
        "level": 38,
        "name": "Jaw Lock",
        "type":"Dark",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc": "Impede o oponente de trocar de pokémon."
      },
      {
        "level": 45,
        "name": "Scale Shot",
        "type":"Dragon",
        "category":"physical",
        "power":25,
        "accuracy":90,
        "desc": "Ataca de 2 a 5 vezes por turno. Aumenta a Velocidade do usuário, mas diminui sua Defesa."
      },
      {
        "level": 52,
        "name": "Giga Impact",
        "type":"Normal",
        "category":"physical",
        "power":150,
        "accuracy":90,
        "desc": "O usuário deverá recarregar no próximo turno."
      },
      {
        "level": 60,
        "name": "Shore Up",
        "type":"Ground",
        "desc": "O usuário recupera até metade de seus pontos de vida máximos. A recuperação de pontos de vida é ainda maior durante uma tempestade de areia."
      },
      {
        "level": 67,
        "name": "Crabhammer",
        "type":"Water",
        "category":"physical",
        "power":100,
        "accuracy":90,
        "desc": "Alta taxa de acerto crítico."
      },
      {
        "level": 70,
        "name": "Curse",
        "type":"Ghost",
        "desc": "Fantasmas perdem 50% do HP máximo e amaldiçoam o oponente; unidades não-fantasma aumentam o Ataque e a Defesa, mas diminuem a Velocidade."
      }
    ]
  },
  {
    "id": 38,
    "name": "Escophobus",
    "number": "038",
    "types": [
      "Ghost"
    ],
    "image": "/images/Escophobus (placeholder).png",
    "entry": "Por algum motivo, este pokémon só é encontrado em uma ruína específica. Não se sabe a razão, mas se agradece esse fato.",
    "height_m": 2.2,
    "weight_kg": 45,
    "description": "Escophobus é um Pokémon conhecido por sua natureza indetectável e predadora. Sua aparência é longa, curva e esguia, com membros e apêndices longos e finos, conferindo-lhe uma silhueta que nunca parece totalmente confortável no espaço, sugerindo uma origem fora das dimensões normais. Ele possui olhos grandes localizados na parte superior da cabeça, forçando-o a inclinar o corpo e a cabeça para baixo para observar suas vítimas, uma postura que é imediatamente perturbadora e invasiva. \n Escophobus é um predador calculista. Ele reside em ruínas vazias e silenciosas, onde estuda secretamente aqueles que encontra. Graças à sua capacidade de ser completamente indetectável, ele se aproxima de sua presa sem aviso. \n Ele só se revela e ataca quando tem certeza da vitória. O ataque é sempre súbito, físico e violento, cumprindo a lenda de que ele ataca instantaneamente, sem dar chance de reação. Ele causa danos extremos e raramente é derrotado, tornando seu encontro um evento de puro terror para qualquer um que ouse pisar em seu território.",
    "abilities": [{ "name": "Bote do Perseguidor (Stalker's Ambush)", "desc": "Quando entra em campo (início da batalha, troca, ou encontro selvagem), ele interrompe o turno e ataca imediatamente, antes de qualquer outra ação.."}],
    "hidden_ability": { "name": "Infiltrador (Infiltrator)", "desc": "Atravessa a barreira do inimigo e ataca." },
    "evolution_stage":1,
    "is_final_stage":true,
    "base_stats": {
      "hp": 80,
      "atk": 130,
      "def": 70,
      "spa": 80,
      "spd": 80,
      "spe": 140
    },
    "moves": [
      {
        "level": 1,
        "name": "Sudden Dread",
        "type":"Ghost",
        "category":"physical",
        "power":150,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 1,
        "name": "Shadow Sneak",
        "type":"Ghost",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 10,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 20,
        "name": "Pursuit",
        "type":"Dark",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Dobre o poder se o oponente estiver trocando de Pokémon."
      },
      {
        "level": 30,
        "name": "Phantom Force",
        "type":"Ghost",
        "category":"physical",
        "power":90,
        "accuracy":100,
        "desc": "Desaparece no primeiro turno, ataca no segundo. Pode atacar mesmo com Proteção/Detecção."
      },
      {
        "level": 40,
        "name": "Destiny Bond",
        "type":"Ghost",
        "desc": "Se o usuário desmaiar, o oponente também desmaia."
      },
      {
        "level":50,
        "name":"Poltergeist",
        "type":"Ghost",
        "category":"physical",
        "power":110,
        "accuracy":90,
        "desc":"Falha se o alvo não possuir nenhum item."
      },
      {
        "level":60,
        "name": "High Horsepower",
        "type":"Ground",
        "category":"physical",
        "power":95,
        "accuracy":95,
        "desc":"O usuário ataca o alvo ferozmente usando todo o seu corpo."
      }
    ]
  },
  {
    "id": 39,
    "name": "Livwatr",
    "number": "039",
    "types": [
      "Water"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Mesmo com uma aparência de filhote, a maioria dos Livwatr que se é possível encontrar são pelo menos centenários.",
    "height_m": 0.3,
    "weight_kg": 1.2,
    "description": "O Livwatr possui uma estética que remete a um embrião marinho protegido por uma redoma de pureza. Seu corpo externo é uma esfera de substância gelatinosa e completamente translúcida, assemelhando-se a uma gota de água que mantém sua forma mesmo sob a pressão esmagadora das profundezas. \n No centro dessa esfera reside seu núcleo vital: uma pequena massa biológica de tons pastéis onde se pode ver claramente seu rosto. O Livwatr está quase sempre com uma expressão de sono profundo, com os olhos suavemente fechados e um sorriso sereno, transmitindo uma paz inabalável. \n Diferente de outros Pokémon, o Livwatr não teme a passagem do tempo. Quando seu corpo físico atinge um limite de cansaço ou dano, suas células se reorganizam, fazendo-o encolher e retornar ao seu estado inicial de 'pólipo' ou embrião. Ele não perde totalmente a consciência ao reiniciar o ciclo, mas suas memórias de vidas passadas tornam-se nubladas. Para um Livwatr, ter vivido mil anos é como lembrar de um longo sonho do qual ele acabou de acordar. \n É um Pokémon extremamente passivo. Ele flutua nas correntes abissais, acordando brevemente apenas para se alimentar de nutrientes microscópicos ou para interações lúdicas ocasionais. \n Embora biologicamente imortal, ele é vulnerável. Por ser pequeno e lento, muitos acabam sendo presas de Pokémon maiores ou sucumbindo a doenças raras antes de conseguirem completar o processo de rejuvenescimento.",
    "abilities": [{ "name": "Reversão Onírica (Dream Reversion)", "desc": "Quando o HP do Pokémon cai para 25% ou menos ao fim de um turno, ele entra em um estado de dormência profunda. No início do próximo turno, ele recupera 100% de HP e PP, limpa todas as alterações de atributos e condições de status, mas é forçado a dormir por 3 turnos fixos."}],
    "hidden_ability": { "name": "Comatoso (Comatose)", "desc": "O Pokémon está sempre dormindo, mas ainda pode atacar." },
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[{
      "id": 40,
      "name": "Eternalom",
      "number": "040",
      "method": "Evolui ao segurar o item Capsula de Éon ao subir de nível tendo vida crítica.",
      "image": "/images/Eternalom (placeholder).png" 
    }],
    "base_stats": {
      "hp": 90,
      "atk": 14,
      "def": 75,
      "spa": 45,
      "spd": 90,
      "spe": 10
    },
    "moves": [
      {
        "level": 1,
        "name": "Water Sport",
        "type":"Water",
        "desc": "Diminui o poder dos golpes do tipo Fogo."
      },
      {
        "level": 1,
        "name": "Water Gun",
        "type":"Water",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 5,
        "name": "Withdraw",
        "type":"Water",
        "desc": "Aumenta a Defesa do usuário."
      },
      {
        "level": 12,
        "name": "Aqua Ring",
        "type":"Water",
        "desc": "Restaura um pouco de HP a cada turno."
      },
      {
        "level": 18,
        "name": "Sleep Talk",
        "type":"Normal",
        "desc": "O usuário realiza um de seus próprios movimentos enquanto dorme."
      },
      {
        "level": 25,
        "name": "Bubble Beam",
        "type":"Water",
        "category":"special",
        "power":65,
        "accuracy":100,
        "desc": "Pode diminuir a velocidade do oponente."
      },
      {
        "level":32,
        "name":"Recover",
        "type":"Normal",
        "desc": "Usuário recupera metade de seu HP."
      },
      {
        "level":38,
        "name": "Amnesia",
        "type":"Psychic",
        "desc":"Aumenta drasticamente a Defesa Especial do Usuário."
      },
      {
        "level":45,
        "name":"Brine",
        "type":"Water",
        "category":"special",
        "power":65,
        "accuracy":100,
        "desc":"O poder dobra se o HP do oponente for inferior a 50%."
      },
      {
        "level":52,
        "name": "Haze",
        "type":"Ice",
        "desc": "Redefine todas as mudanças de stats."
      },
      {
        "level":60,
        "name": "Hydro Pump",
        "type":"Water",
        "category":"special",
        "power":120,
        "accuracy":80
      }
    ]
  },
  {
    "id": 40,
    "name": "Eternalom",
    "number": "040",
    "types": [
      "Water"
    ],
    "image": "/images/Eternalom (placeholder).png",
    "entry": "Eternalom é conhecido por encontrar mergulhadores e Pokémon perdidos em labirintos submersos, escoltando-os silenciosamente até a superfície.",
    "height_m": 3.6,
    "weight_kg": 310,
    "description": "Eternalom deixa de ser um embrião protegido para se tornar uma entidade única e imponente. Seu corpo não é mais translúcido, mas possui uma opacidade cerúlea que lembra porcelana antiga. O rosto, antes escondido no núcleo, agora é parte integrante de sua estrutura frontal, exibindo olhos grandes, sábios e permanentemente abertos. \n Sua característica mais marcante é a imensa massa de tentáculos brancos que pende de sua base. Visualmente, assemelham-se a uma longa e densa barba de ancião, que flutua majestosamente conforme ele se desloca. Pequenos sulcos e rugas ao redor de sua face dão pistas de que o tempo finalmente começou a agir sobre ele, conferindo-lhe um ar de seriedade e autoridade benevolente. \n O Eternalom é uma das criaturas mais raras e respeitadas dos oceanos. Ao contrário de sua forma anterior, ele não flutua ao sabor do destino; ele nada com propósito e consciência. Nas profundezas onde a luz do sol nunca chega, o Eternalom emite um brilho pulsante e reconfortante. \n Existe uma aura de hospitalidade ao seu redor. Relatos de antigos exploradores dizem que, ao encontrar alguém em perigo ou despreparado nas ruínas oceânicas, o Eternalom se aproxima e, de seus tentáculos, oferece itens úteis perdidos pelo mar há séculos. Diz-se que ele consegue sentir se uma pessoa é digna ou se está em extrema necessidade. \n Ao parar de reiniciar seu ciclo de vida, ele finalmente conseguiu unificar as memórias de todos os seus ciclos passados. Ele é um arquivo vivo da história dos mares, embora se comunique apenas através de um silêncio profundo e empático.",
    "abilities": [{ "name": "Presente do Sábio (Sage's Gift)", "desc": "Em batalhas (especialmente duplas), se o aliado perder ou não tiver um item, transfere o seu próprio item para ele no final do turno. Além disso, impede que os aliados sejam afetados por redução de Precisão ou Confusão."}],
    "hidden_ability": { "name": "Comatoso (Comatose)", "desc": "O Pokémon está sempre dormindo, mas ainda pode atacar." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 125,
      "atk": 40,
      "def": 105,
      "spa": 106,
      "spd": 150,
      "spe": 60
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Origin Pulse",
        "type":"Water",
        "category":"special",
        "power":110,
        "accuracy":85,
        "desc": "Atinge todos os oponentes adjacentes."
      },
      {
        "level": 1,
        "name": "Life Dew",
        "type":"Water",
        "desc":"O usuário e seus companheiros de equipe recuperam HP."
      },
      {
        "level": 1,
        "name": "Helping Hand",
        "type":"Normal",
        "desc":"Em Batalhas em Dupla, aumenta o poder do movimento do parceiro."
      },
      {
        "level": 65,
        "name": "Mirror Coat",
        "type":"Psychic",
        "category":"special",
        "accuracy":100,
        "desc": "Ao ser atingido por um Ataque Especial, o usuário contra-ataca com o dobro do poder."
      },
      {
        "level": 72,
        "name": "Hydro Steam",
        "type":"Water",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "A potência aumenta sob luz solar intensa."
      },
      {
        "level": 80,
        "name": "Calm Mind",
        "type": "Psychic",
        "desc": "Aumenta o Ataque Especial e Defesa Especial do usuário."
      },
      {
        "level": 90,
        "name": "Ocean's Wisdom",
        "type":"Water",
        "desc": "Protege a equipe de golpes críticos e cura 1/4 do HP de todos os aliados."
      }
    ]
  },
  {
    "id": 41,
    "name": "Zapecker",
    "number": "041",
    "types": [
      "Electric",
      "Flying"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Não é recomendado para treinadores novatos. O Zapecker pode ser extremamente teimoso e até atacar treinadores inexperientes.",
    "height_m": 0.5,
    "weight_kg": 2.5,
    "description": "Zapecker é um pássaro de pequeno porte, mas com uma paleta de cores urbana e elétrica. Seu corpo é predominantemente roxo vibrante, com as pontas das asas e cauda em preto sólido. O peito e o rosto exibem um branco puro, fazendo com que seus grandes olhos amarelos se destaquem como faróis ligados. \n Seu bico preto possui uma pequena rachadura no lado esquerdo, causada pelo excesso de voltagem que ele descarrega. Zapecker sofre de tiques nervosos constantes: ele pisca um olho de cada vez, move a cabeça em espasmos rápidos e se pica involuntariamente, liberando pequenas faíscas azuis. \n Ele é o mestre do sumiço. Devido à sua hiperatividade extrema, ele nunca para quieto. Se um treinador desviar o olhar por um segundo, o Zapecker já terá percorrido metros de distância apenas por puro impulso. Zapecker é conhecido como o 'perturbador das florestas temperadas'. Ele não é territorial, mas é viciado em reações. Ele adora provocar humanos e outros Pokémon dando choques leves, perseguindo-os por entre as árvores ou dando pequenos chutes nas costas dos desavisados para ver se eles revidam. \n Apesar de ser irritante, ele tenta interagir. Para o Zapecker, dar uma bicada elétrica em alguém é um sinal de confiança e um convite para brincar ou lutar. Treinadores de Zapecker costumam andar com luvas isolantes e muitos curativos.",
    "abilities": [{ "name": "Estática (Static)", "desc": "O contato com o Pokémon pode causar paralisia."}, {"name": "Espasmo (Spasm)", "desc":"Os movimentos erráticos e tiques nervosos do Pokémon dificultam que o oponente o acerte."}],
    "hidden_ability": { "name": "Brincalhão (Prankster)", "desc": "Dá prioridade a uma mudança de status." },
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[{
      "id": 42,
      "name": "Kirayzee",
      "number": "042",
      "method": "Evolui no nível 30",
      "image": "/images/spriglet.svg" 
    }],
    "base_stats": {
      "hp": 45,
      "atk": 35,
      "def": 42,
      "spa": 82,
      "spd": 45,
      "spe": 95
    },
    "moves": [
      {
        "level": 1,
        "name": "Peck",
        "type":"Flying",
        "category":"physical",
        "power":35,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Thunder Shock",
        "type": "Electric",
        "category": "special",
        "power": 40,
        "accuracy": 100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 5,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 9,
        "name": "Charge",
        "type":"Electric",
        "desc": "Aumenta a Defesa Especial do usuário e o poder do próximo movimento Elétrico."
      },
      {
        "level": 13,
        "name": "Quick Attack",
        "type": "Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level": 17,
        "name": "Shock Wave",
        "type":"Electric",
        "category":"special",
        "power":60,
        "accuracy":"∞",
        "desc": "Ignora Evasão e Precisão."
      },
      {
        "level":21,
        "name":"Thunder Wave",
        "type": "Electric",
        "accuracy":90,
        "desc": "Paralisa o oponente."
      },
      {
        "level":25,
        "name": "Taunt",
        "type":"Dark",
        "desc":"O alvo só pode usar movimentos de ataque."
      },
      {
        "level":29,
        "name":"Volt Switch",
        "type":"Electric",
        "category":"special",
        "power":70,
        "accuracy":80,
        "desc":"O usuário deve trocar com outro pokémon após o ataque."
      }
    ]
  },
  {
    "id": 42,
    "name": "Kirayzee",
    "number": "042",
    "types": [
      "Electric",
      "Flying"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Dizem que a marca vermelha em seu rosto é sensível, podendo deixar o pokémon agitado e até agressivo ao toque.",
    "height_m": 1.15,
    "weight_kg": 18.5,
    "description": "com uma plumagem densa em tons de roxo profundo e preto. Sua silhueta é marcada por uma cauda longa e uma 'capa' de penas no pescoço que se abre violentamente durante seus espasmos, revelando padrões amarelos que brilham como eletricidade pura. \n Uma fenda profunda e irregular nasce em seu bico e sobe pela lateral do rosto até atravessar o olho, funcionando como uma cicatriz de energia. Essa rachadura brilha em um vermelho incandescente sempre que o Pokémon está prestes a atacar ou quando seus instintos agressivos afloram. \n Ele é definido por seus tiques e movimentos imprevisíveis. Mesmo sendo um pássaro de porte nobre, ele sofre espasmos constantes que o fazem virar a cabeça ou eriçar as penas subitamente, o que confunde os predadores e torna seus ataques impossíveis de prever. \n Embora seja extremamente impulsivo e agressivo com estranhos, ele possui uma conexão inquebrável com seu treinador. Ele demonstra afeto de formas peculiares, como dando pequenos choques de provocação ou roubando objetos, mas protege seu dono com uma fúria cega diante de qualquer perigo. \n Habita florestas densas onde pode se camuflar entre as sombras roxas da vegetação. É um Pokémon raro de se encontrar, geralmente visto apenas por lampejos de luz vermelha e o som de estalos elétricos ecoando entre as árvores durante a noite.",
    "abilities": [{ "name": "Estática (Static)", "desc": "O contato com o Pokémon pode causar paralisia."}, {"name": "Espasmo (Spasm)", "desc":"Os movimentos erráticos e tiques nervosos do Pokémon dificultam que o oponente o acerte."}],
    "hidden_ability": { "name":"Desafiador (Defiant)", "desc":"Aumenta drasticamente o Ataque do Usuário quando os atributos são reduzidos." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 75,
      "atk": 55,
      "def": 70,
      "spa": 130,
      "spd": 75,
      "spe": 120
    },
    "moves": [
      {
        "level": "32",
        "name": "Air Slash",
        "type":"Flying",
        "category":"special",
        "power":75,
        "accuracy":95,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 36,
        "name": "Discharge",
        "type":"Electric",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 41,
        "name": "Roost",
        "type":"Flying",
        "desc":"O usuário recupera metade de seus pontos de vida máximos e perde temporariamente o tipo Voador."
      },
      {
        "level": 45,
        "name": "Electro Ball",
        "type":"Electric",
        "category":"special",
        "accuracy":"100",
        "desc":"Quando mais rápido o usuário, mais forte o golpe."
      },
      {
        "level": 50,
        "name": "Hurricane",
        "type":"Flying",
        "category":"special",
        "power":110,
        "accuracy":70,
        "desc": "Pode confundir o oponente."
      },
      {
        "level": 55,
        "name": "Thunder",
        "type": "Electric",
        "category":"special",
        "power":110,
        "accuracy":70,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level": 62,
        "name": "Chaotic Outbreak",
        "type":"Electric",
        "desc": "O usuário entra em surto, aumentando seu Ataque Especial e Velocidade, mas fica confuso."
      }
    ]
  },
  {
    "id": 43,
    "name": "Empence",
    "number": "043",
    "types": [
      "Normal",
      "Fighting"
    ],
    "image": "/images/Empence (placeholder).png",
    "entry": "Um ótimo companheiro para o dia a dia, o Empence tenta sempre se provar útil. Mas passa por muito estresse ao se cobrar demais.",
    "height_m": 1,
    "weight_kg": 15,
    "description": "Empence é um pequeno monstrinho de silhueta simples e postura ereta. Longe de ser um lutador musculoso, ele possui um corpo de formas suaves, mas firmes. Ele tem um pescoço curto e visível que dá mobilidade à sua cabeça, conferindo-lhe um ar de atenção constante a tudo o que o seu treinador comanda. \n O rosto é dominado por olhos grandes que brilham com uma vontade genuína de acertar. Não há agressividade em seu semblante, apenas uma seriedade fofa de quem está levando o treinamento muito a sério. Quando ele falha, seus olhos se estreitam e ele morde o lábio (ou faz uma expressão de esforço), focando toda a sua energia na próxima tentativa. \n Ao contrário de Pokémon que já nascem poderosos, a força do Empence é visualmente progressiva. Quando ele erra e a frustração bate, sua cor (originalmente um bege ou cinza fosco) começa a ganhar um tom mais vívido e saturado, e uma aura sutil começa a vibrar ao redor de seus membros, sinalizando que ele está se esforçando o dobro para compensar a falha. \n O Empence é o parceiro ideal para treinadores que valorizam a jornada e não apenas o resultado. Ele não é forte por natureza, mas sua lealdade o impede de desistir. Se ele perde uma luta sem cometer erros, ele entra em um estado reflexivo, tentando entender o que faltou, o que o torna um Pokémon extremamente inteligente emocionalmente.",
    "abilities": [{ "name": "Frustração Crescente (Growing Frustration)", "desc": "Sempre que o Pokémon não consegue executar um movimento devido à baixa precisão, condições de status ou efeitos de proteção do oponente, seu Ataque, Ataque Especial, Defesa, Defesa Especial e sua taxa de acertos críticos aumentam. Todos os bônus são redefinidos após o Pokémon desferir um golpe crítico."}, {"name":"Foco Interior (Inner Focus)", "desc":"O pokémon fica protegido de estremecer."}],
    "hidden_ability": { "name":"Obrigação (Duty Bound)", "desc":"Sempre que o Pokémon acerta um movimento que possui precisão inferior a 100%, ele recupera um pouco de seu HP e cura suas condições de status não voláteis." },
    "evolution_stage":1,
    "is_final_stage":true,
    "base_stats": {
      "hp": 92,
      "atk": 67,
      "def": 56,
      "spa": 43,
      "spd": 61,
      "spe": 96
    },
    "moves": [
      {
        "level": "1",
        "name": "Pound",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level": 1,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 5,
        "name": "Focus Energy",
        "type":"Normal",
        "desc": "Aumenta a chance de crítico."
      },
      {
        "level": 9,
        "name": "Low Kick",
        "type":"Fighting",
        "category":"physical",
        "accuracy":"100",
        "desc":"Quanto mais pesado o oponente, mais forte o ataque."
      },
      {
        "level": 12,
        "name": "Slam",
        "type":"Normal",
        "category":"physical",
        "power":80,
        "accuracy":75
      },
      {
        "level": 17,
        "name": "Low Sweep",
        "type": "Fighting",
        "category":"physical",
        "power":65,
        "accuracy":100,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 22,
        "name": "Circle Throw",
        "type":"Fighting",
        "category":"physical",
        "power":60,
        "accuracy":90,
        "desc": "Em batalhas, o oponente troca de Pokémon. Na natureza, o Pokémon foge."
      },
      {
        "level":28,
        "name":"Focus Punch",
        "type":"Fighting",
        "category":"physical",
        "power":150,
        "accuracy":100,
        "desc":"Se o usuário for atingido antes de atacar, ele recua em vez de atacar."
      },
      {
        "level":34,
        "name": "Body Slam",
        "type":"Normal",
        "category":"physical",
        "power":85,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level":40,
        "name": "Sky Drop",
        "type":"Flying",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc":"No primeiro turno, lança o oponente para o ar e, no segundo, o solta."
      },
      {
        "level":45,
        "name":"Dynamic Punch",
        "type":"Fighting",
        "category":"physical",
        "power":100,
        "accuracy":50,
        "desc": "Confunde o Oponente."
      },
      {
        "level":52,
        "name":"Heavy Slam",
        "type": "Steel",
        "category":"physical",
        "accuracy":100,
        "desc": "Quanto mais pesado o usuário, mas poderoso o ataque."
      },
      {
        "level":60,
        "name": "Last Resort",
        "type":"Normal",
        "category":"physical",
        "power":140,
        "accuracy":100,
        "desc": "Pode apenas ser usado depois que todos os outros movimentos tenham sido usados."
      }
    ]
  },
  {
    "id": 44,
    "name": "Recrulpa",
    "number": "044",
    "types": [
      "Grass"
    ],
    "image": "/images/spriglet.svg",
    "entry": "É comum encontrá-los em jardins públicos sendo repreendidos por suas evoluções. Quando tropeçam e caem, costumam ficar rolando de um lado para o outro até que alguém os coloque de pé novamente.",
    "height_m": 0.3,
    "weight_kg": 5.2,
    "description": "Recrulpa possui um corpo esférico e macio de coloração verde-claro, sustentado por pés curtos e arredondados que dificultam corridas em alta velocidade. No topo de sua cabeça, cresce uma roseta de folhas rígidas e curtas dispostas em formato de 'ninho'. Essas folhas ainda não possuem o fio de corte metálico, apresentando bordas amareladas e uma textura que lembra o couro. \n Este Pokémon vive em um estado de constante distração e brincadeira. Por serem a fase infantil de uma linha altamente disciplinada, os Recrulpa são frequentemente vistos em 'grupos de treinamento' liderados por suas evoluções. No entanto, enquanto os tutores tentam ensinar táticas de defesa, os Recrulpa geralmente se dispersam para observar insetos ou brincar de rolar em declives. \n Por ser incapaz de lutar seriamente, sua principal defesa é o ato de se encolher. Ao recolher os pés, ele aponta suas folhas superiores para o agressor. Embora frágeis, essas folhas possuem pontas agudas que podem causar pequenos arranhões. Curiosamente, os padrões de listras escuras vistos em suas formas evoluídas originam-se aqui: são cicatrizes de dobras e feridas sofridas durante essa fase brincalhona, que se tornam marcas permanentes e endurecidas após a evolução. \n Sua biologia é naturalmente resistente a energias instáveis. Recrulpa parece ignorar completamente as propriedades do terreno onde pisa, tratando solos complexos como se fossem grama comum.",
    "abilities": [{ "name": "Solo Sagrado (Hallowed Ground)", "desc": "O Pokémon purifica o solo onde pisa. Isso anula os efeitos de Terrenos para todos no campo e o torna imune a armadilhas de entrada, como Spikes."}, {"name":"Alheio (Oblivious)","desc":"O Pokémon é tão distraído que não pode ser provocado ou atraído, além de ser imune a intimidações."}],
    "hidden_ability": { "name": "Filtro de Ar (Air Filter)", "desc": "Ao entrar em batalha, o Pokémon processa as impurezas da atmosfera. Isso reduz a duração de Climas ativos e remove névoas e barreiras do campo adversário."},
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[
      {
      "id": 45,
      "name": "Cadetalo",
      "number": "045",
      "method": "Evolui no nível 18.",
      "image": "/images/spriglet.svg" 
      }
    ],
    "base_stats": {
      "hp": 55,
      "atk": 20,
      "def": 45,
      "spa": 25,
      "spd": 45,
      "spe": 32
    },
    "moves": [
      {
        "level": 1,
        "name": "Splash",
        "type":"Normal",
        "desc": "Faz NADA."
      },
      {
        "level": 1,
        "name": "Play Nice",
        "type":"Normal",
        "desc":"Diminui o Ataque do oponente. Sempre acerta."
      },
      {
        "level": 4,
        "name": "Withdraw",
        "type":"Water",
        "desc": "Aumenta a Defesa do usuário."
      },
      {
        "level": 8,
        "name": "Leafage",
        "type":"Grass",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Acerta o oponente com folhas."
      },
      {
        "level": 12,
        "name": "Aromatherapy",
        "type": "Grass",
        "desc": "Cura todos os problemas de status do seu grupo."
      },
      {
        "level": 15,
        "name": "Helping Hand",
        "type":"Normal",
        "desc":"Em Batalhas em Dupla, aumenta o poder do movimento do parceiro."
      }
    ]
  },
  {
    "id": 45,
    "name": "Cadetalo",
    "number": "045",
    "types": [
      "Grass"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Quando um Recrulpa se perde do grupo, Cadetalo entra em pânico e agita sua folha freneticamente para sinalizar o caminho de volta. Se o pequeno não obedece, ele costuma sentar no chão e suspirar profundamente de frustração.",
    "height_m": 0.7,
    "weight_kg": 28.6,
    "description": "O Cadetalo mantém o formato de corpo arredondado e liso de sua pré-evolução, mas em uma escala maior e em um tom de verde mais escuro e maduro. As diversas folhas que formavam o 'ninho' em sua cabeça foram reduzidas drasticamente deixando apenas o necessário para sua nova função. A característica mais marcante é o desenvolvimento de pequenas mãos arredondadas, que ele utiliza para empunhar sua própria folha mais longa e rígida como se fosse uma espada de treino. Suas marcas tigradas agora são mais nítidas, representando o histórico de seus esforços e exercícios. \n Cadetalo vive a fase da 'adolescência disciplinada'. Ele possui um forte desejo de ser visto como digno, honrado e eficiente, espelhando-se em seus superiores. No entanto, essa seriedade é frequentemente testada pela sua responsabilidade de cuidar dos Recrulpas. Cadetalo leva sua missão de proteção muito a sério, agindo como um guardião para Pokémon mais fracos e tentando afastar baderneiros. Apesar do esforço, ele ainda é jovem; o estresse de tentar ser um líder perfeito muitas vezes o deixa frustrado, especialmente quando sua autoridade é ignorada pelos menores. \n Em combate, ele utiliza sua folha única como um sabre vegetal. Embora a folha ainda seja feita de fibras orgânicas, ela é surpreendentemente resistente e flexível, permitindo que o Cadetalo apare golpes e desferir cortes precisos. Quando confrontado por oponentes muito maiores, sua fachada de 'soldado destemido' pode fraquejar, revelando que ele ainda está em processo de construção de sua coragem. \n Assim como sua forma anterior, Cadetalo possui uma conexão intrínseca com a pureza do solo. Ele utiliza sua presença para estabilizar energias de terreno, batendo sua espada no chão para reforçar sua posição.",
    "abilities": [{ "name": "Solo Sagrado (Hallowed Ground)", "desc": "O Pokémon purifica o solo onde pisa. Isso anula os efeitos de Terrenos para todos no campo e o torna imune a armadilhas de entrada, como Spikes."}, {"name":"Guarda Amiga (Friend Guard)", "desc":"Reduz o dano causado a aliados."}],
    "hidden_ability": { "name": "Filtro de Ar (Air Filter)", "desc": "Ao entrar em batalha, o Pokémon processa as impurezas da atmosfera. Isso reduz a duração de Climas ativos e remove névoas e barreiras do campo adversário."},
    "evolution_stage":2,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[
      {
        "id": 46,
        "name": "Sanjonore",
        "number": "046",
        "method": "Evolui no nível 38.",
        "image": "/images/spriglet.svg" 
      }
    ],
    "base_stats": {
      "hp": 90,
      "atk": 85,
      "def": 85,
      "spa": 42,
      "spd": 80,
      "spe": 35
    },
    "moves": [
      {
        "level": 18,
        "name": "Razor Leaf",
        "type": "Grass",
        "category": "physical",
        "power": 55,
        "accuracy": 95,
        "desc": "Alta taxa de acerto crítico."
      },
      {
        "level": 20,
        "name": "Focus Energy",
        "type":"Normal",
        "desc": "Aumenta a chance de crítico."
      },
      {
        "level": 23,
        "name": "Leaf Tornado",
        "type":"Grass",
        "category":"special",
        "power":65,
        "accuracy":90,
        "desc": "Pode diminuir a Precisão do oponente."
      },
      {
        "level": 27,
        "name": "Leaf Blade",
        "type":"Grass",
        "category":"physical",
        "power":90,
        "accuracy":100,
        "desc": "Alta taxa de acerto crítico."
      },
      {
        "level": 31,
        "name": "Wide Guard",
        "type": "Rock",
        "desc": "Protege a equipe do usuário contra ataques com múltiplos alvos."
      },
      {
        "level": 34,
        "name": "Body Slam",
        "type":"Normal",
        "category":"physical",
        "power":85,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      }
    ]
  },
  {
    "id": 46,
    "name": "Sanjonore",
    "number": "046",
    "types": [
      "Grass",
      "Steel"
    ],
    "image": "/images/spriglet.svg",
    "entry": "Dono de uma paciência estoica, Sanjonore ignora o caos causado pelos Recrulpas ao seu redor, focando apenas em neutralizar ameaças reais. Sua 'pena' no topo do capacete vibra quando ele detecta injustiças por perto.",
    "height_m": 1.2,
    "weight_kg": 95,
    "description": "Sanjonore possui um corpo esférico totalmente blindado por folhas de aço verde-escuro, com cicatrizes de forja que contam a história de inúmeros treinos. No topo de sua armadura, uma única folha pequena e fina balança como a pluma de um elmo real. Em uma das mãos redondas, ele empunha uma espada-de-são-jorge perfeitamente rígida; na outra, uma folha da variante, larga e indestrutível, que serve como seu escudo oficial. \n Ele é a personificação da honra. Como um mentor para os Cadetalos, ele ensina através do exemplo, mantendo a calma enquanto seus aprendizes perdem a paciência com os novatos. Sanjonore é conhecido por ficar parado por horas, observando o horizonte; muitos pensam que ele está meditando, mas ele está apenas aproveitando o silêncio que os Recrulpas raramente permitem. \n Seu foco não é a agressão, mas a neutralização. Ele utiliza seu escudo para absorver impactos e sua espada para desarmar oponentes. Ele acredita que a verdadeira vitória é terminar uma batalha sem que nenhum lado sofra danos desnecessários.",
    "abilities": [{ "name": "Solo Sagrado (Hallowed Ground)", "desc": "O Pokémon purifica o solo onde pisa. Isso anula os efeitos de Terrenos para todos no campo e o torna imune a armadilhas de entrada, como Spikes."}, {"name":"Filtro (Filter)", "desc":"Reduz o dano de ataques super-efetivos recebidos."}],
    "hidden_ability": { "name": "Alma de Guerreiro (Warrior's Soul)", "desc": "Aumenta o Ataque do Pokémon sempre que ele é atingido por um movimento do tipo Sombrio."},
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats": {
      "hp": 90,
      "atk": 115,
      "def": 105,
      "spa": 74,
      "spd": 95,
      "spe": 35
    },
    "moves": [
      {
        "level": 38,
        "name": "Smart Strike",
        "type":"Steel",
        "category":"physical",
        "power":70,
        "desc": "O usuário perfura o oponente. Esse ataque nunca erra."
      },
      {
        "level": 40,
        "name":"Defog",
        "type":"Flying",
        "desc":"Reduz a evasão do oponente e dissipa a névoa."
      },
      {
        "level": 42,
        "name": "Solar Blade",
        "type":"Grass",
        "category":"physical",
        "power":125,
        "accuracy":100,
        "desc": "Investe no primeiro turno, ataca no segundo."
      },
      {
        "level": 48,
        "name": "Iron Head",
        "type":"Steel",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode estremecer o oponente."
      },
      {
        "level": 55,
        "name": "Sainted Strike",
        "type": "Steel",
        "category":"physical",
        "power":85,
        "accuracy":100,
        "desc": "O usuário desfere um corte purificador que força a neutralidade no ambiente. Este movimento remove todos os efeitos de clima e todos os terrenos ativos no campo. Causa o dobro de dano em oponentes do tipo Dragão."
      },
      {
        "level": 62,
        "name": "Haze",
        "type":"Ice",
        "desc": "Redefine todas as mudanças de stats."
      }
    ]
  },
  {
    "id": 47,
    "name": "Ardil",
    "number": "047",
    "types": [
      "Bug"
    ],
    "image": "/images/pyroak.svg",
    "entry": "A mancha em seu abdome induz um forte sentimento de proteção em outros Pokémon. Observa-se frequentemente que predadores naturais, interrompem ataques ao avistarem a face assustada de Ardil, permitindo que o inseto escape ou até mesmo roube o alimento do agressor.",
    "height_m": 0.4,
    "weight_kg": 1.2,
    "description": "O Ardil é um Pokémon de tipo Inseto, comumente encontrado em áreas urbanas, como sótãos de casas, vigas de mercados e jardins tranquilos. Sua coloração é composta por tons pálidos de bege e cinza-poeira, o que o torna quase invisível em cantos de construções. A característica mais marcante de sua fisiologia são suas pernas desproporcionalmente longas e finas, que tremem em um ritmo irregular. Esse tremor não é apenas um sinal de fragilidade, mas uma resposta física constante ao equilíbrio precário que ele mantém sobre suas próprias teias elásticas. \n Seu abdome arredondado ostenta marcas naturais estáticas que formam uma face expressiva de terror, com olhos arregalados e uma boca em choque. O Ardil utiliza essa 'carinha assustada' como sua principal defesa: ao ser confrontado por um predador, como o Canisco, ele vira seu abdome para o agressor, induzindo um sentimento de hesitação ou piedade que interrompe o ataque. \n Diferente de outros insetos, o Ardil é um artesão meticuloso. Ele gasta horas produzindo seda em seu abdome para então, com o auxílio de suas patas que funcionam como pinças de precisão, tecer nós complexos que alternam entre propriedades elásticas e pegajosas. Ele utiliza esse 'campo minado' de fios para pescar frutas e itens de transeuntes distraídos, guardando tudo em sua bolseda — uma bolsa de seda resistente que ele carrega consigo. \n Embora seja um 'ladrão' oportunista, o Ardil não possui maldade; ele busca apenas a subsistência com o menor gasto de energia possível. Sua personalidade é cautelosa e observadora, preferindo a vitória estratégica através do cansaço do oponente do que o confronto direto, o qual ele evita a todo custo devido à sua constituição física frágil.",
    "abilities": [{ "name": "Piedade (Mercy Veil)", "desc": "A aparência frágil do Pokémon faz o oponente hesitar. Pode fazer com que ataques dirigidos a este Pokémon falhem no primeiro turno em que entra na batalha."}],
    "hidden_ability": { "name": "Engenharia de Nós (Knot Mastery)", "desc": "O Pokémon domina a técnica de tecer nós. Garante prioridade a movimentos que reduzem status e permite roubar o item do oponente ao usar tais golpes." },
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[{
      "id": 48,
      "name": "Ardinós",
      "number": "048",
      "method": "Evolui a partir do nível 22 segurando o item Loot Sack.",
      "image": "/images/spriglet.svg" 
    }],
    "base_stats": {
      "hp": 52,
      "atk": 23,
      "def": 58,
      "spa": 67,
      "spd": 66,
      "spe": 48
    },
    "moves": [
      {
        "level": 1,
        "name": "String Shot",
        "type":"Bug",
        "accuracy":95,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 1,
        "name": "Astonish",
        "type": "Ghost",
        "category": "physical",
        "power": 30,
        "accuracy": 100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 5,
        "name": "Fairy Wind",
        "type":"Fairy",
        "category":"special",
        "power":40,
        "accuracy":100
      },
      {
        "level": 9,
        "name": "Knot Trap",
        "type":"Bug",
        "desc": "Se o oponente for mais rápido, sua Velocidade cai. Se for mais lento, não pode ser substituído."
      },
      {
        "level": 13,
        "name": "Struggle Bug",
        "type": "Bug",
        "category":"special",
        "power":50,
        "accuracy":100,
        "desc": "Diminui o Ataque Especial do oponente."
      },
      {
        "level": 17,
        "name": "Thief",
        "type":"Dark",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Rouba o item que o oponente estiver segurando."
      },
      {
        "level":21,
        "name":"Spider Web",
        "type": "Bug",
        "desc": "Oponente não pode trocar de pokémon."
      },
      {
        "level":25,
        "name": "Electroweb",
        "type":"Electric",
        "category":"special",
        "power":55,
        "accuracy":95,
        "desc":"Diminui a Velocidade do oponente."
      },
      {
        "level":30,
        "name":"Bounce",
        "type":"Flying",
        "category":"physical",
        "power":85,
        "accuracy":85,
        "desc":"Pula no primeiro turno e ataca no segundo. Pode paralisar o oponente."
      },
      {
        "level":35,
        "name":"Sticky Web",
        "type":"Bug",
        "desc":"Reduz a Velocidade do oponente ao entrar em batalha."
      }
    ]
  },
  {
    "id": 48,
    "name": "Ardinós",
    "number": "048",
    "types": [
      "Bug"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Ardinós é o companheiro definitivo dos grandes estilistas da região. Enquanto o treinador desenha, o Pokémon e sua equipe tecem tecidos de seda elástica que nenhuma máquina humana consegue replicar. É dito que as roupas mais caras e resistentes do mundo foram costuradas dentro de um Ateliê Ardil, embora o Pokémon exija uma porcentagem generosa de frutas frescas como pagamento pelo serviço.",
    "height_m": 2.45,
    "weight_kg": 18.5,
    "description": "O Ardinós é um Pokémon de tipo Inseto, imponente e robusto de movimentos calculados. Diferente de sua pré-evolução, ele abandonou o tremor defensivo e adquiriu uma postura firme e estável. Sua característica mais impressionante é o abdome, que parece ter o dobro do tamanho normal. Isso ocorre porque a parte superior é coberta por uma estrutura complexa de seda endurecida — o Ateliê Ardil. \n Neste ateliê, uma pequena colônia de Ardils trabalha incansavelmente. Enquanto o Ardinós se move ou luta, os pequenos ajudantes processam seda em alta velocidade, entregando fios prontos e 'munição' tática para as patas dianteiras do líder. Essa cooperação permite que o Ardinós execute manobras impossíveis para uma aranha solitária, como o 'Arremesso de Ladino', onde ele dispara um Ardil preso a um cabo de seda para roubar um item e recolhê-lo em segundos. \n Sua inteligência é voltada para a antecipação. O Ardinós raramente entra em um local sem que seus ajudantes já tenham começado a preparar armadilhas de contato nos arredores. Na natureza, ele é o centro de uma rede logística que provê segurança e alimento para todos os membros do ateliê.",
    "abilities": [{ "name": "Armadilha de Contato (Snare Set)", "desc": "Oponentes que atingem este Pokémon com movimentos de contato são laçados, tendo sua Velocidade reduzida e sendo impedidos de fugir."}],
    "hidden_ability": { "name":"Linha de Montagem (Assembly Line)", "desc":"Ao usar movimentos de status ou de assinatura, espalha automaticamente uma camada de teia pegajosa no campo adversário." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 92,
      "atk": 74,
      "def": 96,
      "spa": 83,
      "spd": 87,
      "spe": 52
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Knot Trap",
        "type":"Bug",
        "desc": "Se o oponente for mais rápido, sua Velocidade cai. Se for mais lento, não pode ser substituído."
      },
      {
        "level": "(Evo)",
        "name": "Rogue Toss",
        "type":"Bug",
        "category":"physical",
        "power":62,
        "accuracy":100,
        "desc": "Rouba o item que o oponente estiver segurando. Se já estiver segurando um item, aumenta o poder do ataque."
      },
      {
        "level": "(Evo)",
        "name": "Rototiller",
        "type":"Ground",
        "desc":"Aumenta o Ataque e o Ataque Especial de Pokémon do tipo Grama."
      },
      {
        "level": 23,
        "name": "Pounce",
        "type":"Bug",
        "category":"physical",
        "power":50,
        "accuracy":100,
        "desc":"Diminui a Velocidade do oponente."
      },
      {
        "level": 26,
        "name": "Helping Hand",
        "type":"Normal",
        "desc":"Em Batalhas em Dupla, aumenta o poder do movimento do parceiro."
      },
      {
        "level": 31,
        "name": "Bug Buzz",
        "type": "Bug",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level": 37,
        "name": "Wide Guard",
        "type": "Rock",
        "desc": "Protege a equipe do usuário contra ataques com múltiplos alvos."
      },
      {
        "level": 44,
        "name": "Cotton Spore",
        "type": "Grass",
        "desc": "Reduz drasticamente a Velocidade do oponente."
      },
      {
        "level": 52,
        "name": "Skitter Smack",
        "type": "Bug",
        "category":"physical",
        "power":70,
        "accuracy":90,
        "desc": "Diminui o Ataque Especial do oponente."
      }
    ]
  },
  {
    "id": 49,
    "name": "Bhrathum",
    "number": "049",
    "types": [
      "Dragon"
    ],
    "image": "/images/pyroak.svg",
    "entry": "A vida de um Bhrathum é definida por uma caminhada contínua. Ao atingir a maturidade, ele sente um chamado instintivo para buscar um local de repouso final, ignorando qualquer barreira física em seu caminho. Raramente peregrinam sozinhos; é comum ver Pokémon de outras espécies escoltando-os em sinal de gratidão e respeito.",
    "height_m": 1.6,
    "weight_kg": 280,
    "description": "O Bhrathum é um pokémon de grande porte e postura baixa, com um corpo robusto que evoca a imagem de um monumento antigo. Sua pele tem uma textura que lembra argila seca, apresentando rachaduras e fissuras profundas que se tornam mais evidentes conforme ele envelhece. Suas cores variam entre o cinza-azulado pálido e o lavanda acinzentado, conferindo-lhe uma aparência melancólica e atemporal. \n Embora possua olhos funcionais, seu olhar parece sempre fixo no horizonte, focado em seu destino. Ele emite um som grave e retumbante, áspero como o atrito de pedras, porém custoso e raramente utilizado. \n Sua principal característica biológica é a descamação: ele solta lascas de pele seca durante sua jornada, que são coletadas por humanos como amuletos de sabedoria e experiência. \n Apesar de sua natureza indiferente e silenciosa, o Bhrathum possui uma vontade inabalável. Ele não ataca deliberadamente, mas usará seu peso colossal para mover qualquer obstáculo que impeça sua progressão. Treinadores que decidem acompanhar um Bhrathum devem estar preparados para uma jornada de paciência, aprendendo a respeitar o ritmo lento e o propósito solene deste Pokémon, que valoriza a companhia silenciosa acima de qualquer comando.",
    "abilities": [{ "name": "Vontade Inabalável (Unstopable Will)", "desc": "A determinação do Pokémon o torna impossível de ser movido. Ele não recua e não pode ser forçado a sair da batalha por movimentos de outros Pokémon."},{"name":"Pele Craquelada (Cracked Shell)","desc":"Quando o Pokémon é atingido por um movimento físico, sua armadura se quebra. Isso reduz sua Defesa, mas aumenta drasticamente sua Velocidade."}],
    "hidden_ability": { "name": "Presença Ancestral (Elder Presence)", "desc": "A aura solene do Pokémon intimida o oponente, mitigando a força de ataques diretos e dificultando a aplicação de efeitos secundários."},
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"BRANCHING",
    "evolutions":[
      {
        "id": 50,
        "name": "Bhrathumba",
        "number": "050",
        "method": "Evolui no nível 50 com felicidade baixa.",
        "image": "/images/spriglet.svg" 
      },
      {
        "id": 51,
        "name": "Bhrathundra",
        "number": "051",
        "method": "Evolui no nível 50 com felicidade alta.",
        "image": "/images/spriglet.svg" 
      }
    ],
    "base_stats": {
      "hp": 70,
      "atk": 52,
      "def": 85,
      "spa": 30,
      "spd": 54,
      "spe": 15
    },
    "moves": [
      {
        "level": 1,
        "name": "Tackle",
        "type": "Normal",
        "category": "physical",
        "power": 40,
        "accuracy": 100
      },
      {
        "level": 1,
        "name": "Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level": 6,
        "name": "Mud-Slap",
        "type":"Ground",
        "category":"special",
        "power":20,
        "accuracy":100,
        "desc":"Diminui a Precisão do oponente."
      },
      {
        "level": 12,
        "name": "Ancient Power",
        "type":"Rock",
        "category":"special",
        "power":60,
        "accuracy":100,
        "desc": "Pode aumentar todos os stats do usuário de uma vez."
      },
      {
        "level": 18,
        "name": "Bulldoze",
        "type": "Ground",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc": "Diminui a Velocidade do oponente."
      },
      {
        "level": 24,
        "name": "Dragon Breath",
        "type":"Dragon",
        "category":"special",
        "power":60,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level":30,
        "name": "Stomping Tantrum",
        "type":"Ground",
        "category":"physical",
        "power":75,
        "accuracy":100,
        "desc":"Movido pela frustração, o usuário ataca o alvo. Se o movimento anterior do usuário falhou, o poder deste movimento dobra."
      },
      {
        "level":36,
        "name": "Breaking Swipe",
        "type":"Dragon",
        "category":"physical",
        "power":60,
        "accuracy":100,
        "desc":"Atinge vários oponentes e reduz o Ataque deles."
      },
      {
        "level":42,
        "name": "Iron Defense",
        "type":"Steel",
        "desc": "Aumenta drasticamente a Defesa do Usuário."
      },
      {
        "level":48,
        "name":"Curse",
        "type":"Ghost",
        "desc": "Fantasmas perdem 50% do HP máximo e amaldiçoam o oponente; unidades não-fantasma aumentam o Ataque e a Defesa, mas diminuem a Velocidade."
      },
      {
        "level":54,
        "name":"Dragon Tail",
        "type":"Dragon",
        "category":"physical",
        "power":60,
        "accuracy":90,
        "desc": "Em batalhas, o oponente troca de Pokémon. Na natureza, o Pokémon foge."
      }
    ]
  },
  {
    "id": 50,
    "name": "Bhrathumba",
    "number": "050",
    "types": [
      "Dragon",
      "Ghost"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Muitas vezes confundido com uma ossada antiga em vales rochosos, Bhrathumba permanece estático por décadas, sem propósito ou direção. Ele e qualquer outro osso são basicamente a mesma coisa até que algo o desperte, revelando o rancor de uma peregrinação que falhou.",
    "height_m": 2.4,
    "weight_kg": 65,
    "description": "O Bhrathumba é um pokémon esquelético que surge quando o Bhrathum não consegue atingir seu objetivo final. Ao contrário de sua forma anterior, ele abandonou completamente a pesada casca de argila e a carne exausta, restando apenas uma estrutura óssea mantida coesa por uma aura fantasmagórica purpúra. Suas patas dianteiras se transformaram em asas imensas e ósseas, permitindo-lhe pairar de forma instável e silenciosa. \n Este Pokémon é a representação pura do rancor e do sentimento de 'incompleto'. Como evoluiu sem o apoio de companheiros ou a satisfação do dever cumprido, ele não possui mais um motivo para peregrinar ou agir por conta própria. Sua presença é frequentemente associada a lendas urbanas de vales rochosos, onde ele se camufla perfeitamente entre restos mortais comuns por não emitir aura enquanto está 'adormecido'. \n No convívio com o treinador, o Bhrathumba é definido como um Pokémon 'perdido'. Ele obedece aos comandos de forma mecânica e desprovida de entusiasmo, não por lealdade profunda, mas por ter perdido seu norte interno. O treinador deve estar preparado para lidar com uma criatura fria e silenciosa, que parece habitar um vazio existencial permanente, agindo apenas porque foi instruída a fazê-lo.",
    "abilities": [{ "name": "Ainda Não... (Not Yet...)", "desc": "O Pokémon se recusa a aceitar o fim ou a abandonar sua posição. Ele pode ignorar ordens de retirada ou persistir na batalha mesmo após sofrer danos graves."},{"name":"Corpo Amaldiçoado (Cursed Body)","desc":"Pode desativar um movimento usado no Pokémon."}],
    "hidden_ability": { "name": "Infiltrador (Infiltrator)", "desc": "Atravessa a barreira do inimigo e ataca." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 62,
      "atk": 114,
      "def": 43,
      "spa": 107,
      "spd": 101,
      "spe": 108
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Phantom Force",
        "type":"Ghost",
        "category":"physical",
        "power":90,
        "accuracy":100,
        "desc": "Desaparece no primeiro turno, ataca no segundo. Pode atacar mesmo com Proteção/Detecção."
      },
      {
        "level": 52,
        "name": "Air Slash",
        "type":"Flying",
        "category":"special",
        "power":75,
        "accuracy":95,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level": 55,
        "name": "Shadow Ball",
        "type":"Ghost",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc":"Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level": 59,
        "name": "Dragon Pulse",
        "type":"Dragon",
        "category":"special",
        "power":85,
        "accuracy":100
      },
      {
        "level": 64,
        "name": "Destiny Bond",
        "type":"Ghost",
        "desc": "Se o usuário desmaiar, o oponente também desmaia."
      },
      {
        "level": 70,
        "name": "Dragon Claw",
        "type": "Dragon",
        "category":"physical",
        "power":80,
        "accuracy":100
      },
      {
        "level": 78,
        "name": "Memento",
        "type": "Dark",
        "desc": "Usuário desmaia. Diminui drasticamente o Ataque e Ataque Especial do oponente."
      },
      {
        "level": 85,
        "name": "Outrage",
        "type":"Dragon",
        "category":"physical",
        "power":120,
        "accuracy":100,
        "desc": "Usuário ataca 2-3 turnos mas então fica confuso."
      }
    ]
  },
  {
    "id": 51,
    "name": "Bhrathundra",
    "number": "051",
    "types": [
      "Dragon",
      "Ice"
    ],
    "image": "/images/pyroak.svg",
    "entry": "Dizem que, se você avistar um Bhrathundra longe das montanhas, é um sinal para buscar velhos amigos e resolver conflitos antigos, pois ele mesmo viaja longas distâncias apenas para visitar aqueles que o ajudaram no passado.",
    "height_m": 3.5,
    "weight_kg": 412.7,
    "description": "O Bhrathundra é um pokémon majestoso adaptado para os climas mais extremos do mundo. Seu corpo é uma combinação única de texturas: enquanto sua pele inferior é fria e lisa como o gelo mais puro — capaz de congelar superfícies ao toque —, toda a sua parte superior é coberta por uma pelagem branca e densa que lembra a neve fresca. Esse 'casaco' natural é extremamente macio e retém um calor surpreendente, servindo de refúgio para pequenos Pokémon e treinadores durante nevascas. \n Diferente de suas formas anteriores, o Bhrathundra possui um canto potente e melódico. Esse grito de vitória não serve para intimidar, mas para inspirar; ouvi-lo em meio a uma batalha ou tempestade devolve a força de vontade àqueles que estão prestes a desistir. Sua perseverança é lendária. \n No convívio com seu treinador, ele se mostra um parceiro de lealdade inabalável. Ele frequentemente se recusa a abandonar o campo de batalha, não por teimosia cega, mas por um profundo senso de dever e proteção, mantendo-se como um escudo vivo até que a situação esteja segura.",
    "abilities": [{ "name": "Ainda Não... (Not Yet...)", "desc": "O Pokémon se recusa a aceitar o fim ou a abandonar sua posição. Ele pode ignorar ordens de retirada ou persistir na batalha mesmo após sofrer danos graves."},{"name":"Casaco de Neve (Snow Cloak)","desc":"Aumenta a capacidade de evasão em tempestades de granizo."}],
    "hidden_ability": { "name": "Ímpeto Nevado (Slush Rush)", "desc": "Aumenta a velocidade do pokémon em tempestades de granizo." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats": {
      "hp": 106,
      "atk": 94,
      "def": 83,
      "spa": 101,
      "spd": 87,
      "spe": 64
    },
    "moves": [
      {
        "level": "(Evo)",
        "name": "Ice Beam",
        "type":"Ice",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode congelar o oponente."
      },
      {
        "level": 52,
        "name": "Hyper Voice",
        "type":"Normal",
        "category":"special",
        "power":90,
        "accuracy":100
      },
      {
        "level": 55,
        "name": "Freeze-Dry",
        "type":"Ice",
        "category":"special",
        "power":70,
        "accuracy":100,
        "desc":"Pode congelar o oponente. Super-efetivo contra pokémon do tipo água."
      },
      {
        "level": 60,
        "name": "Dragon Pulse",
        "type":"Dragon",
        "category":"special",
        "power":85,
        "accuracy":100
      },
      {
        "level": 65,
        "name": "Snowscape",
        "type":"Ice",
        "desc": "Aumenta a Defesa de Pokémon do tipo Gelo por 5 turnos e inicia uma nevasca."
      },
      {
        "level": 72,
        "name": "Roost",
        "type":"Flying",
        "desc":"O usuário recupera metade de seus pontos de vida máximos e perde temporariamente o tipo Voador."
      },
      {
        "level": 78,
        "name": "Blizzard",
        "type": "Ice",
        "category":"special",
        "power":110,
        "accuracy":70,
        "desc": "Pode confundir o oponente."
      },
      {
        "level": 85,
        "name": "Dragon Cheer",
        "type":"Dragon",
        "desc": "Aumenta drasticamente a chance de crítico."
      }
    ]
  },
  {
    "id":52,
    "name":"Fotonon",
    "number":"052",
    "types":[
      "Psychic"
    ],
    "image":"/images/Fotonon (placeholder).png",
    "entry":"Extremamente protetor com seu prisma, este Pokémon se recusa a deixar que estranhos o toquem. Dizem que a pureza das formas geométricas que ele cria reflete a clareza de seus pensamentos e a alegria que sente ao projetar algo novo.",
    "height_m":0.5,
    "weight_kg":5.5,
    "description":"O Fotonon é um Pokémon pequeno e de aparência elegante, com uma silhueta que lembra uma criança em vestes cerimoniais. Seu corpo é majoritariamente branco fosco, com detalhes em ciano profundo nas articulações. Seus olhos são grandes e expressivos, demonstrando uma curiosidade constante pelo mundo. \n O traço mais marcante é o seu Cristal de Luz: uma pedra multifacetada e flutuante que, quando o Pokémon está em repouso, ele carrega cuidadosamente com as duas mãos, protegendo-o como se fosse um tesouro. Quando decide usar seus poderes, o cristal flutua acima de sua cabeça, girando lentamente enquanto refrata a luz ao redor. \n Nativo de cadeias montanhosas ricas em minérios, o Fotonon passa o dia observando as formações rochosas e as cavernas de cristal. Ele é um aprendiz nato: usa seus poderes psíquicos para 'imprimir' luz sólida através de seu prisma, criando réplicas luminosas de cristais e pedras que encontra pelo caminho. \n Diferente de suas evoluções, o Fotonon é extremamente dócil e lúdico. Ele não se importa se suas criações são assimétricas ou efêmeras; ele se diverte criando bolas de luz para chutar ou cubos de montar para escalar. É um Pokémon prestativo: se encontrar um viajante em dificuldade, pode usar sua mente para criar um banquinho ou uma pequena plataforma de luz para ajudá-lo a descansar.",
    "abilities":[{"name":"Iluminação (Illuminate)","desc":"Aumenta a probabilidade de encontrar Pokémon selvagens."}],
    "hidden_ability":{"name":"Analítico (Analytic)","desc":"Aumenta o poder do movimento quando o Pokémon se move por último."},
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "evolutions":[
      {
        "id":53,
        "number":"053",
        "name":"Vishaktec",
        "method":"Evolui no nível 16.",
        "image": "/images/pyroak.svg"
      }
    ],
    "base_stats":{
      "hp":42,
      "atk":23,
      "def":44,
      "spa":56,
      "spd":47,
      "spe":53
    },
    "moves":[
      {
        "level":1,
        "name":"Pound",
        "type":"Normal",
        "category":"physical",
        "power":40,
        "accuracy":100
      },
      {
        "level":1,
        "name":"Confusion",
        "type":"Psychic",
        "category":"special",
        "power":50,
        "accuracy":100,
        "desc":"Pode confundir o oponente."
      },
      {
        "level":4,
        "name":"Flash",
        "type":"Normal",
        "desc":"Diminui a Precisão do oponente."
      },
      {
        "level":8,
        "name":"Telekinesis",
        "type":"Psychic",
        "desc": "Ignora a Evasão do oponente por três turnos e concede imunidade a dano Terrestre."
      },
      {
        "level":12,
        "name":"Light Screen",
        "type":"Psychic",
        "desc":"Reduz pela metade o dano recebido de ataques especiais por 5 turnos."
      },
      {
        "level":15,
        "name":"Swift",
        "type":"Normal",
        "category":"special",
        "power":60,
        "accuracy":"∞",
        "desc":"Ignora Evasão e Precisão."
      }
    ]
  },
  {
    "id":53,
    "name":"Vishaktec",
    "number":"053",
    "types":[
      "Psychic"
    ],
    "image":"/images/spriglet.svg",
    "entry":"Este Pokémon vive um constante dilema estético. Ele viaja entre metrópoles e florestas virgens, tentando decidir se a perfeição reside na ordem absoluta da tecnologia ou na beleza imperfeita da natureza.",
    "height_m":1.1,
    "weight_kg":28.4,
    "description":"O corpo do Vishaktec é um prodígio da adaptação psíquica. Sua pele desenvolveu uma textura sintética, uma 'vestimenta orgânica' que é, na verdade, uma extensão de seu sistema nervoso. Essa membrana lisa protege seus órgãos internos e ajuda a isolar a energia estática que ele gera ao processar cálculos complexos. \n O coração do Vishaktec não apenas bombeia sangue, mas serve como um gerador de fótons. Essa energia é enviada para os três cristais orbitais que flutuam ao redor de sua cabeça. Estes cristais agem como processadores externos: eles giram em altíssima velocidade para triangular a luz e estabilizar as projeções psíquicas. Graças à velocidade de rotação e à proteção de um campo magnético mental, é virtualmente impossível atingir ou quebrar esses cristais durante um combate. \n O Vishaktec é conhecido por sua natureza contemplativa e silenciosa. Ao contrário do Fotonon, ele raramente brinca. Sua vida é uma busca por referências. Ele é frequentemente visto imóvel em jardins ou praças públicas, observando por horas a proporção das pétalas de uma flor ou o ângulo de um arranha-céu. Embora suas estruturas de luz sólida tenham se tornado muito mais complexas, elas ainda possuem um limite de tempo. Uma ponte criada por um Vishaktec pode suportar toneladas, mas desaparecerá sem aviso assim que a concentração do Pokémon oscilar. \n Por causa disso, Vishaktec e humanos vivem uma relação de mentoria mútua. Eles são comuns em escritórios de engenharia e arquitetura avançada, onde atuam como maquetistas. O Vishaktec projeta uma versão em tamanho real do que os humanos planejam, permitindo que os engenheiros vejam erros de cálculo antes da obra começar. Em troca, o Pokémon aprende sobre as leis da física e da estética humana, o que o ajuda a decidir seu caminho evolutivo.",
    "abilities":[{"name":"Olhos Compostos (Compoud Eyes)","desc":"Aumenta a precisão do pokémon."}],
    "hidden_ability":{"name":"Analítico (Analytic)","desc":"Aumenta o poder do movimento quando o Pokémon se move por último."},
    "evolution_stage":2,
    "is_final_stage":false,
    "evolution_display_type":"BRANCHING",
    "evolutions":[
      {
        "id":54,
        "number":"054",
        "name":"Lotureza",
        "method":"Evolui com leaf stone.",
        "image": "/images/pyroak.svg"
      },
      {
        "id":55,
        "number":"055",
        "name":"Symetrirtemys",
        "method":"Evolui com metal coat.",
        "image": "/images/pyroak.svg"
      }
    ],
    "base_stats":{
      "hp":61,
      "atk":37,
      "def":62,
      "spa":88,
      "spd":76,
      "spe":88
    },
    "moves":[
      {
        "level":"(Evo)",
        "name":"Mirror Coat",
        "type":"Psychic",
        "category":"special",
        "accuracy":100,
        "desc": "Ao ser atingido por um Ataque Especial, o usuário contra-ataca com o dobro do poder."
      },
      {
        "level":19,
        "name":"Reflect",
        "type":"Psychic",
        "desc":"Reduz pela metade o dano recebido de ataques físicos por 5 turnos."
      },
      {
        "level":24,
        "name":"Psybeam",
        "type":"Psychic",
        "category":"special",
        "power":65,
        "accuracy":"100",
        "desc":"Pode confundir o oponente."
      },
      {
        "level":30,
        "name":"Psychic",
        "type":"Psychic",
        "category":"special",
        "power":90,
        "accuracy":100,
        "desc": "Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level":37,
        "name":"Photon Shield",
        "type":"Psychic",
        "desc":"Protege o usuário e aliados de ataques físicos por 1 turno."
      },
      {
        "level":45,
        "name":"Guard Swap",
        "type":"Psychic",
        "desc":"Usuário e oponente trocam Defesa e Defesa Especiall."
      },
      {
        "level":58,
        "name":"Photon Geyser",
        "type":"Psychic",
        "category":"special",
        "power":100,
        "accuracy":100,
        "desc":"Usa Ataque ou Ataque Especial, qual estiver maior."
      },
      {
        "level":64,
        "name":"Geometric Pulse",
        "type":"Psychic",
        "category":"special",
        "accuracy":80,
        "desc":"Quanto menor a Precisão/Evasão do oponente, maior o poder do ataque."
      }
    ]
  },
  {
    "id":54,
    "name":"Lotureza",
    "number":"054",
    "types":[
      "Psychic",
      "Grass"
    ],
    "image":"/images/pyroak.svg",
    "entry":"Diz a lenda que o primeiro Lotureza nasceu quando um Vishaktec se recusou a construir uma parede que bloquearia a luz solar de uma flor solitária. Ele molda a luz como se fosse argila, criando estruturas que respiram e se regeneram, provando que a maior perfeição está na vida em constante mudança.",
    "height_m":1.8,
    "weight_kg":65,
    "description":"Ao evoluir através da Leaf Stone, a estrutura molecular do Vishaktec se torna flexível e resiliente. Os cristais que orbitavam sua cabeça agora se expandem e se estabilizam nas suas costas, transformando-se em seis pétalas de luz sólida rosada que nunca se apagam. \n Diferente do metal, essas pétalas são quentes e vibram em uma frequência que estimula o crescimento de plantas ao redor. Suas mãos agora possuem glândulas que emitem fios de luz orgânica, permitindo que ele teça estruturas complexas, como pontes de cipós luminosos ou casulos de proteção. \n O Lotureza é um Pokémon nômade que busca restaurar o que foi destruído pela urbanização desenfreada ou por desastres naturais. Ele não vê a tecnologia como inimiga, mas acredita que ela deve ser curativa. \n É comum ver um Lotureza em florestas antigas, meditando em cima de uma plataforma de luz. Ele é tão leve que pode caminhar sobre a água ou sobre as folhas das árvores sem dobrá-las. Sua presença acalma Pokémon selvagens territoriais, transformando campos de batalha em santuários de paz.",
    "abilities":[{"name":"Cura Natural (Natural Cure)","desc":"Todos os problemas de status são curados quando é trocado."},{"name":"Triagem (Triage)", "desc":"Dá prioridade a ações restauradoras."}],
    "hidden_ability":{"name":"Analítico (Analytic)","desc":"Aumenta o poder do movimento quando o Pokémon se move por último."},
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats":{
      "hp":94,
      "atk":48,
      "def":73,
      "spa":107,
      "spd":111,
      "spe":99
    },
    "moves":[
      {
        "level":"(Evo)",
        "name":"Floral Healing",
        "type":"Fairy",
        "desc": "O usuário restaura até metade do HP máximo do alvo. A restauração de HP é maior em terrenos com grama."
      },
      {
        "level":16,
        "name":"Pin Missile",
        "type":"Bug",
        "category":"physical",
        "power":25,
        "accuracy":95,
        "desc":"Acerta 2-5 vezes em um turno."
      },
      {
        "level":16,
        "name":"Telekinesis",
        "type":"Psychic",
        "desc": "Ignora a Evasão do oponente por três turnos e concede imunidade a dano Terrestre."
      },
      {
        "level":19,
        "name": "Magical Leaf",
        "type":"Grass",
        "category":"special",
        "power":60,
        "accuracy": "∞",
        "desc": "Ignora precisão e evasiva."
      },
      {
        "level":23,
        "name":"Ally Switch",
        "type":"Psychic",
        "desc":"Usuário troca de posição com aliado oposto."
      },
      {
        "level":27,
        "name":"Aromatherapy",
        "type": "Grass",
        "desc": "Cura todos os problemas de status do seu grupo."
      },
      {
        "level":31,
        "name":"Spiky Shield",
        "type":"Grass",
        "desc":"Protege usuário e causa dano no contato."
      },
      {
        "level":39,
        "name":"Giga Drain",
        "type":"Grass",
        "category":"special",
        "power":75,
        "accuracy":100,
        "desc": "O usuário recupera metade dos pontos de vida infligidos ao oponente."
      },
      {
        "level":39,
        "name":"Psychic Terrain",
        "type":"Psychic",
        "desc": "Impede que movimentos prioritários sejam usados ​​por 5 turnos."
      },
      {
        "level":47,
        "name":"Grassy Terrain",
        "type":"Grass",
        "desc": "Restaura um pouco de HP de todos os Pokémon por 5 turnos."
      },
      {
        "level":52,
        "name":"Heal Pulse",
        "type":"Psychic",
        "desc": "Usuário recupera metade de seu HP máximo."
      },
      {
        "level":64,
        "name":"Solar Beam",
        "type":"Grass",
        "category":"special",
        "power":120,
        "accuracy":100,
        "desc": "Carrega no primeiro turno, ataca no segundo."
      },
      {
        "level":70,
        "name":"Vital Bloom",
        "type":"Grass",
        "desc": "Cura pokémon do time aliado e aumenta Defesa e Deffesa Especial por 3 turnos."
      },
      {
        "level":75,
        "name":"Healing Wish",
        "type":"Psychic",
        "desc": "O usuário desmaia e o próximo Pokémon liberado está totalmente curado."
      }
    ]
  },
  {
    "id":55,
    "name":"Symetrirtemys",
    "number":"055",
    "types":[
      "Psychic",
      "Steel"
    ],
    "image":"/images/pyroak.svg",
    "entry":"Symetrirtemys não enxerga o mundo como nós; ela enxerga uma grade invisível de possibilidades infinitas. Embora não possua malícia, ela é incapaz de ignorar o que considera 'ruído visual'. Se um terreno precisa de uma ponte, ela não apenas a constrói; ela a tece com luz sólida em uma simetria tão absoluta que o olho humano mal consegue processar sua perfeição.",
    "height_m":1.7,
    "weight_kg":82,
    "description":"Diferente de sua contraparte, Symetrirtemys abandonou completamente o aspecto orgânico. Seu corpo é uma estrutura de aço polido, com acabamento branco fosco e detalhes em azul cianeto, lembrando a estética futurista de cidades utópicas. Sua silhueta é composta por ângulos agudos e curvas calculadas pela proporção áurea. \n O detalhe mais impressionante são seus braços: do ombro para baixo, não há metal ou osso. No lugar dos membros, orbitam projeções de luz sólida constantes. Esses braços de energia não possuem as limitações de articulações comuns; eles podem se desfragmentar e se reconfigurar em milissegundos para realizar os complexos mudras (sinais de mão) necessários para tecer a realidade. Para Symetrirtemys, a carne era um erro de cálculo; a luz é a ferramenta definitiva. \n Ela é a personificação da Lei e Ordem. Se uma Symetrirtemys encontra uma floresta devastada, ela não replantará as árvores aleatoriamente como o Lotureza. Ela criará uma malha de suporte metálica e luz sólida onde cada nova muda crescerá a uma distância milimetricamente igual da outra.",
    "abilities":[{"name":"Filtro (Filter)", "desc":"Reduz o dano de ataques super-efetivos recebidos."},{"name":"Corpo Limpo (Clear Body)", "desc":"Previne outros pokémon de diminuir seus stats."}],
    "hidden_ability":{"name":"Analítico (Analytic)","desc":"Aumenta o poder do movimento quando o Pokémon se move por último."},
    "evolution_stage":3,
    "is_final_stage":true,
    "base_stats":{
      "hp":89,
      "atk":34,
      "def":144,
      "spa":144,
      "spd":34,
      "spe":89
    },
    "moves":[
      {
        "level":"(Evo)",
        "name":"Mirror Shot",
        "type":"Steel",
        "category":"special",
        "power":65,
        "accuracy":85,
        "desc": "Pode diminuir a Precisão do oponente."
      },
      {
        "level":16,
        "name":"Teleport",
        "type":"Psychic",
        "desc":"Permite ao usuário fugir de batalhas selvagens; também teletransporta o jogador para o último Centro Pokémon."
      },
      {
        "level":16,
        "name":"Reflect",
        "type":"Psychic",
        "desc":"Reduz pela metade o dano recebido de ataques físicos por 5 turnos."
      },
      {
        "level":21,
        "name":"Charge Beam",
        "type":"Electric",
        "category":"special",
        "power":50,
        "accuracy":90,
        "desc": "Pode aumentar o Ataque Especial do usuário."
      },
      {
        "level":26,
        "name":"Spikes",
        "type":"Ground",
        "desc":"Causa dano aos oponentes que entram em combate."
      },
      {
        "level":34,
        "name":"Flash Cannon",
        "type":"Steel",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc":"Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level":39,
        "name":"Lock-On",
        "type":"Normal",
        "desc":"Próximo ataque do usuário é garantido de acertar."
      },
      {
        "level":44,
        "name":"Toxic Spikes",
        "type":"Poison",
        "desc":"Envenena oponentes que entram em combate."
      },
      {
        "level":50,
        "name":"Luster Purge",
        "type":"Psychic",
        "category":"special",
        "power":95,
        "accuracy":100,
        "desc":"Pode diminuir a Defesa Especial do oponente."
      },
      {
        "level":55,
        "name":"Steel Beam",
        "type":"Steel",
        "category":"special",
        "power":140,
        "accuracy":95,
        "desc":"Usuário perde 50% de seu HP."
      },
      {
        "level":60,
        "name":"Gravity",
        "type":"Psychic",
        "desc":"Impede movimentos como Voar e Saltar, além da habilidade Levitar, por 5 turnos."
      },
      {
        "level":68,
        "name":"Mirror Coat",
        "type":"Psychic",
        "category":"special",
        "accuracy":100,
        "desc": "Ao ser atingido por um Ataque Especial, o usuário contra-ataca com o dobro do poder."
      },
      {
        "level":75,
        "name":"Photon Barrier",
        "type":"Steel",
        "desc":"Durante dois turnos, a equipe fica imune a ataques especiais e recebe menos dano de ataques físicos."
      }
    ]
  },
  {
    "id":56,
    "name":"Shimashu",
    "number":"056",
    "image":"/images/spriglet.svg",
    "types":[
      "Fighting"
    ],
    "evolution_stage":1,
    "is_final_stage":false,
    "evolution_display_type":"SEQUENTIAL",
    "has_variants": true,
    "variants": [
      {
        "variant_name": "Norte",
        "height_m":0.7,
        "weight_kg":18.5,
        "types": ["Fighting"],
        "image": "/images/spriglet.svg",
        "entry": "Diferente de sua contraparte do sul, o este Shimashu é mais calmo e paciente.",
        "description":"Sua pele principal tem um tom de azul acinzentado fosco, mas o que realmente se destaca são suas placas dorsais. Estas placas são feitas de uma queratina densa em tom de azul vibrante e estão dispostas de forma sobreposta, criando um padrão idêntico a uma armadura samurai. Essas escamas reforçadas protegem seu dorso, pescoço e peito. No topo de sua cabeça, pequenas protuberâncias ósseas se ramificam como galhadas de dragão, sinalizando seu potencial místico latente. \n A característica mais perigosa é sua cauda. Ela termina em uma extensão óssea reta, plana e polida, que possui um fio de corte tão afiado quanto uma katana recém-forjada. \n Habita as encostas geladas e templos esquecidos nas montanhas do Norte. O Shimashu do Norte é um Pokémon solitário e profundamente disciplinado. Quando provocado, ele não avança de forma selvagem; ele se posiciona, levanta seu longo pescoço com imponência e aguarda o momento exato para desferir um único golpe de cauda.",
        "evolutions":[{
          "id": 57,
          "name": "Arashimada",
          "number": "057",
          "method": "Evolui ao ser trocado com Shimashu (Sul).",
          "image": "/images/pyroak.svg" 
        }],
        "base_stats":{
          "hp":47,
          "atk":81,
          "def":61,
          "spa":23,
          "spd":39,
          "spe":60
        },
        "abilities":[{"name":"Afiação (Sharpness)", "desc":"Aumenta o pode de ataques cortantes."},{"name":"Foco Interior (Inner Focus)", "desc":"O pokémon fica protegido de estremecer."}],
        "hidden_ability":{"name":"Firme (Steadfast)","desc":"Aumenta a Velocidade sempre que o pokémon estremecer."},
        "moves": [
          {
            "level":1,
            "name":"Leer",
            "type":"Normal",
            "accuracy":100,
            "desc": "Diminui a Defesa do oponente."
          },
          {
            "level":1,
            "name":"Quick Attack",
            "type": "Normal",
            "category":"physical",
            "power":40,
            "accuracy":100,
            "desc": "Usuário ataca primeiro."
          },
          {
            "level":4,
            "name":"Focus Energy",
            "type":"Normal",
            "desc": "Aumenta a chance de crítico."
          },
          {
            "level":8,
            "name":"Rock Tomb",
            "type":"Rock",
            "category":"physical",
            "power": 60,
            "accuracy": 95,
            "desc": "Diminui a Velocidade do oponente."
          },
          {
            "level":12,
            "name":"Iron Defense",
            "type":"Steel",
            "desc": "Aumenta drasticamente a Defesa do Usuário."
          },
          {
            "level":16,
            "name":"Aerial Ace",
            "type":"Flying",
            "category":"physical",
            "power":60,
            "accuracy":"∞",
            "desc":"Ignora Evasão e Precisão."
          },
          {
            "level":20,
            "name":"Retaliate",
            "type":"Normal",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc":"Causa dano dobrado se um companheiro de equipe desmaiou no último turno."
          },
          {
            "level":24,
            "name":"Slash",
            "type":"Normal",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc":"Alta taxa de acerto crítico."
          },
          {
            "level":28,
            "name":"Swords Dance",
            "type":"Normal",
            "desc": "Aumenta drasticamente o Ataque do Usuário."
          },
          {
            "level":32,
            "name":"Sacred Sword",
            "type":"Fighting",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc":"Ignora as mudanças de stats do oponente."
          },
          {
            "level":36,
            "name":"Dragon Dance",
            "type":"Dragon",
            "desc":"Aumenta o Ataque e Velocidade do usuário."
          },
          {
            "level":40,
            "name":"Smart Strike",
            "type":"Steel",
            "category":"physical",
            "power":70,
            "desc": "O usuário perfura o oponente. Esse ataque nunca erra."
          },
          {
            "level":44,
            "name":"Dragon Claw",
            "type": "Dragon",
            "category":"physical",
            "power":80,
            "accuracy":100
          },
          {
            "level":48,
            "name":"Focus Punch",
            "type":"Fighting",
            "category":"physical",
            "power":150,
            "accuracy":100,
            "desc":"Se o usuário for atingido antes de atacar, ele recua em vez de atacar."
          },
          {
            "level":52,
            "name":"Extreme Speed",
            "type":"Normal",
            "category":"physical",
            "power":80,
            "accuracy":100,
            "desc":"Usuário ataca primeiro."
          }
        ]
      },
      {
        "variant_name": "Sul",
        "height_m":0.7,
        "weight_kg":12,
        "types": ["Fighting"],
        "image": "/images/spriglet.svg",
        "entry": "Diferente de sua contraparte do norte, o este Shimashu é mais agitado e inquieto.",
        "description":"Ao contrário de sua contraparte do norte, este Pokémon possui um corpo esguio e aerodinâmico, coberto por escamas lisas em um tom de verde-musgo desaturado. Sua pele não apresenta as placas rígidas de armadura, o que o torna consideravelmente mais leve e silencioso ao se mover pela vegetação densa. \n Ele compartilha as mesmas características sagradas de sua linhagem: um par de galhadas de dragão que se projetam da cabeça e uma cauda terminada em uma lâmina óssea extremamente afiada. No entanto, sua postura é relaxada e seus olhos transmitem uma expressão amigável e curiosa, revelando uma personalidade menos sisuda. \n Habita as florestas tropicais e vales úmidos do Sul. Enquanto o Shimashu do Norte treina a resistência, o do Sul treina a evasão. Ele encara a luta como uma dança, movendo-se com uma leveza que desafia a gravidade. É comum vê-lo observando viajantes com curiosidade, oculto pelo verde das árvores. Dizem que sua calma é a preparação para uma tempestade que ele ainda não sabe que terá de enfrentar.",
        "evolutions":[{
          "id": 58,
          "name": "Hayashimada",
          "number": "058",
          "method": "Evolui ao ser trocado com Shimashu (Norte).",
          "image": "/images/pyroak.svg" 
        }],
        "base_stats":{
          "hp":40,
          "atk":71,
          "def":40,
          "spa":31,
          "spd":39,
          "spe":90
        },
        "abilities":[{"name":"Afiação (Sharpness)", "desc":"Aumenta o pode de ataques cortantes."},{"name":"Foco Interior (Inner Focus)", "desc":"O pokémon fica protegido de estremecer."}],
        "hidden_ability":{"name":"Firme (Steadfast)","desc":"Aumenta a Velocidade sempre que o pokémon estremecer."},
        "moves": [
          {
            "level":1,
            "name":"Leer",
            "type":"Normal",
            "accuracy":100,
            "desc": "Diminui a Defesa do oponente."
          },
          {
            "level":1,
            "name":"Quick Attack",
            "type": "Normal",
            "category":"physical",
            "power":40,
            "accuracy":100,
            "desc": "Usuário ataca primeiro."
          },
          {
            "level":4,
            "name":"Focus Energy",
            "type":"Normal",
            "desc": "Aumenta a chance de crítico."
          },
          {
            "level":8,
            "name":"Trailblaze",
            "type":"Grass",
            "category":"physical",
            "power": 50,
            "accuracy": 100,
            "desc": "Aumenta a Velocidade do Usuário."
          },
          {
            "level":12,
            "name":"Double Team",
            "type":"Normal",
            "desc": "Aumenta a Evasão do usuário."
          },
          {
            "level":16,
            "name":"Aerial Ace",
            "type":"Flying",
            "category":"physical",
            "power":60,
            "accuracy":"∞",
            "desc":"Ignora Evasão e Precisão."
          },
          {
            "level":20,
            "name":"Agility",
            "type":"Psychic",
            "desc":"Aumenta drasticamente a Velocidade do usuário."
          },
          {
            "level":24,
            "name":"Slash",
            "type":"Normal",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc":"Alta taxa de acerto crítico."
          },
          {
            "level":28,
            "name":"Swords Dance",
            "type":"Normal",
            "desc": "Aumenta drasticamente o Ataque do Usuário."
          },
          {
            "level":32,
            "name":"Night Slash",
            "type":"Dark",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc":"Alta taxa de acerto crítico."
          },
          {
            "level":36,
            "name":"Dragon Dance",
            "type":"Dragon",
            "desc":"Aumenta o Ataque e Velocidade do usuário."
          },
          {
            "level":40,
            "name":"U-Turn",
            "type":"Bug",
            "category":"physical",
            "power":70,
            "accuracy":100,
            "desc": "O usuário troca de lugar imediatamente após atacar."
          },
          {
            "level":44,
            "name":"Dragon Claw",
            "type": "Dragon",
            "category":"physical",
            "power":80,
            "accuracy":100
          },
          {
            "level":48,
            "name":"First Impression",
            "type":"Bug",
            "category":"physical",
            "power":90,
            "accuracy":100,
            "desc":"Embora esse movimento tenha grande poder, ele só funciona no primeiro turno em que o usuário entra em batalha."
          },
          {
            "level":52,
            "name":"Extreme Speed",
            "type":"Normal",
            "category":"physical",
            "power":80,
            "accuracy":100,
            "desc":"Usuário ataca primeiro."
          }
        ]
      }
    ],
    "base_stats":{
          "hp":47,
          "atk":81,
          "def":61,
          "spa":23,
          "spd":39,
          "spe":60
        }
  },
  {
    "id":57,
    "name":"Arashimada",
    "number":"057",
    "types":[
      "Fighting",
      "Dragon"
    ],
    "image":"/images/pyroak.svg",
    "entry":"Diz a lenda que este Pokémon baniu sua própria lâmina após um duelo que partiu seu coração.",
    "height_m":1.8,
    "weight_kg":85,
    "description":"O Arashimada é um Pokémon bípede de presença intimidadora e melancólica. Sua coloração azul-turquesa original tornou-se mais profunda, agora adornada com marcas negras orgânicas que serpenteiam por seus braços e tronco, lembrando tatuagens de guerra ancestrais. Sua pele é protegida por placas de queratina que emulam uma armadura samurai completa. \n A característica mais fascinante de sua anatomia é o Arco Mandibular. Na lateral de seu pescoço, existem duas estruturas ósseas retráteis que se projetam para frente e se curvam quando o Pokémon entra em posição de ataque. Entre as pontas desses espinhos, uma corda de pura energia espiritual se materializa. O Arashimada utiliza sua boca como o ponto de origem para disparos de ar comprimido e energia de dragão, funcionando como um arco e flecha biológico de precisão cirúrgica. \n O Arashimada é um eremita por natureza. Ele habita as altitudes mais extremas, onde o ar é rarefeito e o silêncio é absoluto. Embora seja um Pokémon do tipo Lutador, ele evita o combate corpo a corpo, preferindo utilizar sua agilidade para escalar superfícies verticais e disparar de ângulos imprevisíveis. \n Uma vez por ano, esses Pokémon realizam uma migração silenciosa para templos antigos. Eles não interagem com os Shimashu que encontram no caminho; pelo contrário, mantêm uma distância solene, como se o peso de sua evolução os impedisse de olhar para o passado.",
    "abilities":[{"name":"Afiação (Sharpness)", "desc":"Aumenta o pode de ataques cortantes."},{"name":"Foco Interior (Inner Focus)", "desc":"O pokémon fica protegido de estremecer."}],
    "hidden_ability":{"name":"Franco-Atirador (Sniper)","desc":"Aumenta o poder dos golpes se eles se tornarem acertos críticos."},
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats":{
      "hp":72,
      "atk":120,
      "def":85,
      "spa":105,
      "spd":78,
      "spe":80
    },
    "moves":[
      {
        "level":"(Evo)",
        "name":"Foresight",
        "type":"Normal",
        "desc": "Redefine a Evasão do oponente e permite que ataques do tipo Normal e Lutador atinjam Fantasmas."
      },
      {
        "level":20,
        "name":"Agility",
        "type":"Psychic",
        "desc":"Aumenta drasticamente a Velocidade do usuário."
      },
      {
        "level":24,
        "name":"Dragon Breath",
        "type":"Dragon",
        "category":"special",
        "power":60,
        "accuracy":100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level":30,
        "name":"Focus Energy",
        "type":"Normal",
        "desc": "Aumenta a chance de crítico."
      },
      {
        "level":36,
        "name":"Aura Sphere",
        "type":"Fighting",
        "category":"special",
        "power":80,
        "accuracy":"∞",
        "desc":"Ignora Evasão e Precisão."
      },
      {
        "level":42,
        "name":"Scale Shot",
        "type":"Dragon",
        "category":"physical",
        "power":25,
        "accuracy":90,
        "desc": "Ataca de 2 a 5 vezes por turno. Aumenta a Velocidade do usuário, mas diminui sua Defesa."
      },
      {
        "level":50,
        "name":"Dragon Pulse",
        "type":"Dragon",
        "category":"special",
        "power":85,
        "accuracy":100
      },
      {
        "level":60,
        "name":"Dragon Dance",
        "type":"Dragon",
        "desc":"Aumenta o Ataque e Velocidade do usuário."
      },
      {
        "level":70,
        "name":"Dragon Energy",
        "type":"Dragon",
        "category":"special",
        "power":150,
        "accuracy":100,
        "desc":"Quanto mais alto o HP do usuário, maior o poder."
      }
    ]
  },
  {
    "id":58,
    "name":"Hayashimada",
    "number":"058",
    "types":[
      "Steel",
      "Dragon"
    ],
    "image":"/images/pyroak.svg",
    "entry":"Diz a lenda que este Pokémon nasceu de um Shimashu que desafiou o destino e confrontou um irmão pressionado.",
    "height_m":1.7,
    "weight_kg":110,
    "description":"O Hayashimada é uma maravilha da evolução tecnológica e biológica. Após sobreviver a um evento traumático, seu corpo passou por uma mutação cibernética total: suas escamas orgânicas foram substituídas por uma liga metálica leve e ultra-resistente. Seu design é esguio e aerodinâmico, com uma estética cyberpunk agressiva. \n Abandonando a cauda-espada de sua forma anterior, este Pokémon desenvolveu lâminas fixas em seus antebraços. Elas se projetam para frente como as de um Scyther, mas são compostas de aço temperado que nunca perde o corte. Ele luta de forma bípede, utilizando estas lâminas como extensões naturais de seus ossos. \n Sulcos profundos e circuitos pulsantes atravessam todo o seu corpo metálico, brilhando intensamente em verde-néon. Essa luz é a manifestação de sua energia de dragão interna, que agora serve como o combustível que impulsiona seus sistemas a velocidades sobre-humanas. \n O Hayashimada é um andarilho veloz. Ao contrário de seu parente arqueiro, ele não busca o isolamento das montanhas, mas sim a superação de seus próprios limites. Ele vaga por diversos habitats, desde selvas densas até complexos industriais, movendo-se com tamanha agilidade que raramente é visto por olhos humanos. \n Recentemente evoluídos, os Hayashimada podem demonstrar uma natureza instável enquanto tentam reconciliar sua mente de dragão com seu novo corpo de máquina. No entanto, uma vez que atingem o equilíbrio, tornam-se guardiões implacáveis e velozes, capazes de atravessar campos de batalha inteiros em segundos para proteger o que consideram importante.",
    "abilities":[{"name":"Afiação (Sharpness)", "desc":"Aumenta o pode de ataques cortantes."},{"name":"Aumento de Velocidade (Speed Boost)", "desc":"Seu atributo de Velocidade aumenta gradualmente."}],
    "hidden_ability": { "name": "Infiltrador (Infiltrator)", "desc": "Atravessa a barreira do inimigo e ataca." },
    "evolution_stage":2,
    "is_final_stage":true,
    "base_stats":{
      "hp":70,
      "atk":115,
      "def":75,
      "spa":60,
      "spd":70,
      "spe":150
    },
    "moves":[
      {
        "level":"(Evo)",
        "name":"Detect",
        "type":"Fighting",
        "desc": "Protege o usuário, mas pode falhar se usado consecutivamente."
      },
      {
        "level":20,
        "name":"Metal Claw",
        "type":"Steel",
        "category":"physical",
        "power":50,
        "accuracy":95,
        "desc":"Pode aumentar o Ataque do usuário."
      },
      {
        "level":24,
        "name":"Quick Attack",
        "type": "Normal",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level":28,
        "name":"Pin Missile",
        "type":"Bug",
        "category":"physical",
        "power":25,
        "accuracy":95,
        "desc":"Acerta 2-5 vezes em um turno."
      },
      {
        "level":32,
        "name":"Agility",
        "type":"Psychic",
        "desc":"Aumenta drasticamente a Velocidade do usuário."
      },
      {
        "level":36,
        "name":"Smart Strike",
        "type":"Steel",
        "category":"physical",
        "power":70,
        "desc": "O usuário perfura o oponente. Esse ataque nunca erra."
      },
      {
        "level":42,
        "name":"Night Slash",
        "type":"Dark",
        "category":"physical",
        "power":70,
        "accuracy":100,
        "desc":"Alta taxa de acerto crítico."
      },
      {
        "level":48,
        "name":"Dragon Claw",
        "type": "Dragon",
        "category":"physical",
        "power":80,
        "accuracy":100
      },
      {
        "level":54,
        "name":"X-Scissor",
        "type":"Bug",
        "category":"physical",
        "power":80,
        "accuracy":100
      },
      {
        "level":60,
        "name":"Dragon Dance",
        "type":"Dragon",
        "desc":"Aumenta o Ataque e Velocidade do usuário."
      },
      {
        "level":66,
        "name":"Extreme Speed",
        "type":"Normal",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Usuário ataca primeiro."
      },
      {
        "level":72,
        "name":"Iron Head",
        "type":"Steel",
        "category":"physical",
        "power":80,
        "accuracy":100,
        "desc":"Pode estremecer o oponente."
      }
    ]
  },
  {
    "id":59,
    "name":"Colomalware",
    "number":"059",
    "types":[
      "Dark",
      "Ghost"
    ],
    "image":"/images/pyroak.svg",
    "entry":"Dizem que se o sinal do seu aparelho cair três vezes seguidas sem motivo aparente, um Colomalware acabou de vender o seu histórico de buscas para o seu maior rival.",
    "height_m":1.3,
    "weight_kg":18.5,
    "description":"Colomalware é uma entidade digital-biológica que habita as zonas cinzentas das grandes metrópoles. Embora possua um corpo físico com textura semelhante a tecido e uma máscara óssea que remete ao tipo Fantasma, sua existência é intrinsecamente ligada ao fluxo de dados. Ele é capaz de se desintegrar em cubos pixelados para transitar entre o mundo real e o plano digital, onde infecta redes para causar má conexão e roubar informações privilegiadas. \n Diferente de outros Pokémon que buscam sustento em bagas ou caça, Colomalware se nutre da energia gerada pela frustração e pelo caos. Ele não é um companheiro leal por natureza; mesmo após capturado, é conhecido por pregar peças em seu próprio treinador, ocultando mensagens ou alterando dados da Pokédex por puro divertimento. Suas interações com outros Pokémon são raras e puramente utilitárias, preferindo a companhia de humanos, cujos segredos ele considera fascinantes. \n Em batalha, o desânimo de enfrentar um Colomalware é imediato. Ele raramente utiliza força bruta, focando em incapacitar sistematicamente todas as ferramentas do adversário. Seu método favorito de encerrar um conflito não é o nocaute, mas sim o deboche: após deixar o oponente completamente impossibilitado de reagir, ele se aproxima, executa um leve toque no nariz da vítima — o infame 'Boop' — e desaparece em uma nuvem de pixels antes que possa ser atingido. \n Sua paleta de cores em tons de roxo profundo e neon serve como um aviso visual em ambientes urbanos escuros. O traço mais marcante, contudo, são seus olhos. Apesar da máscara estática, os olhos de Colomalware possuem um brilho magnífico e hipnotizante que contrasta drasticamente com sua personalidade maliciosa, muitas vezes desarmando aqueles que tentam confrontá-lo seriamente.",
    "abilities":[{"name":"Oportunista (Opportunist)", "desc":"Copia os aumentos de atributos do oponente."},{"name": "Infiltrador (Infiltrator)", "desc": "Atravessa a barreira do inimigo e ataca."}],
    "hidden_ability": {"name": "Falha no Sistema (System Failure)", "desc": "Ao entrar em campo, desabilita o último movimento usado pelo oponente e impede de usar o item segurado."},
    "evolution_stage":1,
    "is_final_stage":true,
    "base_stats":{
      "hp":52,
      "atk":48,
      "def":61,
      "spa":94,
      "spd":74,
      "spe":117
    },
    "moves":[
      {
        "level":1,
        "name":"Astonish",
        "type": "Ghost",
        "category": "physical",
        "power": 30,
        "accuracy": 100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level":1,
        "name":"Leer",
        "type":"Normal",
        "accuracy":100,
        "desc": "Diminui a Defesa do oponente."
      },
      {
        "level":4,
        "name":"Thunder Shock",
        "type": "Electric",
        "category": "special",
        "power": 40,
        "accuracy": 100,
        "desc": "Pode paralisar o oponente."
      },
      {
        "level":8,
        "name":"Confuse Ray",
        "type":"Ghost",
        "desc":"Confunde o Oponente."
      },
      {
        "level":12,
        "name":"Night Shade",
        "type":"Ghost",
        "category":"special",
        "accuracy":100,
        "desc":"Causa dano igual ao nível do usuário."
      },
      {
        "level":16,
        "name":"Disable",
        "type":"Normal",
        "accuracy":100,
        "desc": "O oponente não pode usar seu último movimento por alguns turnos."
      },
      {
        "level":20,
        "name":"Shock Wave",
        "type":"Electric",
        "category":"special",
        "power":60,
        "accuracy":"∞",
        "desc": "Ignora Evasão e Precisão."
      },
      {
        "level":24,
        "name":"Camouflage",
        "type": "Normal",
        "desc":"Muda o tipo do usuário de acordo com o local."
      },
      {
        "level":28,
        "name":"Shadow Sneak",
        "type":"Ghost",
        "category":"physical",
        "power":40,
        "accuracy":100,
        "desc": "Usuário ataca primeiro."
      },
      {
        "level":32,
        "name":"Taunt",
        "type":"Dark",
        "desc":"O alvo só pode usar movimentos de ataque."
      },
      {
        "level":37,
        "name":"Glitch Out",
        "type":"Ghost",
        "category":"special",
        "power":60,
        "accuracy":100,
        "desc":"Usuário ataca primeiro, e volta para a pokébola."
      },
      {
        "level":42,
        "name":"Dark Pulse",
        "type":"Dark",
        "category":"special",
        "power":80,
        "accuracy":100,
        "desc": "Pode estremecer o oponente."
      },
      {
        "level":48,
        "name":"Hacking",
        "type":"Dark",
        "accuracy":100,
        "desc": "Por 2 turnos, se o oponente tentar usar um movimento que não seja físico, perde 1/8 de seu HP total."
      },
      {
        "level":55,
        "name":"Eerie Impulse",
        "type":"Electric",
        "accuracy":100,
        "desc": "Diminui drasticamente o Ataque Especial do oponente."
      },
      {
        "level":60,
        "name":"Trick",
        "type":"Psychic",
        "accuracy":100,
        "desc": "Troca de item com o oponente."
      }
    ]
  }
]